{"id": "sla_pr_20250921_0", "source": "government_sla", "text": "HomeNewsPress releaseRevision of Land Betterment Charge Rates from 1 September 2025Press releaseRevision of Land Betterment Charge Rates from 1 September 202529 August 20251.             The Land Betterment Charge (LBC) rates for the period 1 September 2025 to 28 February 2026 have been revised following a review by the Singapore Land Authority (SLA), in consultation with the Chief Valuer.2.             The LBC rates for Use Groups A (Commercial), B1 (Residential, Landed), D (Industrial) and E (Place of Worship/ Civic and Community Institution) have increased on average. The LBC rates for Use Group B2 (Residential, Non-Landed) have increased on average, although 1 sector saw a decrease in the LBC rate. The LBC rates remain unchanged for Use Group C (Hotel/ Hospital) and three other Use Groups F, G and H (see Appendix 1 for the Table of LBC Rates).LBC rates for Use Group A (Commercial)3.             The LBC rates for Use Group A (Commercial) have increased by 0.1% on average. 4 out of the 118 sectors saw an increase in LBC rates of about 3%, with the remaining 114 sectors seeing no change.LBC rates for Use Group B1 (Residential, Landed)4.             The LBC rates for Use Group B1 (Residential, Landed) have increased by 0.4% on average. 13 out of the 118 sectors saw an increase in LBC rates ranging from about 3% to 5%, with the remaining 105 sectors seeing no change.LBC rates for Use Group B2 (Residential, Non-landed)5.             The LBC rates for Use Group B2 (Residential, Non-landed) have increased by 0.7% on average. 19 out of 118 sectors saw an increase in LBC rates ranging from about 2% to 15% and 1 sector saw a decrease in LBC rate of about 4%. The LBC rates for the remaining 98 sectors remain the same.LBC rates for Use Group C (Hotel, Hospital and Nursing homes)6.             The LBC rates for Use Group C (Hotel, Hospital and Nursing homes) remain unchanged.LBC rates for Use Group D (Industrial)7.             The LBC rates for Use Group D (Industrial) have increased by 1.6% on average. 45 out of the 118 sectors saw an increase in LBC rates ranging from about 3% to 10% while the remaining 73 sectors saw no change.LBC rates for Use Group E (Place of Worship/ Civic and Community Institution)8.             The LBC rates for Use Group E (Place of Worship/ Civic and Community Institution) have increased by 2.9% on average, with all sectors seeing an increase ranging from about 3% to 4%.9.             There are no changes to the Use Groups Table and the Geographical Sector.10.          The revised LBC rates (Appendix 1), to be read in conjunction with the Use Groups Table (Appendix 2) and the set of Geographical Sector maps* (Map A and Map B) take effect from 1 September 2025. The new rates will apply to cases which are granted Provisional Permission (PP) or 2nd and subsequent extensions to the PP on or after the effective date.11.          For enquiries on geographical sectors and use groups, please contact SLA at SLA_Enquiry@sla.gov.sg.*   Please use the Land Betterment Charge (LBC) Sector Maps and Rates  to find out the LBC sector number and rates of a particular site.Appendix 1Table for Land Betterment Charge rates per square metre - September 2025Geographical SectorsUse GroupsAB1B2CDEFGH1$15,400$5,320$10,850$13,720$875$994$10-$12$15,400$5,320$10,850$13,720$875$994$10-$13$15,400$5,320$10,850$18,270$875$994$10-$14$15,400$5,320$10,850$16,240$875$994$10-$15$15,400$5,320$10,850$18,270$875$994$10-$16$15,400$5,320$10,850$18,270$875$994$10-$17$13,650$5,320$10,850$14,420$875$994$10-$18$12,880$5,320$10,850$13,020$875$994$10-$19$13,650$5,320$10,850$13,020$875$994$10-$110$12,880$5,320$10,850$13,020$875$994$10-$111$15,750$5,320$10,850$14,840$875$994$10-$112$15,750$5,320$10,850$18,270$875$994$10-$113$10,850$5,320$10,850$12,670$875$994$10-$114$10,850$5,320$10,850$12,670$875$994$10-$115$13,650$5,320$10,850$12,670$875$994$10-$116$13,650$5,320$10,850$14,000$875$994$10-$117$12,600$5,320$10,850$12,670$875$994$10-$118$12,600$5,320$10,850$12,670$875$994$10-$119$12,600$5,320$11,550$15,540$980$994$10-$120$12,600$5,320$11,060$15,540$980$994$10-$121$13,650$5,320$11,060$14,000$980$994$10-$122$8,400$5,320$11,060$12,950$875$994$10-$123$12,250$5,320$12,110$15,540$875$994$10-$124$10,500$5,320$9,310$12,950$875$994$10-$125$9,800$4,830$9,310$12,950$875$994$10-$126$10,150$4,830$9,310$12,950$875$994$10-$127$10,150$4,830$9,310$12,950$875$994$10-$128$9,800$4,830$8,540$12,950$875$994$10-$129$9,800$4,830$8,540$12,950$875$994$10-$130$9,800$4,830$8,540$12,950$875$994$10-$131$10,850$4,830$8,540$12,950$875$994$10-$132$10,850$4,830$8,540$12,950$875$994$10-$133$9,100$4,830$9,310$12,950$875$994$10-$134$8,400$7,000$10,080$12,950$875$994$10-$135$8,400$7,000$11,060$12,950$875$994$10-$136$7,560$7,000$11,970$12,950$875$994$10-$137$10,150$7,000$12,320$12,950$875$994$10-$138$9,100$12,460$12,320$12,950$875$994$10-$139$9,100$17,360$12,950$16,240$875$994$10-$140$10,850$12,460$12,950$16,240$875$994$10-$141$16,800$7,980$12,950$19,110$875$994$10-$142$17,850$12,460$12,950$19,110$875$994$10-$143$14,000$12,460$14,000$18,270$875$994$10-$144$9,450$17,360$12,950$15,540$875$994$10-$145$9,450$12,460$12,950$15,540$875$994$10-$146$9,450$10,010$11,620$12,320$875$994$10-$147$9,450$10,640$11,620$12,320$875$994$10-$148$8,400$10,010$11,620$12,320$980$994$10-$149$8,120$4,830$9,310$9,590$980$994$10-$150$8,120$4,830$11,060$9,590$875$994$10-$151$10,150$5,040$10,150$11,200$1,610$994$10-$152$7,350$4,970$10,080$8,960$1,610$994$10-$153$10,150$5,040$9,590$11,690$1,610$994$10-$154$7,280$4,970$7,490$6,860$1,925$994$10-$155$7,280$4,970$7,490$6,860$1,610$994$10-$156$7,280$4,970$7,490$6,860$1,925$994$10-$157$7,280$5,180$9,450$6,860$1,610$994$10-$158$10,150$6,930$9,730$11,200$1,610$994$10-$159$9,450$6,930$9,590$12,320$1,610$994$10-$160$12,600$6,930$11,060$12,950$875$994$10-$161$10,850$8,540$11,060$12,950$875$994$10-$162$10,850$12,460$12,110$12,950$875$994$10-$163$8,120$10,640$11,060$10,850$875$994$10-$164$6,370$10,640$8,050$8,960$875$994$10-$165$7,350$12,460$10,780$9,590$875$994$10-$166$7,700$17,850$12,320$12,950$840$994$10-$167$10,850$20,650$12,950$16,170$875$994$10-$168$7,700$16,520$11,970$10,850$840$994$10-$169$7,700$16,520$11,970$10,850$840$994$10-$170$9,450$17,850$12,460$12,950$980$994$10-$171$8,330$8,470$11,060$12,950$980$994$10-$172$7,350$5,950$9,730$8,190$2,135$994$10-$173$7,350$5,040$9,450$8,190$2,310$994$10-$174$7,350$5,040$9,590$8,960$2,310$994$10-$175$7,350$5,040$9,450$8,190$2,310$994$10-$176$8,120$5,180$10,850$8,190$1,295$994$10-$177$7,350$5,180$7,490$8,190$2,310$994$10-$178$7,350$5,180$9,590$8,190$2,310$994$10-$179$7,350$5,040$9,450$8,190$2,310$994$10-$180$10,850$5,180$9,590$8,190$2,310$994$10-$181$7,350$5,040$9,450$8,190$2,310$994$10-$182$7,350$5,180$9,590$8,190$2,310$994$10-$183$7,350$5,180$9,590$8,190$2,310$994$10-$184$7,350$5,040$9,450$8,190$2,310$994$10-$185$7,350$5,180$9,590$8,190$2,310$994$10-$186$7,350$5,180$9,450$8,190$2,310$994$10-$187$7,350$5,040$9,450$8,190$2,310$994$10-$188$12,600$7,000$10,850$12,950$2,310$994$10-$189$7,350$4,830$9,100$8,190$896$994$10-$190$7,350$4,830$9,100$8,190$896$994$10-$191$7,350$10,640$11,060$6,580$896$994$10-$192$7,350$8,120$9,940$9,590$896$791$10-$193$9,800$8,120$8,260$11,200$896$791$10-$194$10,850$8,120$11,060$11,200$896$791$10-$195$7,350$8,120$9,450$6,580$896$791$10-$196$7,350$7,980$10,500$6,580$896$791$10$34$197$7,350$7,980$7,700$6,580$840$791$10$34$198$10,850$6,720$7,350$6,580$1,729$791$10$34$199$7,280$5,880$6,860$6,580$1,120$791$10$34$1100$10,850$5,880$7,210$5,460$791$791$10$34$1101$10,850$7,000$9,170$6,580$2,555$791$10$34$1102$7,700$5,180$7,000$9,590$2,555$791$10$34$1103$10,850$7,980$10,150$6,580$2,555$791$10$34$1104$10,850$7,980$10,500$5,600$2,135$791$10$34$1105$10,850$6,720$7,210$5,600$1,960$791$10$34$1106$9,450$4,970$6,860$5,460$805$791$10$34$1107$8,120$7,210$8,120$5,600$1,729$791$10$34$1108$9,450$15,610$10,780$8,190$1,645$791$10$34$1109$8,120$12,810$10,780$8,190$980$791$10$34$1110$11,550$10,290$10,150$8,190$980$791$10$34$1111$10,850$7,000$9,100$8,540$2,695$791$10$34$1112$10,850$7,000$8,540$8,190$1,218$791$10$34$1113$10,850$7,000$8,470$5,600$966$791$10$34$1114$10,850$4,970$6,860$5,460$777$791$10$34$1115$10,850$4,970$6,860$5,460$952$791$10$34$1116$1,001$980$1,015$945$490$413$10$34$1117$9,450$13,160$12,110$16,590$399$413$10$34$1118$1,001$980$1,015$945$399$413$10$34$1Note:Groups A-E: per m2 of gross floor areaGroups F-H: per m2 of land areaAppendix 2Purposes of development within use groupsUse GroupPurposes for which development is permitted or to be authorisedAShop, office, association office, cinema, place of entertainment, clinic, medical suite, restaurant, petrol station, auto-service centre, commercial garage, market, sports and recreation buildingB1Residential (landed dwelling-house[1])B2Residential (non-landed residential building)CHospital, hotel room and hotel-related usesDIndustrial, warehousing, science park, business park, transport depot, airport, dock, port uses, utility installation, telecommunication infrastructure, Mass Rapid Transit Station, Light Rail Transit StationEPlace of worship, community building, community sports and fitness building, educational and institutional uses, government buildingFOpen space, nature reserveGAgricultureHDrain, road, railway, cemetery, Mass Rapid Transit Route, Light Rail Transit Route[1]  Can be land-titled or strata-titled dwelling houseBack to top", "timestamp": "2025-09-21T17:24:55.646082", "url": "https://www.sla.gov.sg/news/press-release/revision-of-land-betterment-charge-rates-from-1-september-2025/", "language": "en", "metadata": {"agency": "SLA", "content_length": 10798, "keywords": ["development", "tender", "land betterment charge", "LBC", "infrastructure"], "title": "Revision of Land Betterment Charge Rates from 1 September 2025", "category": "regulatory_update", "policy_type": "fee_revision", "development_type": "commercial", "affected_residents": 1, "press_release_id": "SLA_20250921_revision_of_land_betterment_ch"}}
{"id": "sla_pr_20250921_1", "source": "government_sla", "text": "HomeNewsPress releaseBoard appointments at the Singapore Land AuthorityPress releaseBoard appointments at the Singapore Land Authority28 July 20251.               The Ministry of Law (MinLaw) today announced Board appointment changes at the Singapore Land Authority (SLA). These appointments will commence on 1 August 2025.Retirement of Current Chairman, Appointment of new Chairman and Deputy Chairman2.               Mr Yeoh Oon Jin, former Executive Chairman of PwC Singapore, will be stepping down as Chairman of SLA Board on 31 July 2025. Mr Yeoh has served on the SLA Board since 1 August 2016. 3.               Under his leadership, SLA has made significant strides in transforming State properties to serve businesses and the community. As Chairman, Mr Yeoh pushed for the adaptive reuse of State properties for more social and community uses, successfully activating diverse spaces for community building and social good and pivoting State properties for uses that are attuned to evolving needs in the community. This includes the rejuvenation of heritage buildings such as the Former St Andrew’s Mission Hospital into vibrant community and lifestyle clusters. 4.               Mr Yeoh also played a key role in advancing the development of the Digital Conveyancing Portal, which will transform the current manual, paper-based conveyancing process into an efficient, streamlined digitalised process. Under Mr Yeoh’s guidance, SLA was elected co-chair of the United Nations Committee of Experts on Global GeoSpatial Information Management and implemented the refreshed National Geospatial Masterplan to drive a geo-enabled Singapore. 5.               MinLaw and SLA extend our deepest gratitude to Mr Yeoh for his outstanding service and contributions. 6.               Mr Loh Lik Peng, founder and director of Unlisted Collection, will be appointed as Chairman of the SLA Board on 1 August 2025. Mr Loh has been on the SLA Board since 1 August 2017 and was appointed as Deputy Chairman on 1 August 2020. 7.               Mr Jerry Koh, Managing Partner at Allen & Gledhill, will be appointed as Deputy Chairman of the SLA Board on 1 August 2025. He has been a member of the Board since 1 August 2020.New Board Members8.               Two new members will be appointed to the SLA Board for a term of two years:Mr Boo Junfeng (Director/Writer, Peanut Pictures Pte. Ltd.)Mr Rafiq Bin Mohamad (Founder and Creative & Branding Director, Feral)Reappointed Board Members9.               The following six members of the Board will be reappointed for a term of two years:Ms Jaelle Ang (Chief Executive Officer and Co-Founder, The Great Room)Ms Angelene Chan (Executive Chairman, DP Architects)Mr Cheung Pui Yuen (Chief Risk Officer, Deloitte SEA)Ms Chong Siak Ching (former Chief Executive Officer, National Gallery Singapore)Mr Lien Choong Luen (General Manager, Gojek Singapore)Mr Melvyn Yeo (Founder and Managing Partner, TRIREC)Out-going Board Member10.            Ms Angeline Poh, Chief Customer and Corporate Development Officer, Mediacorp, will complete her current term of office on 31 July 2025. 11.            MinLaw and SLA extend our deepest gratitude to Ms Poh for her invaluable contributions to SLA during her appointment.Existing Members12.            The following members will continue to serve on the SLA Board:Mr Calvin Phua (Chief Executive, SLA)Mr Colin Chow (Deputy Secretary (Policy), Ministry of Law)Mr Kenny Tan (Deputy Secretary (Workforce), Ministry of Manpower)Ms Koh Swee Yen, SC (Head, International Arbitration, Partner, Commercial & Corporate Disputes, WongPartnership)Mr Lim Soon Chong (Group Head, Global Transaction Services, DBSContentMINISTRY OF LAW28 JULY 2025ANNEX ANew ChairmanMr Loh Lik Peng is the founder and director of Unlisted Collection. Mr Loh runs the Unlisted Collection, an umbrella brand comprising six hotels and over twenty restaurants in Singapore, London, and Ireland. He is a well-known hotelier, restaurateur, and entrepreneur. Prior to the Unlisted Collection, he was a corporate litigator, and an entrepreneur who successfully set up various ventures across Singapore, Ireland, Shanghai, Sydney and London. In 2004, the Singapore Tourism Board awarded Mr Loh with the “New Tourism Entrepreneur Award” for his work in transforming a simple shophouse into Hotel 1929. He was once again awarded the “Tourism Entrepreneur of the Year” award at the Singapore Experience Awards 2011, the most prestigious awards platform in Singapore’s tourism industry. Mr Loh is currently Chairman of SHATEC Institutes, the Singapore Arts School Limited, Singapore Cruise Centre Pte Ltd, and the National Museum of Singapore. He is also a board member of the National Heritage Board.New Deputy ChairmanMr Jerry Koh is Managing Partner of Allen & Gledhill.  Mr Koh has been practising as a corporate lawyer since 1993. His main areas of practice include capital markets, M&A and investment funds. Mr Koh heads the firm’s REITs Practice and Investment Funds Practice, and is the leading authority on REITs and business trusts. Mr Koh also regularly advises on complex securitisation and structured finance transactions, and corporate governance. Mr Koh has been cited as a leading practitioner in Chambers Global, Chambers Asia-Pacific, IFLR1000, The Legal 500 Asia Pacific and Lexology Index. He has also been recognised as a thought leader by Lexology Index and a market leader by IFLR1000 Asia-Pacific.Mr Koh currently serves as board member of The National Kidney Foundation (Singapore), as Secretary of the REIT Association of Singapore and as Council Member of Nee Soon Town Council. New Members Mr Boo Junfeng is a filmmaker. Trained in film schools in Singapore and Spain, Mr Boo started his career making award winning short films, such as Katong Fugue (2007) and Keluar Baris (2008), both of which were featured at the Clermont-Ferrand Short Film Festival. His feature films, Sandcastle (2010) and Apprentice (2016), have both premiered at Cannes Film Festival. In 2018, 2021 and 2025, Mr Boo served as the Creative Director of Singapore’s National Day Parade. Mr Boo was accorded the Young Artist Award (2009) by the National Arts Council and the Singapore Youth Award (2011) by the National Youth Council. He is presently Chairperson of Singapore International Film Festival. Mr Rafiq Mohamad is the Founder and Creative & Branding Director at Feral. Through Feral, Mr Mohamad has played a pivotal role in shaping visual identities and strategies for clients such as the Singapore Art Museum, The Lo & Behold Group and Restaurant Labyrinth, as well as international partners like Malaysia’s Adelphi Collective. Mr Mohamad was also invited by Plus Group to co-curate the launch event for Singapore Tourism Board’s “Passion Made Possible” global campaign and the Re-Route Festival Orchard Road. Prior to Feral, Mr Mohamad refined his craft as a Graphic Designer at W Hotels and Blacksheep Communications, where he developed a keen eye for aesthetics with strategic brand storytelling. Re-appointed MembersMs Jaelle Ang is the CEO and Co-Founder of The Great Room. The Great Room is an award-winning flexible office operator in the Asia-Pacific with locations in Singapore, Hong Kong, Bangkok, and Sydney, including the iconic conserved Raffles Hotel and Eu Yan Sang Building. Prior to The Great Room, Ms Ang headed real estate development at the SET-listed company, Country Group Development Public Company Limited in Thailand, and oversaw the development of Four Seasons Hotel, Four Seasons Residences, and Capella Hotel. Earlier in her career, she has spent time in Citibank and Credit Suisse in the areas of corporate strategy and M&A. She was named as Forbes Asia’s Power Businesswomen 2019, Prestige’s Women of Power 2022, and currently serves on the Executive Committee of the Young Presidents’ Organisation. In addition, she was also a mentor for 500 Startups and Young Women’s Leadership Connection. Ms Ang currently serves on the Board of SGX-listed United Hampshire REIT, Lifelong Learning Institute, and has also served on the Board of Country Group Development PCL in Thailand and Singapore charity, Playeum.Ms Angelene Chan is the Executive Chairman of DP Architects. She leads a multi-disciplinary design practice with 1,000 employees across 16 global offices and eight architecture-related subsidiaries. She also guides strategic growth, champions international presence, and drives design excellence at DP Architects. Prior to her current role, Ms Chan was the CEO of DP Architects from January 2016 to January 2021.Ms Chan is a leading architect who was conferred the President’s Design Award (P*DA) for her design of Sunray Woodcraft Construction Headquarters in 2015. Ms Chan was named the P*DA Designer of the Year, Singapore’s highest design accolade, in 2018 by President Halimah Yacob. Her notable works include The Dubai Mall, the transformation of Wisma Atria shopping mall along Orchard Road, and Paya Lebar Quarter. Ms Chan currently serves on the boards of Building and Construction Authority, Sentosa Development Corporation, National University of Singapore Board of Trustees, and The Lee Kuan Yew Exchange Fellowship. She is also Vice-Chairperson of Dover Park Hospice governing council, Chairperson of WCCM Board of Trustees, and member of the World Cities Summit Knowledge Council.Mr Cheung Pui Yuen is the Chief Risk Officer at Deloitte Southeast Asia. Prior to this appointment, Mr Cheung had assumed various leadership roles in Deloitte, including the CEO of Deloitte Singapore from January 2019 to May 2023. He was appointed as the Singapore Audit & Assurance Leader in 2007, the Audit & Assurance Regional Managing Partner for Deloitte Southeast Asia in 2011, and the Singapore Deputy Managing Partner in 2016. With more than 30 years of public accounting experience, Mr Cheung has led major audits, advised on public listings, and performed acquisitions and due diligence reviews for many prominent organisations. Mr Cheung is currently Chairman of the Accounting Advisory Board of NUS Business School. He also serves on the Singapore Medical Council’s Complaints Panel, ISCA’s Investigation and Disciplinary Panel and the Singapore Institute of Technology’s Industry Advisory Committee (Accountancy Program).Ms Chong Siak Ching was the former Chief Executive Officer at the National Gallery Singapore and Head of the Visual Arts Cluster. Prior to that, she was previously Assistant Chief Executive Officer and Deputy Chief Executive Officer of JTC Corporation, and Chief Executive Officer of Ascendas.Ms Chong had received various awards such as ‘Outstanding CEO of the Year’ in the Singapore Business Awards 2009, Gold Medal by the Singapore Institute of Surveyors and Valuers in 1981, and the NUS Distinguished Alumni Service Award in 2009. She is Singapore’s Non-Resident Ambassador to the Republic of Chile. Ms Chong is currently Chairperson of the NUS Yong Siew Toh Conservatory of Music Governing Board and Deputy Chairperson of the Board of Mandai Parks Holdings Pte Ltd, and Independent Board Director of Venture Corporation Ltd and Sankyo Frontier Co. Ltd. Mr Lien Choong Luen is the General Manager of Gojek Singapore. Prior to this, Mr Lien held leadership appointments in both the public and private sectors. He started his career in the SAF as a Special Forces officer, and was Assistant Director at the Future Systems Directorate as well as a battalion commander. He then joined McKinsey in China, before working with governments and public sector agencies as the SEA head of the McKinsey Centre for Government. Mr Lien was also a strategy consultant at the National Research Foundation Singapore, where he supported the innovation efforts of the organisation. Mr Lien is currently President of the Singapore Athletic Association, board member of Banyan Tree Holdings Limited, and President’s Challenge Council member. Mr Melvyn Yeo is the Founder and Managing Partner of Singapore-based TRIREC, the pioneer and leading venture capital firm that invests globally with a decarbonisation mandate driving the climate change agenda. Mr Yeo started his career and spent more than a decade in Goldman Sachs (Asia) managing global multi-asset portfolios and was also a senior member of the equity derivatives team. He then co-founded Thirdrock Group, the leading Singapore-based multi-family office investment firm which was acquired by UK-based Schroders in 2019. Mr Yeo was Deputy CEO of Schroders Wealth Management Asia, Chairman of the Asia Investment Committee, and was also on the boards of the Singapore and Hong Kong entities of the firm’s wealth management business during his tenure at Schroders. Mr Yeo is currently Council Member of the Sustainable Energy Association of Singapore (SEAS) and Chairman of the Sustainable Energy StartUp Network. He also serves as board member at Halogen Foundation, a non-profit organisation, and is a member of the Sustainability Committee of the Singapore Chinese Chamber of Commerce & Industry. Back to top", "timestamp": "2025-09-21T17:24:59.498849", "url": "https://www.sla.gov.sg/news/press-release/board-appointments-at-the-singapore-land-authority290725/", "language": "en", "metadata": {"agency": "SLA", "content_length": 14480, "keywords": ["development", "tender", "adaptive reuse"], "title": "Board appointments at the Singapore Land Authority", "category": "general_announcement", "policy_type": "information_update", "development_type": "commercial", "tenure_years": "30", "press_release_id": "SLA_20250921_board_appointments_at_the_sing"}}
{"id": "sla_pr_20250921_2", "source": "government_sla", "text": "HomeNewsPress releaseSLA Awards Tender for Tanjong Katong Complex to Jun Jie Development Pte LtdPress releaseSLA Awards Tender for Tanjong Katong Complex to Jun Jie Development Pte Ltd1 July 2025Winning Proposal to Rejuvenate Tanjong Katong Complex into a Vibrant Lifestyle and Cultural DestinationSingapore, 28 June 2025 – The Singapore Land Authority (SLA) has awarded the tender for the redevelopment of Tanjong Katong Complex (TKC) to Jun Jie Development Pte Ltd at a bid price of $90,000,888, following a Concept and Price Revenue Tender process. The site was launched for sale in October 2024 on a 30-year lease tenure and attracted three competitive submissions. Jun Jie Development Pte Ltd was selected for its strong, community-centric proposal that reflects a sensitive yet forward-looking approach to placemaking and heritage integration.Comprehensive Evaluation Based on Quality and Vision2        The tender attracted three proposals and was evaluated based on a two-envelope system that considered both concept and price. Submissions were first assessed on the quality of their design and development concepts, with shortlisted proposals then evaluated on price. The evaluation process placed significant emphasis on how well proposals could retain and enhance TKC’s identity as a community and cultural landmark, while delivering a high-quality, future-ready development. Please refer to Annex A for the key evaluation criteria.A Cultural Anchor in the Heart of Paya Lebar3        Located just 280 metres from the Paya Lebar MRT Interchange, TKC sits at the intersection of cultural heritage and modern connectivity. With proximity to key nodes such as Wisma Geylang Serai, Haig Road Market, and PLQ, the revitalised TKC is poised to anchor the district’s transformation into a vibrant, multicultural lifestyle precinct.4        Jun Jie Development Pte Ltd’s winning proposal stood out for its thoughtful integration of heritage preservation, inclusive design and strong community engagement. At the heart of the concept is a “Community Spine”, envisioned as a vibrant thoroughfare that connects retail, communal, and green spaces in an inclusive and accessible manner. The concept also features:A multipurpose rooftop community deck and food garden to promote wellness and community bonding;Adaptive reuse of TKC’s iconic façade and structural elements to preserve its historical architectural identity;Art and heritage installations that showcase the rich history and contributions of the Geylang Serai precinct; andActive programming developed in collaboration with local partners, including creative markets, wellness activities, and cultural showcasesReinforcing TKC’s Role as a Community and Cultural Hub5        The proposal’s placemaking strategy demonstrated a strong commitment to community engagement and cultural continuity. By creating spaces for shared experiences and enabling ground-up initiatives, the redevelopment aims to reinforce TKC as a key gathering point for the Malay-Muslim community and the wider public. Please see Annex B for artist impressions of the rejuvenated TKC. 6        To complement the revitalised complex and further activate the precinct, Yayasan MENDAKI headquarters, a MUIS office and the Geylang East Public Library will be co-located at the rejuvenated TKC. TKC’s good connections to transport nodes and other amenities will also offer greater convenience and accessibility for users visiting these community organisations and facilities, strengthening TKC’s role as a key cultural and social anchor for the wider community.Issued by:Singapore Land AuthorityAnnex A Key Concept Evaluation CriteriaQuality of Design and Public Space30%Quality of Placemaking30%Quality of Building Essential Works20%Track Record and Financial Strength20%Annex B  Artist Impressions (credit: Jun Jie Development Pte Ltd)Artist impression of external main frontage of rejuvenated TKC\nArtist impression of external main frontage of rejuvenated TKC in the eveningArtist impression of external façade of rejuvenated TKC facing Tanjong Katong Road\nArtist impression of aerial view of rejuvenated TKC\nArtist impression of interior of rejuvenated TKCBack to top", "timestamp": "2025-09-21T17:25:02.808826", "url": "https://www.sla.gov.sg/news/press-release/sla-awards-tender-for-tanjong-katong-complex-to-jun-jie-development-pte-ltd/", "language": "en", "metadata": {"agency": "SLA", "content_length": 5652, "keywords": ["development", "tender", "adaptive reuse"], "title": "SLA Awards Tender for Tanjong Katong Complex to Jun Jie Development Pte Ltd", "category": "general_announcement", "policy_type": "information_update", "location": "The", "press_release_id": "SLA_20250921_sla_awards_tender_for_tanjong_"}}
{"id": "sla_pr_20250921_3", "source": "government_sla", "text": "HomeNewsPress releaseLand Swap between the Singapore Government and  the Regent of Johor for Land Parcels at Holland Road Press releaseLand Swap between the Singapore Government and  the Regent of Johor for Land Parcels at Holland Road 10 June 202510 June 2025 – The Regent of Johor His Royal Highness Tunku Ismail (ROJ) currently owns 21.1ha of land at Holland Road (which comprises Plot B and Plot C, outlined in red in Figure 1). This land has been under the private ownership of the Johor royal family for generations.The ROJ plans to develop his land. The Singapore Government and the ROJ have agreed to undertake a land swap, so that the ROJ’s planned developments will be further away from the Singapore Botanic Gardens UNESCO World Heritage Site. The ROJ will transfer Plot C, which is closer to the Singapore Botanic Gardens UNESCO World Heritage Site, to the Singapore Government. In exchange, the Singapore Government will transfer 8.5ha of State land (Plot A, shaded purple in Figure 1) to the ROJ. The land parcels to be swapped are of comparable value. Plot B will remain under the ROJ’s private ownership.Figure 1: Location PlanThe ROJ may develop his land after the swap (i.e. Plots A and B), which is suitable for low-rise and low-density residential uses. Any development plans will be subject to due process. URA and agencies will assess any development applications and ensure that the proposed development is sensitive to the surrounding site context. Prior to commencement of any works, the development will be subject to environmental studies to mitigate any potential impact on the environment.The Singapore Government will keep Plot C undeveloped for now, while keeping open our future plans for the area.Issued bySingapore Land AuthorityUrban Redevelopment AuthorityBack to top", "timestamp": "2025-09-21T17:25:05.900718", "url": "https://www.sla.gov.sg/news/press-release/land-swap-between-the-singapore-government-and--the-regent-of-johor-for-land-parcels-at-holland-road-/", "language": "en", "metadata": {"agency": "SLA", "content_length": 3286, "keywords": ["development", "tender", "land swap", "heritage site"], "title": "Land Swap between the Singapore Government and  the Regent of Johor for Land Parcels at Holland Road", "category": "general_announcement", "policy_type": "information_update", "location": "Holland", "press_release_id": "SLA_20250921_land_swap_between_the_singapor"}}
{"id": "sla_pr_20250921_4", "source": "government_sla", "text": "HomeNewsPress releaseUpdate on The Redevelopment and Extension of Woodlands CheckpointPress releaseUpdate on The Redevelopment and Extension of Woodlands Checkpoint4 June 2025The Immigration & Checkpoints Authority (ICA) is redeveloping and extending Woodlands Checkpoint (WCP) in phases over the next 10 to 15 years to provide a long-term solution to the chronic congestion at this land crossing. 2.               In 2024, the daily traveller volume at WCP increased by 22% to 327,000 from 269,000 in 2023. During the year-end school holidays in 2024, a record 376,000 travellers used the WCP on 20 December 2024. The average daily number of travellers passing through WCP is projected to reach 400,000 by 2050.Update on Phase 1 Construction3.               Under Phase 1, ICA will build an extension of WCP at the Old Woodlands Town Centre. Construction works for this phase will commence in the third quarter of 2025. This extension will comprise new automated clearance facilities for cargo vehicles, arriving cars, and arriving motorcycles. The Bukit Timah Expressway (BKE) will be extended to create a direct route for vehicles exiting WCP to access the BKE, to reduce traffic congestion on local roads during peak hours.4.               Subsequent phases will include building additional clearance facilities and retrofitting the existing WCP.5.               With the full redevelopment of WCP, ICA will be able to:a.     Improve clearance efficiency across all modes of conveyance (i.e., cargo vehicles, cars, motorcycles, and buses), reducing average travel time from the current 60 minutes to 15 minutes during peak periods;b.     Incorporate more automation, such as automated in-car immigration clearance systems, to increase efficiency;c.     Conduct security checks away from the checkpoint core structure, to mitigate security risks; andd.     Provide holding areas for traffic within the checkpoint, to reduce congestion at the BKE and along peripheral roads around the checkpoint.6.               The redeveloped WCP will enhance the immigration clearance experience for travellers crossing the Causeway. ICA will continue to leverage technology and develop innovative solutions to facilitate cross-border travel and trade, while keeping our borders secure.Acquisition of Private Land7.               ICA has conducted extensive feasibility and technical studies to determine the optimal amount of land needed to meet future traffic and security demands. To facilitate the redevelopment and extension of WCP, two separate small land parcels (with a total area of approximately 0.79ha) located near the middle of the redevelopment profile, which are owned by the Malaysian Government, will be acquired by the Singapore Government. These two land parcels are vegetated and not used.8.               The Singapore Land Authority (SLA) has gazetted the acquisition of the two land parcels today. SLA and ICA will work closely with the Malaysian Government through the acquisition process.9.               We will continue our strong partnership with the Malaysian Government to strengthen connectivity and people-to-people links.IMMIGRATION & CHECKPOINTS AUTHORITYSINGAPORE LAND AUTHORITY4 JUNE 2025Back to top", "timestamp": "2025-09-21T17:25:09.405072", "url": "https://www.sla.gov.sg/news/press-release/update-on-the-redevelopment-and-extension-of-woodlands-checkpoint-pr/", "language": "en", "metadata": {"agency": "SLA", "content_length": 4671, "keywords": ["development", "tender"], "title": "Update on The Redevelopment and Extension of Woodlands Checkpoint", "category": "general_announcement", "policy_type": "information_update", "completion_timeline": "2050", "tenure_years": "15", "press_release_id": "SLA_20250921_update_on_the_redevelopment_an"}}
{"id": "sla_pr_20250921_5", "source": "government_sla", "text": "HomeNewsPress releaseUpdate on The Redevelopment and Extension of Woodlands CheckpointArticleUpdate on The Redevelopment and Extension of Woodlands Checkpoint4 June 2025The Immigration & Checkpoints Authority (ICA) is redeveloping and extending Woodlands Checkpoint (WCP) in phases over the next 10 to 15 years to provide a long-term solution to the chronic congestion at this land crossing.2.               In 2024, the daily traveller volume at WCP increased by 22% to 327,000 from 269,000 in 2023. During the year-end school holidays in 2024, a record 376,000 travellers used the WCP on 20 December 2024. The average daily number of travellers passing through WCP is projected to reach 400,000 by 2050.Update on Phase 1 Construction3.               Under Phase 1, ICA will build an extension of WCP at the Old Woodlands Town Centre. Construction works for this phase will commence in the third quarter of 2025. This extension will comprise new automated clearance facilities for cargo vehicles, arriving cars, and arriving motorcycles. The Bukit Timah Expressway (BKE) will be extended to create a direct route for vehicles exiting WCP to access the BKE, to reduce traffic congestion on local roads during peak hours.4.               Subsequent phases will include building additional clearance facilities and retrofitting the existing WCP.5.               With the full redevelopment of WCP, ICA will be able to:a.     Improve clearance efficiency across all modes of conveyance (i.e., cargo vehicles, cars, motorcycles, and buses), reducing average travel time from the current 60 minutes to 15 minutes during peak periods;b.     Incorporate more automation, such as automated in-car immigration clearance systems, to increase efficiency;c.     Conduct security checks away from the checkpoint core structure, to mitigate security risks; andd.     Provide holding areas for traffic within the checkpoint, to reduce congestion at the BKE and along peripheral roads around the checkpoint.6.               The redeveloped WCP will enhance the immigration clearance experience for travellers crossing the Causeway. ICA will continue to leverage technology and develop innovative solutions to facilitate cross-border travel and trade, while keeping our borders secure.Acquisition of Private Land7.               ICA has conducted extensive feasibility and technical studies to determine the optimal amount of land needed to meet future traffic and security demands. To facilitate the redevelopment and extension of WCP, two separate small land parcels (with a total area of approximately 0.79ha) located near the middle of the redevelopment profile, which are owned by the Malaysian Government, will be acquired by the Singapore Government. These two land parcels are vegetated and not used.8.               The Singapore Land Authority (SLA) has gazetted the acquisition of the two land parcels today. SLA and ICA will work closely with the Malaysian Government through the acquisition process.9.               We will continue our strong partnership with the Malaysian Government to strengthen connectivity and people-to-people links.10.           The notification of the land affected by the acquisition has been published in the Government Gazette on 4 Jun 2025. The Gazette Notification No. 2095 dated 13 May 2025 may be found online at www.egazette.gov.sg. The affected parcels of land are listed below:LotMukimExtent of AcquisitionStreet Address99610L13FullMarsiling Lane99686L13FullMarsiling Lane11.           The plan of the said land may be inspected during normal office hours at the office of the Collector of Land Revenue, Singapore Land Authority Customer Service Centre, 55 Newton Road Level 1, Revenue House, Singapore 307987 from Monday to Friday except Public Holidays. Any person who wishes to claim an interest in compensation on account of the acquisition, but has not received an acquisition notice, may contact the office of the Collector of Land Revenue, Singapore Land Authority at 6323 9829 to arrange for an inquiry to state the nature of his interests in the land, the amount and particulars of his claims to compensation for his interest, the basis or mode of valuation by which the amount claimed is arrived at and his objections, if any, to the measurements of the land.Back to top", "timestamp": "2025-09-21T17:25:11.936231", "url": "https://www.sla.gov.sg/news/press-release/update-on-the-redevelopment-and-extension-of-woodlands-checkpoint/", "language": "en", "metadata": {"agency": "SLA", "content_length": 5759, "keywords": ["development", "tender", "compensation"], "title": "Update on The Redevelopment and Extension of Woodlands Checkpoint", "category": "general_announcement", "policy_type": "information_update", "completion_timeline": "2050", "compensation_provided": true, "tenure_years": "15", "press_release_id": "SLA_20250921_update_on_the_redevelopment_an"}}
{"id": "sla_pr_20250921_6", "source": "government_sla", "text": "HomeNewsPress releaseHistoric Site at 2 Moulmein Road Launched for Tender to Create Vibrant Lifestyle Hub in the heart of SingaporePress releaseHistoric Site at 2 Moulmein Road Launched for Tender to Create Vibrant Lifestyle Hub in the heart of Singapore28 May 2025Singapore, 28 May 2025 – The Singapore Land Authority (SLA) has launched a Price and Quality (PQ) tender for the master tenancy of a cluster of State properties at 2 Moulmein Road. Once a cornerstone of Singapore’s public healthcare system, the site is now poised for a new chapter as a contemporary lifestyle destination comprising a range of lifestyle uses as part of efforts to repurpose State-managed buildings into vibrant spaces for Singaporeans to enjoy.From Legacy to Lifestyle: Iconic State Properties Steeped in Medical History2        Occupying a prominent location near Novena and comprising over 40 buildings across a spacious park-like compound, 2 Moulmein Road served as a pivotal institution in Singapore’s healthcare history for over a century. It was first established in 1913 as the Middleton Hospital – named after Dr. William Robert Colvin Middleton, a dedicated advocate for public health – and later evolved into the Communicable Diseases Centre (CDC), which played a key role in combating major diseases in Singapore such as smallpox, cholera, diphtheria, and more recently, SARS in 2003.3        Beyond its medical legacy, the site bears testimony to Singapore’s evolution in disease management, urban development, and social policy. Its closure in 2018 when the National Centre for Infectious Diseases transited to a new site within the Tan Tock Seng Hospital marked the end of an era and the beginning of a new opportunity. The site remained with Tan Tock Seng Hospital and supported Covid operations till its return to the State in 2023.Reimagining State Properties for the Community4        The historic site, comprising more than 40 buildings with a total Gross Floor Area (GFA) of approximately 139,700 sq ft (or 12,900 sqm), is strategically located near the Novena area and is well connected to key transport nodes – near to the Central Expressway and a short walk to the Novena MRT station.5        Leveraging the properties’ prime location, SLA envisions 2 Moulmein Road as a dynamic lifestyle hub with offerings that will cater to families and multi-generation communities. In this connection, SLA has launched a Price and Quality (PQ) tender on a 5+4-year tenure for a variety of uses including co-living spaces, wellness, health and fitness, pet-friendly services, art gallery, and educational programmes with a quantum of about 41,900 sq ft (i.e., 3,890 sqm) for F&B, retail, among others. This reaffirms SLA’s commitment to unlock new possibilities for State managed properties, realising their potential to be revitalised into spaces for Singaporeans to enjoy.6        Tenderers are encouraged to propose innovative concepts that thoughtfully integrate the site’s heritage character while embracing sustainability and inclusive placemaking. Please see Annex A for site details and photos.Tender Details for 2 Moulmein Road7        The tender proposals will be evaluated based on Price (40%) and Quality (60%), with a higher weightage placed on the Quality component to encourage compelling concepts and forward-looking proposals from prospective tenderers. The quality component will include visioning, business sustainability, preservation of the properties’ heritage elements, and the incorporation of green initiatives. In addition, as 23 of the 44 blocks are subject to Additions & Alteration guidelines, tenderers are required to retain certain architectural elements such as original windows and doors, and the iconic black lion emblem at the centre’s main entrance, to respect the site’s historical fabric.8        The tender will open on 28 May 2025 and close on 6 August 2025. Interested tenderers can visit SLA’s State Property Online Information (SPIO) portal at https://app.sla.gov.sg/spio for more information.                      Creating Spaces to Connect Diverse Communities9        Carrie Wong, Director of SLA’s Business Planning and Development Division, said: “With its rich history, convenient location and unique architecture comprising spacious interiors that overlook surrounding greens, the site at 2 Moulmein Road, exhibits great potential for creative adaptive reuse. This is a rare centrally located landmark site with a sizeable cluster of State properties that can support a wide variety of complimentary and synergistic allowable uses, and we are excited to invite like-minded visionary partners to reimagine this historically significant site as spaces that can connect across generations of Singaporeans. We hope to see creative ideas that honour the past while creating vibrant spaces for today’s communities.”Issued by:Singapore Land Authority28 May 2025 AnnexSite DetailsAddress2 Moulmein RoadTotal Site areaApproximately 985,350.23 sq ft (or 91,541.27 sqm)Total GFAApproximately 139,704.66 sq ft (or 12,978.88 sqm)Approved uses•        Office (e.g.  co-working​)•        Serviced apartments (e.g. co-living​)•        Pre/post-natal care centre•        Spa and wellness•        Pet establishments (e.g. pet clinic/grooming)•        Fitness centre (e.g. yoga/pilates studios)•        Outdoor pickleball and/or padel ball courts•        Commercial schools (e.g. enrichment centres,)•        Corporate training•        Art gallery•        Urban farming•        F&B*•        Retail**Retail and/or F&B uses can be allowed subject to an overall GFA cap of 41,911.36 sq ft (i.e. 3,893.66 sqm). F&B use, inclusive of any Outdoor Refreshment Area (ORA), is subject to a GFA cap of 20,955.68 sq ft (i.e. 1,946.83 sqm).Allowable tenure5+4 yearsTotal Number of Buildings44Total Number of Buildings subjected to A&A guidelines23 comprising the following blocks:1)    8012)    8033)    803A4)    8045)    8056)    8067)    8078)    8089)    80910)  81111)  81212)  81313)  81414)  81515)  87116)  87317)  87418)  87519)  87620)  876A21)  87722)  87823)  879Site oveview*Total Number of Buildings = 44Property imagesAerial view of buildings at 2 Moulmein Road\nAerial view of buildings at 2 Moulmein RoadAerial view of buildings at 2 Moulmein RoadMain Entrance Exterior of Block 804\n\nExterior façade of buildings at 2 Moulmein RoadExternal façadeExterior of Block 875Interior of buildingBack to top", "timestamp": "2025-09-21T17:25:15.437602", "url": "https://www.sla.gov.sg/news/press-release/historic-site-at-2-moulmein-road-launched-for-tender-to-create-vibrant-lifestyle-hub-in-the-heart-of-singapore/", "language": "en", "metadata": {"agency": "SLA", "content_length": 7917, "keywords": ["development", "tender", "state property", "adaptive reuse"], "title": "Historic Site at 2 Moulmein Road Launched for Tender to Create Vibrant Lifestyle Hub in the heart of Singapore", "category": "state_property_development", "policy_type": "adaptive_reuse", "location": "The", "development_type": "commercial", "tenure_years": "5+4", "total_gfa_sqft": 139700, "press_release_id": "SLA_20250921_historic_site_at_2_moulmein_ro"}}
{"id": "sla_pr_20250921_7", "source": "government_sla", "text": "HomeNewsPress releaseRevision of Land Betterment Charge rates from 1 March 2025Press releaseRevision of Land Betterment Charge rates from 1 March 202528 February 2025The Land Betterment Charge (LBC) rates for the period 1 March 2025 to 31 August 2025 have been revised following a review by the Singapore Land Authority (SLA), in consultation with the Chief Valuer. The LBC rates for Use Groups A (Commercial), B1 (Residential, Landed), B2 (Residential, Non-landed), C (Hotel/Hospital), D (Industrial) and E (Place of Worship / Civic and Community Institution) have increased. The LBC rates remain unchanged for Use Groups F, G and H (see Appendix 1) for Table of LBC Rates).LBC rates for Use Group A (Commercial)The LBC rates for Use Group A (Commercial) have increased by 0.6% on average. 22 out of the 118 sectors saw an increase ranging from 2% to 6%. LBC rates for Use Group B1 (Residential, Landed)The LBC rates for Use Group B1 (Residential, landed) have increased by 3% on average across all sectors, with all sectors seeing an increase ranging from 3% to 4%. LBC rates for Use Group B2 (Residential, non-landed)The LBC rates for Use Group B2 (Residential, non-landed) have increased by 0.3% on average. 9 out of the 118 sectors saw an increase ranging from 3% to 4%.  LBC rates for Use Group C (Hotel/Hospital)The LBC rates for Use Group C (Hotel/Hospital) have increased by 0.6% on average. 13 out of the 118 sectors saw an increase ranging from 4% to 9%. LBC rates for Use Group D (Industrial)The LBC rates for Use Group D (Industrial) have increased by 0.1% on average. 6 out of the 118 sectors saw an increase ranging from 2% to 3%. LBC rates for Use Group E (Place of Worship / Civic and Community Institution)The LBC rates for Use Group E (Place of Worship / Civic and Community Institution) have increased by 6% on average, with all sectors seeing an increase ranging from 4% to 6%. There are no changes to the Use Groups Table and the Geographical Sector.The revised LBC rates (Appendix 1), to be read in conjunction with the Use Groups Table (Appendix 2) and the set of Geographical Sector maps* (Map A and Map B), take effect from 1 March 2025. The new rates will apply to cases which are granted Provisional Permission (PP) or 2nd and subsequent extensions to the PP on or after the effective date.For enquiries on geographical sectors and use groups, please contact SLA at SLA_Enquiry@sla.gov.sg.* Please use the Land Betterment Charge (LBC) Sector Maps and Rates to find out the LBC sector number and rates of a particular site.Issued by:Singapore Land Authority28 February 2025Appendix 1TABLE FOR LAND BETTERMENT CHARGE RATES PER SQUARE METRE - MARCH 2025Geographical SectorsUse GroupsAB1B2CDEFGH1$15,400$5,320$10,850$13,720$875$966$10-$12$15,400$5,320$10,850$13,720$875$966$10-$13$15,400$5,320$10,850$18,270$875$966$10-$14$15,400$5,320$10,850$16,240$875$966$10-$15$15,400$5,320$10,850$18,270$875$966$10-$16$15,400$5,320$10,850$18,270$875$966$10-$17$13,650$5,320$10,850$14,420$875$966$10-$18$12,880$5,320$10,850$13,020$875$966$10-$19$13,650$5,320$10,850$13,020$875$966$10-$110$12,880$5,320$10,850$13,020$875$966$10-$111$15,750$5,320$10,850$14,840$875$966$10-$112$15,750$5,320$10,850$18,270$875$966$10-$113$10,850$5,320$10,850$12,670$875$966$10-$114$10,850$5,320$10,850$12,670$875$966$10-$115$13,650$5,320$10,850$12,670$875$966$10-$116$13,650$5,320$10,850$14,000$875$966$10-$117$12,600$5,320$10,850$12,670$875$966$10-$118$12,600$5,320$10,850$12,670$875$966$10-$119$12,600$5,320$11,550$15,540$980$966$10-$120$12,600$5,320$11,060$15,540$980$966$10-$121$13,650$5,320$11,060$14,000$980$966$10-$122$8,400$5,320$11,060$12,950$875$966$10-$123$12,250$5,320$12,110$15,540$875$966$10-$124$10,500$5,320$9,310$12,950$875$966$10-$125$9,800$4,830$9,310$12,950$875$966$10-$126$10,150$4,830$9,310$12,950$875$966$10-$127$10,150$4,830$9,310$12,950$875$966$10-$128$9,800$4,830$8,540$12,950$875$966$10-$129$9,800$4,830$8,540$12,950$875$966$10-$130$9,800$4,830$8,540$12,950$875$966$10-$131$10,850$4,830$8,540$12,950$875$966$10-$132$10,850$4,830$8,540$12,950$875$966$10-$133$9,100$4,830$9,310$12,950$875$966$10-$134$8,400$7,000$10,080$12,950$875$966$10-$135$8,400$7,000$11,060$12,950$875$966$10-$136$7,560$7,000$11,970$12,950$875$966$10-$137$10,150$7,000$12,320$12,950$875$966$10-$138$9,100$12,460$12,320$12,950$875$966$10-$139$9,100$17,360$12,950$16,240$875$966$10-$140$10,850$12,460$12,950$16,240$875$966$10-$141$16,800$7,980$12,950$19,110$875$966$10-$142$17,850$12,460$12,950$19,110$875$966$10-$143$14,000$12,460$14,000$18,270$875$966$10-$144$9,450$17,360$12,950$15,540$875$966$10-$145$9,450$12,460$12,950$15,540$875$966$10-$146$9,450$10,010$11,620$12,320$875$966$10-$147$9,450$10,640$11,620$12,320$875$966$10-$148$8,400$10,010$11,620$12,320$980$966$10-$149$8,120$4,830$9,310$9,590$980$966$10-$150$8,120$4,830$11,060$9,590$875$966$10-$151$10,150$5,040$10,150$11,200$1,561$966$10-$152$7,350$4,970$10,080$8,960$1,561$966$10-$153$10,150$5,040$9,590$11,690$1,561$966$10-$154$7,280$4,970$7,490$6,860$1,876$966$10-$155$7,280$4,970$7,490$6,860$1,561$966$10-$156$7,280$4,970$7,490$6,860$1,876$966$10-$157$7,280$5,180$9,450$6,860$1,561$966$10-$158$10,150$6,720$9,730$11,200$1,561$966$10-$159$9,450$6,720$9,590$12,320$1,561$966$10-$160$12,600$6,720$11,060$12,950$875$966$10-$161$10,850$8,120$11,060$12,950$875$966$10-$162$10,850$12,460$12,110$12,950$875$966$10-$163$8,120$10,640$11,060$10,850$875$966$10-$164$6,370$10,640$8,050$8,960$875$966$10-$165$7,350$12,460$10,780$9,590$875$966$10-$166$7,700$17,360$12,320$12,950$819$966$10-$167$10,850$20,020$12,950$16,170$875$966$10-$168$7,700$16,030$11,970$10,850$819$966$10-$169$7,700$16,030$11,970$10,850$819$966$10-$170$9,450$17,360$12,460$12,950$980$966$10-$171$8,330$8,190$11,060$12,950$980$966$10-$172$7,350$5,950$9,730$8,190$2,072$966$10-$173$7,350$5,040$9,450$8,190$2,219$966$10-$174$7,350$5,040$9,590$8,960$2,219$966$10-$175$7,350$5,040$9,450$8,190$2,219$966$10-$176$8,120$5,180$10,850$8,190$1,295$966$10-$177$7,350$5,180$7,490$8,190$2,219$966$10-$178$7,350$5,180$9,590$8,190$2,219$966$10-$179$7,350$5,040$9,450$8,190$2,219$966$10-$180$10,850$5,180$9,590$8,190$2,219$966$10-$181$7,350$5,040$9,450$8,190$2,219$966$10-$182$7,350$5,180$9,590$8,190$2,219$966$10-$183$7,350$5,180$9,590$8,190$2,219$966$10-$184$7,350$5,040$9,450$8,190$2,219$966$10-$185$7,350$5,180$9,590$8,190$2,219$966$10-$186$7,350$5,180$9,450$8,190$2,219$966$10-$187$7,350$5,040$9,450$8,190$2,219$966$10-$188$12,600$7,000$10,850$12,950$2,219$966$10-$189$7,350$4,830$8,120$8,190$896$966$10-$190$7,350$4,830$8,120$8,190$896$966$10-$191$7,350$10,640$11,060$6,580$896$966$10-$192$7,350$8,120$9,940$9,590$896$770$10-$193$9,800$8,120$7,840$11,200$896$770$10-$194$10,850$8,120$10,850$11,200$896$770$10-$195$7,350$8,120$9,100$6,580$896$770$10-$196$7,350$7,980$9,100$6,580$896$770$10$34$197$7,350$7,980$7,560$6,580$819$770$10$34$198$10,850$6,720$7,210$6,580$1,603$770$10$34$199$7,280$5,880$6,720$6,580$1,120$770$10$34$1100$10,850$5,880$6,930$5,460$721$770$10$34$1101$10,850$7,000$9,170$6,580$2,338$770$10$34$1102$7,700$5,180$6,860$9,590$2,338$770$10$34$1103$10,850$7,980$9,730$6,580$2,338$770$10$34$1104$10,850$7,980$9,590$5,600$2,072$770$10$34$1105$10,850$6,720$6,930$5,600$1,911$770$10$34$1106$9,450$4,970$6,720$5,460$777$770$10$34$1107$8,120$7,210$8,120$5,600$1,680$770$10$34$1108$9,450$14,840$10,780$8,190$1,603$770$10$34$1109$8,120$12,460$10,780$8,190$980$770$10$34$1110$11,550$10,010$10,150$8,190$980$770$10$34$1111$10,500$7,000$9,450$8,540$2,548$770$10$34$1112$10,850$7,000$8,400$8,190$1,218$770$10$34$1113$10,500$7,000$8,260$5,600$966$770$10$34$1114$10,500$4,970$6,720$5,460$707$770$10$34$1115$10,500$4,970$6,720$5,460$924$770$10$34$1116$1,001$980$1,015$945$476$399$10$34$1117$9,450$13,160$12,110$16,590$385$399$10$34$1118$1,001$980$1,015$945$385$399$10$34$1Note:Groups A-E: per m2 of gross floor areaGroups F-H: per m2 of land areaAppendix 2Purposes of development within use groupsUse GroupPurposes for which development is permitted or to be authorisedAShop, office, association office, cinema, place of entertainment, clinic, medical suite, restaurant, petrol station, auto-service centre, commercial garage, market, sports and recreation buildingB1Residential (landed dwelling-house[1])B2Residential (non-landed residential building)CHospital, hotel room and hotel-related usesDIndustrial, warehousing, science park, business park, transport depot, airport, dock, port uses, utility installation, telecommunication infrastructure, Mass Rapid Transit Station, Light Rail Transit StationEPlace of worship, community building, community sports and fitness building, educational and institutional uses, government buildingFOpen space, nature reserveGAgricultureHDrain, road, railway, cemetery, Mass Rapid Transit Route, Light Rail Transit Route[1]  Can be land-titled or strata-titled dwelling houseBack to top", "timestamp": "2025-09-21T17:25:22.326907", "url": "https://www.sla.gov.sg/news/press-release/revision-of-land-betterment-charge-rates-from-1-march-2025/", "language": "en", "metadata": {"agency": "SLA", "content_length": 10258, "keywords": ["development", "tender", "land betterment charge", "LBC", "infrastructure"], "title": "Revision of Land Betterment Charge rates from 1 March 2025", "category": "regulatory_update", "policy_type": "fee_revision", "development_type": "commercial", "affected_residents": 1, "press_release_id": "SLA_20250921_revision_of_land_betterment_ch"}}
{"id": "sla_pr_20250921_8", "source": "government_sla", "text": "HomeNewsPress releaseSLA announces new partnerships to harness space-based technologies and data to address climate challengesPress releaseSLA announces new partnerships to harness space-based technologies and data to address climate challenges26 February 2025Inks Memorandum of Understanding with OSTIn to collaborate on an Earth Observation Initiative to catalyse the use of earth observation data to drive innovative solutions for sustainability and humanitarian goals across the Asia-Pacific region.Announces Memorandum of Understanding with NUS CRISP to leverage remote sensing data to enhance carbon biomass research, and expand mapping and land monitoring applications. Singapore, 26 February 2025 – The Singapore Land Authority (SLA) today announced two strategic partnerships and key initiatives to harness space-based technologies and data to drive geo-enabled solutions to address climate mitigation and adaptation challenges.2        As Singapore's national geospatial and mapping agency, SLA plays a pivotal role in the nation’s geospatial development and capability-building efforts. The new partnerships will broaden the use of space-for-earth technology and translate space-based data into actionable insights to support Singapore's goal of building a safe, sustainable, and smart city.3        Two Memorandums of Understanding to mark the partnerships were signed at the sidelines of the Global Space Technology Convention and Exhibition 2025 (GSTCE 2025), organised by Singapore Space & Technology Limited (SSTL) and held at the Sands Expo and Convention Centre on 26 – 27 February 2025. Please refer to Annex A for the keynote address by Mr Colin Low, Chief Executive, SLA. Growing Singapore’s space technology ecosystem4        In line with Singapore's commitment to grow the local space technology ecosystem, SLA announced a collaboration with the Office for Space Technology and Industry (OSTIn), an office under the Economic Development Board (EDB), to jointly develop Singapore's space technology ecosystem, to support local and regional geospatial needs. An MOU was signed by Mr Colin Low, Chief Executive, SLA, and Mr Jonathan Hung, Executive Director, OSTIn.5        This partnership leverages SLA's geospatial expertise and OSTIn's strengths in space technology for the newly launched Earth Observation Initiative (EOI). Together, both agencies will catalyse the use of earth observation data and enrich the Global Navigation Satellite System (GNSS) and remote sensing industry. This will translate to greater accuracy in tracking changes in coastlines, landscapes, streetscapes and vegetation over time, aid in advanced predictive analysis and forecasting the impact of climate change, and guide decision-making and solutioning for sustainability and humanitarian efforts in Singapore, and across the Asia-Pacific region. Please refer to Annex B for more details.6        Mr Colin Low, Chief Executive, SLA, elaborates, “SLA’s strategic partnership with OSTIn on the Earth Observation Initiative marks a significant step in accelerating geo-enabled solutions to support Singapore’s sustainability agenda. Building on SLA’s experience in utilising space-based technologies and data for geospatial projects, the collaboration will drive innovative solutions and deepen regional cooperation to address challenges brought about by climate change.” Leveraging geospatial technologies and data to improve environmental monitoring7        In addition, SLA and the National University of Singapore Centre for Remote Imaging, Sensing and Processing (NUS CRISP) signed a Memorandum of Understanding (MOU) to collaborate on advancing research in remote sensing and geospatial applications. This partnership will leverage SLA’s 3D mapping data and CRISP’s expertise in satellite imaging to develop innovative solutions that support national mapping, carbon biomass research, and geospatial analytics. The MOU was signed by Dr Victor Khoo, Director, Survey & Geomatics, SLA, and Dr Lim Kim Hwa, Director, NUS CRISP.8        Through this collaboration, SLA and NUS CRISP will work closely to explore the integration of LiDAR* data with remote sensing methodologies to enhance environmental monitoring and carbon biomass assessments with increased accuracy. The partnership will also focus on extending the use of Synthetic Aperture Radar (SAR) and InSAR** technologies to improve geospatial monitoring and mapping capabilities, including the tracking of mainland and coastal vertical land motion changes across the whole of Singapore, to enable effective coastal protection measures, flood-risk monitoring and efficient infrastructure planning. Please refer to Annex C for more details.9        Dr Victor Khoo, Director, Survey & Geomatics, SLA, explains, “SLA is pleased to extend our partnership with NUS, through an inaugural collaboration with NUS CRISP, to harness geospatial technologies to enhance remote sensing and environmental monitoring capabilities. The collaboration underscores a shared commitment to push the boundaries of satellite remote sensing applications and uncover new opportunities for geospatial advancements, to support ongoing efforts to build more liveable and climate-resilient cities.”*LiDAR – Stands for “light detection and ranging”, a technology that uses laser light to create a 3D representation of the earth’s surface.**InSAR – Stands for “Interferometric Synthetic Aperture Radar” which uses radar images from orbiting satellites to map ground deformation and track volcanic activity.10       SLA is also pleased to announce its partnership with Delft University of Technology to integrate space-based data to enhance the monitoring of land motion and sea-level rise across borders. This collaboration with Delft University of Technology includes the “3Sisters” project that has brought together geodetic expertise from Singapore, the Netherlands, and Indonesia, to develop new tracking systems such as the Dynamic Digital Elevation Model. Unlike static models, the dynamic model improves the prediction of long-term land motion and its impact on cross border coastal regions to help nations formulate best practices in climate change adaptation strategies. International Geospatial Knowledge Sharing11       To facilitate knowledge sharing, SLA will be organising a seminar ‘Mapping Earth from Space’, supported by SSTL. The seminar will delve into the realm of space-based geospatial technologies, including Global Navigation Satellite Systems (GNSS) and Earth Observation (EO), and explore their critical role in ensuring cities are safe, sustainable, and smart. Please refer to Annex D for more details.12       For more details of GSTCE 2025, please refer here: Global Space Technology Convention & Exhibition (GSTCE) – Space Technology at the Centre of Igniting Innovation – for Space & for EarthMr Colin Low, Chief Executive, SLA (right), and Mr Jonathan Hung, Executive Director, OSTIn (left), Dr Victor Khoo, Director, Survey & Geomatics, SLA (left), and Dr Lim Kim Hwa, Director, NUS CRISP (rAnnex A - Keynote Address by Mr Colin Low, Chief Executive, Singapore Land Authority at the Opening of Global Space Technology Convention & Exhibition 2025 at Sands Expo & Convention Centre, Marina Bay Sands, Singapore on 26 February 2025 (Wednesday)Connecting Land and Space for a Safe, Sustainable, and Smart SingaporeIntroduction1.       A very good morning to:a)      Deputy Prime Minister and Minister for Trade and Industry, Mr Gan Kim Yong;b)       Chairman, Singapore Space and Technology Ltd, Mr Jeremy Chan;c)       Distinguished guests, ladies, and gentlemen.2.       Welcome to the Global Space Technology Convention and Exhibition 2025. To all our international guests, thank you for joining us as we commemorate this milestone that Singapore is taking as we usher in a new era of growth for space technology and innovation.Space-based Technologies and Freedom of Information3.       In the recent decades, space-based technologies have enabled the unprecedented freedom of access to information through Earth Observation. As highlighted in Deputy Prime Minister Gan’s speech, the growth and proliferation of space-based information has far-reaching implications for Singapore and the world. From enhancing our environmental monitoring capabilities to improving communication networks, satellite data is now instrumental in addressing various global challenges, including those related to climate change and sustainability.4.       The power of satellite imagery in crisis management and environmental monitoring is deeply impactful on a personal level. I'm sure many of us have seen satellite images of the devastation caused by disasters like the recent California wildfires or the earthquake that struck Hualien, Taiwan back in April. Being able to see for yourself the extent of these disasters and their impact on communities truly compels us to act swiftly and decisively to address the broader reaching impacts of climate change.Partnerships and Collaborations5.       As we've heard from the speakers before us, the effective use of space-based technology requires strategic partnerships. In line with Singapore's commitment to growing our space technology ecosystem, I'm pleased to share that earlier today, SLA signed two new MOUs: one with the Office for Space Technology and Industry (OSTIn), and another with NUS's Centre for Remote Imaging, Sensing and Processing (CRISP).6.       SLA’s collaboration with OSTIn focuses on developing Singapore's space technology ecosystem, supporting local and regional geospatial needs. This partnership leverages SLA's geospatial expertise and OSTIn's strength in space technology, particularly through their newly launched Earth Observation Initiative. Together, we aim to catalyse the use of Earth observation data to support local and regional geospatial needs, while driving innovative solutions for sustainability and humanitarian efforts across the Asia-Pacific region.7.       To expand our insights into existing data, SLA’s partnership with CRISP aims to enhance existing research into carbon biomass estimation by sharing SLA’s LiDAR data acquired during our national mapping project. This collaboration facilitates the joint development and research of Synthetic Aperture Radar (SAR) for geospatial and mapping applications, paving the way for innovative technologies that will contribute to Singapore's vision of a safe, sustainable, and smart city.8.       Beyond these new partnerships, SLA continues to build on our existing international collaborations. Presently, we are working with Delft University of Technology to integrate space-based data to enhance geodetic infrastructure for monitoring land motion and sea-level rise. A part of this collaborative effort is the “3Sisters” project that aims to bring together geodetic expertise from Singapore, the Netherlands, and Indonesia, highlighting the importance of international collaboration for informed decision making and developing of climate change adaptation strategies.A Safe, Sustainable, and Smart Singapore9.       As Singapore's national mapping and geospatial agency, SLA plays a pivotal role in harnessing space-for-earth technology. Our geospatial expertise is fundamental in translating space-based data into actionable insights that drive Singapore's goal of becoming a safe, sustainable, and smart city.10.      Since 2006, SLA oversees SiReNT, Singapore’s national positioning infrastructure. Today, SLA has ten reference stations, allowing us to provide users with precise and real-time positioning accuracies of up to three centimetres and a post-processed accuracy of five millimetres.11.      SLA is committed to maintaining, expanding and upgrading SiReNT. By collaborating with the Maritime and Port Authority of Singapore (MPA) and the Civil Aviation Authority of Singapore (CAAS), SLA is exploring to increase the number of SiReNT stations. This enhances the accuracy and reliability of data that goes into a wide range of applications like autonomous vehicle navigation, construction automation, and environmental and terrestrial monitoring.12.      SLA is also looking to collaborate with the Public Utilities Board (PUB), MPA, and the National Environment Agency’s Centre for Climate Research Singapore (CCRS) to combat sea level rise by integrating SiReNT data with SAR imagery for land motion monitoring at the millimetre-level. This aligns with our work with various United Nations technical groups and the International Hydrographic Organization on integrating terrestrial, maritime, and cadastral domains, showcasing our commitment to innovative sustainability solutions.Capacity Building: The Geomatics Pipeline13.      As we advance geospatial technology, we must address a critical concern: the need for a robust geomatics pipeline to meet industry demand and tackle system vulnerabilities.14.      This need is highlighted by threats to space-based technologies, such as signal interference and jamming, which can disrupt critical GNSS-dependent sectors like aviation and emergency services. SLA is addressing these challenges by identifying interference sources, assessing impacts, and alerting users to potential disruptions. However, to truly enhance our resilience, we must prioritise capacity building in the geospatial field to develop expertise in managing these evolving threats15.      SLA, as Singapore’s leading geospatial agency, is committed to developing local talent in geomatics, geodesy, and space-based competencies. To foster the next generation of innovators and problem solvers, SLA, in collaboration with Singapore Space and Technology Limited (SSTL), organised the GNSS Innovation Quest (GIQ) that is specifically designed for tertiary and junior college students. The challenge encouraged participants to develop innovative solutions to real-world problems using SiReNT data. Winning projects of 2024’s iteration included autonomous delivery robots by Singapore Polytechnic students and a system for detecting invasive plant species in parks by NUS students, showcasing the versatility of SiReNT data across various sectors.16.      To strengthen the local geomatics pipeline, SLA is actively working to expand formal education pathways in this field. We're exploring the development of new tertiary education programmes specifically focused on geomatics. This initiative builds upon our existing collaborations with academic institutions like Singapore Polytechnic where we established the \"SLA Geomatics Book Prize\" for students in the Diploma of Civil Engineering programme. These efforts aim to create more structured and comprehensive educational opportunities in geomatics, enhancing our resilience in the face of vulnerabilities.Closing17.      As we stand at the forefront of space-based technological advancements, the imperative for collaboration has never been more crucial. The challenges we face—from climate change to disaster management—are global in nature and require a unified approach.18.      I urge each of you to seize the networking opportunities available here. Engage in discussions, share your insights, and explore potential collaborations. It is through these connections that we can drive innovative solutions using space-based technology, pushing the boundaries of what's possible and addressing pressing global issues.19.      Let us leave this conference not just with new knowledge, but with new partnerships and a renewed commitment to harnessing the power of space technology for the betterment of our world.20.      I wish you all an enriching and exciting conference. Thank you. Annex B - Memorandum of Understanding between Singapore Land Authority (SLA) and Office for Space Technology and Industry (OSTIn)Quotes“The partnership between OSTIn and SLA marks a significant step in leveraging Space Technology for national development. Tapping on SLA’s geospatial capabilities, we aim to enhance land management, environment monitoring and urban planning.  This will also boost our efforts in areas such as the Earth Observation Initiative (EOI), where we will utilise space technologies to drive innovative solutions for real world issues. We look forward to working with like-minded partners as we harness satellite technology to drive innovation, sustainability, and resilience from Singapore.”-       Mr Jonathan Hung, Executive Director, OSTIn“SLA’s strategic partnership with OSTIn on the Earth Observation Initiative marks a significant step in accelerating geo-enabled solutions to support Singapore’s sustainability agenda. Building on SLA’s experience in utilising space-based technologies and data for geospatial projects, the collaboration will drive innovative solutions and deepen regional cooperation to address challenges brought about by climate change.”-       Mr Colin Low, Chief Executive of SLAAnnex C - Memorandum of Understanding between Singapore Land Authority (SLA) and National University of Singapore Centre for Remote Imaging, Sensing and Processing (NUS CRISP) Quotes“The collaboration between CRISP and SLA is a powerful step forward in geospatial research. By integrating SLA’s LiDAR data with CRISP’s remote sensing expertise, we can enhance national mapping, environmental monitoring, and urban planning. This partnership isn’t just about advancing technology—it’s about using data-driven insights to support sustainability and smarter urban development. True innovation happens when experts collaborate, exchange ideas, and push boundaries. I’m excited about the impact we can create together, shaping the future of remote sensing and geospatial science for a more sustainable Singapore.”-       Dr Lim Kim Hwa, Director, NUS CRISP “SLA is pleased to extend our partnership with NUS, through an inaugural collaboration with NUS CRISP, to harness geospatial technologies to enhance remote sensing and environmental monitoring capabilities. The collaboration underscores a shared commitment to push the boundaries of satellite remote sensing applications and uncover new opportunities for geospatial advancements, to support ongoing efforts to build more liveable and climate-resilient cities.”-        Dr Victor Khoo, Director, Survey & Geomatics, SLAAnnex D - SLA Workshop – Mapping Earth from Space26 February 2025, 2.00pm – 5.30pmVenue: Begonia Jr Ballroom 3011, Sands Expo and Convention Centre, Marina Bay Sands. Synopsis:Organised by the Singapore Land Authority (SLA) and supported by the Singapore Space & Technology Ltd (SSTL), the seminar ‘Mapping Earth from Space’ will delve into the advanced realm of space-based geospatial technologies, including Global Navigation Satellite Systems (GNSS) and Earth Observation (EO), and explore their critical role in ensuring cities are safe, sustainable, and smart.The seminar will highlight the synergistic relationship between space and geospatial domain. Discover how advancements in GNSS can enhance reliability and accuracy of geospatial applications, how Earth Observation can be used to analyse environmental and land changes and contribute to sustainable development. The seminar programme features six presentations and a panel discussion with experts in the field, discussing how GNSS interference treat, new applications of satellite imagery and SAR data, adoption of GEOAI and geoinformation modelling. Attendees will also gain valuable knowledge and insights on the latest development in positioning and mapping techniques from local and international speakers.Workshop ProgrammeTable captionTimeAgenda2.00pm – 2.05pmWelcome RemarkMr Sin Lye Chong, Assistant Chief Executive (Singapore Land Authority)2.05pm – 2.10pmWelcome RemarkMr Thomas Zhuo, Executive Director (Singapore Space & Technology Ltd)2.10pm – 2.30pmPresentationIntegrated Monitoring of Land and Sea through Space-Based and Geodetic TechniquesMr Evert Mulder (Singapore Land Authority)2.30pm – 2.50pmPresentationGeospatial Insights for Sustainable Cities: CoolNUS-BEAM Framework for Urban Microclimate and Greenery InsightsDr Marcel Ignatius 2.50pm – 3.10pmPresentationBuilding Building Damage Assessment with the Segment Anything Model from High-Resolution Optical Satellite Images.Ms Huang XiaoJing (Centre for Remote Imaging Sensing and Processing) 3.10pm – 3.30pmPresentationSAR Data and Solutions for Resilience and SustainabilityMr Vincent Kessler (Synspective)3.30pm – 3.50pmBreak3.50pm – 4.10pmPresentationGNSS Signals Security Issues: Detection, Protection and MitigationDr Dinesh Manandhar (Tokyo University) 4.10pm – 4.30pmPresentationNMC’s Role in Strengthening National Timing, GNSS, and Earth Observation Resilience Through Backup Navigation and Timing Systems.Dr Meng Yusong (A*Star) 4.30pm – 5.30pmPanel DiscussionCreating Safe, Sustainable, and Smart Cities: Integrating Space Technology for FutureUrban Developments. Moderator: Dr. Victor Khoo from the Singapore Land Authority (SLA).Panelists:– Mr. Satoshi Kogure from the Japan Aerospace Exploration Agency (JAXA)– Dr. Zhang Yan Liang from WESTON– Dr. Dinesh Manandhar from the University of Tokyo– Dr. Meng Yusong from the Agency for Science, Technology and Research (A*STAR)– Ms. Huang Xiaojing from the Centre for Remote Imaging, Sensing, and Processing (CRISP) 5.30pmEnd of EventBack to top", "timestamp": "2025-09-21T17:25:24.584054", "url": "https://www.sla.gov.sg/news/press-release/sla-announces-new-partnerships-to-harness-space-based-technologies-and-data-to-address-climate-challenges/", "language": "en", "metadata": {"agency": "SLA", "content_length": 22797, "keywords": ["development", "tender", "infrastructure"], "title": "SLA announces new partnerships to harness space-based technologies and data to address climate challenges", "category": "market_data", "policy_type": "statistical_release", "location": "Winning", "press_release_id": "SLA_20250921_sla_announces_new_partnerships"}}
{"id": "sla_stats_20250921", "source": "government_sla", "text": "Statistics | Singapore Land AuthoritySkip to main contentClick to expand masthead to find out how to identify an official government websiteA Singapore Government Agency Website How to identifyA Singapore Government Agency Website How to identifyOfficial website links end with .gov.sgGovernment agencies communicate via .gov.sg websites (e.g. go.gov.sg/open). Trusted websitesSecure websites use HTTPSLook for a lock () or https:// as an added precaution. Share sensitive information only on official, secure websites.Government officials will never ask you to transfer money or disclose bank log-in details over a phone call.Call the 24/7 ScamShield Helpline at 1799 if you are unsure if something is a scam.About SLAE-ServicesPropertiesGeospatialRegulatoryJoin usNewsHomeNewsStatisticsStatisticsBrowse the list of datasets compiled by SLA.Last updated 31 July 2025If you are using the datasets listed here, please review the Singapore Open Data License.Name of DatasetDataset FormatData TypeUpdate FrequencyLast UpdateCorporate Performance - Approval of Land LotsOverview of the corporate performance of SLA on the number of approved land lotsDownloadTextualHalf-Yearly5 May 2025          Corporate Performance - Approval of Strata LotsOverview of the corporate performance of SLA on the number of approved strata lotsDownloadTextualHalf-Yearly5 May 2025Corporate Performance - Breakdown by Use of SLA-Managed PropertiesOverview of the corporate performance of SLA on the breakdown by use of SLA Managed Properties in estimated gross floor area.DownloadTextualYearly5 May 2025Corporate Performance - Electronic Searches (DIPS, STARS)Provides the number of property ownership searches on DIPS and STARS.DownloadTextualYearly5 May 2025Corporate Performance - Occupancy Rate of State PropertiesThe occupancy rate of State properties managedDownloadTextualHalf-Yearly5 May 2025                 Corporate Performance - Utilisation Rate of State LandThe utilisation rate of State land managedDownloadTextualHalf-Yearly5 May 2025                  Corporate Performance - Integrated Land Information Service (INLIS) Transaction VolumeOverview of the corporate performance of SLA on the transaction volume for INLISDownloadTextualHalf-Yearly5 May 2025   Corporate Performance - Issuance of Title Documents for Completed Private PropertiesProvides the number of title documents issued for completed private propertiesDownloadTextualHalf-Yearly5 May 2025Corporate Performance - Registration of Documents Lodged for HDB PropertiesProvides the total number of caveats and instruments registrated for HDB propertiesDownloadTextualHalf-Yearly5 May 2025Corporate Performance - Registration of Documents Lodged for Private PropertiesProvides the total number of caveats and instruments registered for private propertiesDownloadTextualHalf-Yearly5 May 2025Corporate Performance - Total Area of State Land Sold to Private SectorOverview of the corporate performance of SLA on the total area of state land being sold to private sectorDownloadTextualHalf-Yearly5 May 2025Corporate Performance - Total Area of State Land Sold to Public AgenciesOverview of the total area of state land sold to public sector agencies.DownloadTextualHalf-Yearly5 May 2025 List and details of vacant Non-Residential State Properties available for rent nowTo publish State Properties information that are available for rent.URLTextualDaily-List and details of vacant Non-Residential State Properties that may be available for tenderTo publish State Properties information to that that may be available for tenderURLTextualDaily-List and details of vacant Residential State Properties available for rent nowTo publish State Properties information that are available for rent.URLTextualDaily-SLA Sale SitesAnnouncement of launch and award of sale sites by SLADownloadTextualAd-Hoc2 Dec 2016SLA Rental Tender and Bidding Results Information To provide the rental tender and bidding results to the publicDownloadTextualQuarterly5 May 2025Total Land Area of Singapore (as at 30 Jun) Provides the total land area of Singapore (includes off-shore islands) as at 30 JuneDownloadTextualYearly5 May 2025  Total Land Area of Singapore (as at 31 Dec) Provides the total land area of Singapore (includes off-shore islands) as at 31 DecemberDownloadTextualYearly5 May 2025 Name of DatasetList of Replacement Titles Issued on or after 1 Jan 2002List of Application for Replacement of Certificates of Title pending registrationStatistics for Transfers Registered in 2019 Statistics for Transfers Registered in 2020 Statistics for Transfers Registered in 2021 Statistics for Transfers Registered in 2022Statistics for Transfers Registered in 2023Back toNewsOther pages in NewsAnnual & Sustainability ReportCircularsCommunity ImpactCorporate publicationsLegislationPress releaseSee all pagesBack to topSingapore Land AuthorityAbout SLAE-ServicesGeospatialRegulatoryJoin usNewsFAQsGeospatialSGTenders and leasing opportunitiesReach usContactFeedback© 2025 Government of Singapore, last updated 17 September 2025Report VulnerabilityPrivacy StatementTerms of UseREACHMade with IsomerBuilt by Open Government ProductsSingapore Land AuthorityAbout SLAE-ServicesGeospatialRegulatoryJoin usNewsFAQsGeospatialSGTenders and leasing opportunitiesReach usContactFeedback© 2025 Government of Singapore, last updated 17 September 2025Report VulnerabilityPrivacy StatementTerms of UseREACHMade with IsomerBuilt by Open Government Products", "timestamp": "2025-09-21T17:25:25.458663", "url": "https://www.sla.gov.sg/news/statistics", "language": "en", "metadata": {"agency": "SLA", "content_length": 5466, "keywords": ["tender"], "title": "Statistics", "category": "market_statistics", "policy_type": "data_release"}}
{"id": "sla_land_sales_20250921", "source": "government_sla", "text": "Land Sales and Lease Management | Singapore Land AuthoritySkip to main contentClick to expand masthead to find out how to identify an official government websiteA Singapore Government Agency Website How to identifyA Singapore Government Agency Website How to identifyOfficial website links end with .gov.sgGovernment agencies communicate via .gov.sg websites (e.g. go.gov.sg/open). Trusted websitesSecure websites use HTTPSLook for a lock () or https:// as an added precaution. Share sensitive information only on official, secure websites.Government officials will never ask you to transfer money or disclose bank log-in details over a phone call.Call the 24/7 ScamShield Helpline at 1799 if you are unsure if something is a scam.About SLAE-ServicesPropertiesGeospatialRegulatoryJoin usNewsHomePropertiesLand Sales and Lease ManagementLand Sales and Lease ManagementFind out how SLA manages the sale of State land and administers State leases.Last updated 24 July 2025Lease ManagementsFind out about Land Betterment Charge and Lease ManagementManagement of Land SalesFind out how SLA assists the Government in managing its land sales system.Sale of Remnant LandFind out what is remnant land and how you can purchase remnant land to add value to your adjoining private land.Singapore Land AuthorityAbout SLAE-ServicesGeospatialRegulatoryJoin usNewsFAQsGeospatialSGTenders and leasing opportunitiesReach usContactFeedback© 2025 Government of Singapore, last updated 17 September 2025Report VulnerabilityPrivacy StatementTerms of UseREACHMade with IsomerBuilt by Open Government ProductsSingapore Land AuthorityAbout SLAE-ServicesGeospatialRegulatoryJoin usNewsFAQsGeospatialSGTenders and leasing opportunitiesReach usContactFeedback© 2025 Government of Singapore, last updated 17 September 2025Report VulnerabilityPrivacy StatementTerms of UseREACHMade with IsomerBuilt by Open Government Products", "timestamp": "2025-09-21T17:25:26.219794", "url": "https://www.sla.gov.sg/properties/land-sales-and-lease-management/", "language": "en", "metadata": {"agency": "SLA", "content_length": 1896, "keywords": ["tender", "land betterment charge", "land sales"], "title": "Land Sales and Lease Management", "category": "land_sales_management", "policy_type": "property_availability"}}
