{"id": "sla_land_sales_20250921", "source": "government_sla", "text": "Land Sales and Lease Management | Singapore Land AuthoritySkip to main contentClick to expand masthead to find out how to identify an official government websiteA Singapore Government Agency Website How to identifyA Singapore Government Agency Website How to identifyOfficial website links end with .gov.sgGovernment agencies communicate via .gov.sg websites (e.g. go.gov.sg/open). Trusted websitesSecure websites use HTTPSLook for a lock () or https:// as an added precaution. Share sensitive information only on official, secure websites.Government officials will never ask you to transfer money or disclose bank log-in details over a phone call.Call the 24/7 ScamShield Helpline at 1799 if you are unsure if something is a scam.About SLAE-ServicesPropertiesGeospatialRegulatoryJoin usNewsHomePropertiesLand Sales and Lease ManagementLand Sales and Lease ManagementFind out how SLA manages the sale of State land and administers State leases.Last updated 24 July 2025Lease ManagementsFind out about Land Betterment Charge and Lease ManagementManagement of Land SalesFind out how SLA assists the Government in managing its land sales system.Sale of Remnant LandFind out what is remnant land and how you can purchase remnant land to add value to your adjoining private land.Singapore Land AuthorityAbout SLAE-ServicesGeospatialRegulatoryJoin usNewsFAQsGeospatialSGTenders and leasing opportunitiesReach usContactFeedback© 2025 Government of Singapore, last updated 17 September 2025Report VulnerabilityPrivacy StatementTerms of UseREACHMade with IsomerBuilt by Open Government ProductsSingapore Land AuthorityAbout SLAE-ServicesGeospatialRegulatoryJoin usNewsFAQsGeospatialSGTenders and leasing opportunitiesReach usContactFeedback© 2025 Government of Singapore, last updated 17 September 2025Report VulnerabilityPrivacy StatementTerms of UseREACHMade with IsomerBuilt by Open Government Products", "timestamp": "2025-09-21T17:25:26.219794", "url": "https://www.sla.gov.sg/properties/land-sales-and-lease-management/", "language": "en", "metadata": {"agency": "SLA", "content_length": 1896, "keywords": ["tender", "land betterment charge", "land sales"], "title": "Land Sales and Lease Management", "category": "land_sales_management", "policy_type": "property_availability"}}
