[
  {
    "id": "mnd_pr_b308c96f7e8a9f08",
    "source": "government_mnd",
    "text": "NewsroomPress ReleasesView2024 private housing supply highest since 2013 with latest 2H2024 Government Land Sales (GLS) ProgrammeJun 25, 2024Sustained supply of 5,050 private residential units to be tendered out in 2H2024, similar to the 5,450 units in 1H2024.Total supply of 11,110 private residential units in 2024 (including 610 units from the activated Reserve List site tendered out in May 2024) will be the highest supply introduced in a single year since 2013.Good spread of sites island-wide will provide a variety of housing options that cater to different needs and preferences.The Government will continue to release a steady supply of private residential units over the next few years, with supply calibrated to account for prevailing economic and property market conditions.1. The Government today announced the Government Land Sales (GLS) Programme for 2H2024, which comprises ten Confirmed List sites and nine Reserve List sites. Together, these sites can yield about 8,140 private residential units, 113,650 sqm gross floor area (GFA) of commercial space and 530 hotel rooms (seeAppendix 1&Appendix 2).2. The Confirmed List comprises nine private residential sites (including one EC site) and one commercial & residential site, which can collectively yield about 5,050 private residential units (including 560 EC units) and 14,300 sqm GFA of commercial space.3. The Reserve List comprises five private residential sites (including two EC sites), one commercial site, two White sites and one hotel site. These sites can potentially yield an additional 3,090 private residential units (including 730 EC units), 99,350 sqm GFA of commercial space and 530 hotel rooms.Supply of private housing4. The private housing market has shown signs of stabilisation, with price momentum easing1with the ramp-up in the GLS programme over the last two years2. To continue to cater to housing demand and maintain market stability, the Government will sustain the GLS supply, with 5,050 units to be released via the Confirmed List of the 2H2024 GLS programme, similar to the 5,450 units released in 1H2024.5. For 2024 as a whole, the total supply of 11,110 units (including 610 units from the activated Reserve List site at Zion Road (Parcel B)) to be released will be the highest since 2013. The supply is from a good mix of sites across different geographical regions that offers a variety of housing options to meet different needs and preferences. In addition, the Government will make available a selection of sites on the Reserve List that can yield an additional 3,090 units for developers to initiate for development if they assess that there is demand.6. The Government will continue to release a steady supply of private housing in future GLS programmes to cater to demand, with supply calibrated every six months to account for prevailing economic and property market conditions.Supply of office space7. The White site for a mixed-use development at Woodlands Avenue 2 and the short-term lease commercial site at Punggol Walk will be carried over from the 1H2024 Reserve List to the 2H2024 Reserve List. These two sites will provide the opportunity for developers to initiate the development of more office and retail space if they assess that there is demand.Supply of hotel rooms8. The 2H2024 Reserve List includes a site at River Valley Road carried over from the 1H2024 Reserve List, which will allow developers to increase the supply of hotel rooms based on demand.1Based on URA’s Property Price Index, the increase in private residential property prices has moderated from 8.6% in 2022 to 6.8% in 2023. The pace of price increase has continued to moderate in 1Q2024, with the 1.4% gain in the quarter smaller than the quarterly average increase of 2.0% in 2022 -2023.2The Government increased the supply of private housing on the Confirmed List of the GLS programme to 9,250 units in 2023, from 3,605 units in 2021 and 6,290 units in 2022.Appendix 1------------PROPOSED RESIDENTIAL, COMMERCIAL AND HOTEL SITES FOR 2H2024 GLS PROGRAMMES/NLocationSite Area (ha)Proposed GPREstimated No. of Residential Units(1)Estimated No. of Hotel RoomsEstimated Commercial Space (m2)Estimated Launch DateSales AgentConfirmed ListResidential Sites1Tampines Street 95 (EC)2.252.556000Aug 2024HDB2Faber Walk(2)(3)2.581.440000Sep 2024URA3Lentor Gardens(4)2.062.150000Oct 2024URA4River Valley Green (Parcel B)(5)1.173.55800500Oct 2024URA5Bayshore Road1.054.251500Nov 2024URA6Media Circle (Parcel A)(2)(6)0.813.73450400Nov 2024URA7Media Circle (Parcel B)(2)(6)0.974.34850400Nov 2024URA8Chuan Grove(2)(7)1.583.055000Dec 2024URA9Holland Link(2)(8)1.721.424000Dec 2024URACommercial & Residential Sites10Chencharu Close(2)(9)2.943.2875013,000Sep 2024HDBTotal (Confirmed List)5,050014,300S/NLocationSite Area (ha)Proposed GPREstimated No. of Residential Units(1)Estimated No. of Hotel RoomsEstimated Commercial Space (m2)Estimated Available Date(15)Sales AgentReserve ListResidential Sites1Senja Close (EC)(7)1.013.029500AvailableHDB2Marina Gardens Lane(2)0.615.640000Oct 2024URA3Woodlands Drive 17 (EC)22.581.743500Oct 2024HDB4Holland Plain(2)(10)1.581.827500Dec 2024URA5River Valley Green (Parcel C)(2)1.153.547000Dec 2024URACommercial Sites6Punggol Walk(11)1.001.40013,350AvailableURAWhite Sites7Marina Gardens Crescent(12)1.734.277506,000AvailableURA8Woodlands Avenue 2(13)2.754.2440078,000AvailableURAHotel Sites9River Valley Road(14)1.022.805302,000AvailableURATotal (Reserve List)3,09053099,350Total (Confirmed List and Reserve List)8,140530113,650(1) The estimated number of dwelling units (DU) for Executive Condominium and private residential sites takes into account the average unit sizes of recent comparable developments and prevailing Development Control guidelines.(2) New sites introduced in 2H2024.(3) Site has a DU cap of 403 residential units.(4) Site is required to provide a minimum 600 sqm GFA for childcare centre.(5) A portion of the GFA for the site will be allowed for Serviced Apartments use (estimated 220 SA units). Site has a retail cap of 500 sqm GFA.(6) Sites have a retail cap of 400 sqm GFA.(7) Sites are required to provide a minimum 500 sqm GFA for childcare centre.(8) Site has a DU cap of 242 residential units.(9) A mixed-use development with integrated community and bus interchange facilities (estimated 8,500 sqm GFA) at GPR of 3.26. Retail cap is 13,000 sqm GFA.(10) Site has a DU cap of 279 residential units and is required to provide a minimum 500 sqm GFA for childcare centre.(11) Site is required to provide a minimum office quantum of 8,400 sqm GFA and a minimum 650 sqm GFA for childcare centre.(12) Site has a retail cap of 6,000 sqm GFA and is required to provide a minimum 500 sqm GFA for childcare centre.(13) Site has a retail cap of 33,000 sqm GFA and is required to provide a minimum office quantum of 45,000 sqm GFA.(14) Site has a retail cap of 2,000 sqm GFA.(15) Refers to estimated date the detailed conditions of sale will be available and applications can be submitted.Appendix 2------------Status of the GLS Programme for the first half of 2024 (1H2024)(as of 25 June 2024)1. The 1H2024 GLS Programme comprises nineteen sites, of which ten are on the Confirmed List and nine are on the Reserve List.2. To date, nine of the Confirmed List sites have been launched for tender and the remaining Confirmed List site at Tampines Street 94 will be launched in the later part of June 2024.3. The Reserve List site at Zion Road (Parcel B) has been successfully activated. The public tender for the site was launched on 13 May 2024 and will be closing on 18 July 2024.4. As a result, a total of five residential sites, one commercial site, one White site and one hotel site remain on the 1H2024 Reserve List and will be carried over to the second half of 2024 (2H2024) GLS Programme.NewsroomSpeechesPress ReleasesParliament Matters",
    "timestamp": "2024-06-01T00:00:00",
    "url": "https://www.mnd.gov.sg/newsroom/press-releases/view/2024-private-housing-supply-highest-since-2013-with-latest-2h2024-government-land-sales-(gls)-programme",
    "language": "en",
    "metadata": {
      "title": "2024 private housing supply highest since 2013 with latest 2H2024 Government Land Sales (GLS) Programme",
      "agency": "MND",
      "category": "housing_policy",
      "policy_type": "bto_policy",
      "source_type": "press_releases",
      "sentiment_impact": "immediate",
      "scraping_priority": "high",
      "content_length": 7875,
      "keywords": [
        "housing",
        "property",
        "bto",
        "hdb",
        "private housing",
        "gls",
        "land sales",
        "ease"
      ],
      "target_demographics": [],
      "market_segments": [
        "public_housing",
        "private_residential",
        "rental_market"
      ]
    },
    "content_length": 7875,
    "word_count": 1143,
    "is_truncated": false,
    "original_length": 7875,
    "extraction_method": "web_scraping"
  },
  {
    "id": "mnd_pr_9ffe6f697e5d8ef6",
    "source": "government_mnd",
    "text": "NewsroomPress ReleasesViewGovernment Supply of Private Housing in 2023 is Highest in a Decade with Release of 2H2023 Government Land Sales ProgrammeJun 21, 2023The Confirmed List supply of private housing in the GLS programme has been further ramped up by 26% in 2H2023 compared to 1H2023.With the 2H2023 supply, the total Confirmed List supply of around 9,250 units for the whole of 2023 will be the highest in a decade.Complementing the property market cooling measures, this supply injection will bring the total pipeline supply of private housing (including ECs) to about 63,500 units, and cater to resilient demand.1. The Government today announced the Government Land Sales (GLS) Programme for the second half of 2023 (2H2023), which comprises eight Confirmed List sites and nine Reserve List sites. These sites can yield about 8,590 private residential units, 98,250 sqm gross floor area (GFA) of commercial space and 530 hotel rooms (seeAppendix 1&Appendix 2).2. All eight Confirmed List sites are private residential sites [including one Executive Condominium (EC) site], which can collectively yield about 5,160 private residential units (including 560 EC units) and 4,900 sqm GFA of commercial space. The Reserve List comprises six private residential sites (including two EC sites), one commercial site, one White site and one hotel site. These Reserve List sites can yield an additional 3,430 private residential units (including 855 EC units), 93,350 sqm GFA of commercial space and 530 hotel rooms.3. The Government will continue to monitor economic and property market conditions closely and calibrate the supply of future GLS Programmes, as necessary, to help meet demand and promote market stability.Supply of Private Housing4. To cater to strong private housing demand, the Government has decided to increase the supply of private housing on the Confirmed List further to 5,160 units, from 4,090 units in the 1H2023 GLS Programme. This brings the total Confirmed List supply to 9,250 units in 2023, the highest level since 2013. This is also nearly 50% higher than the supply in 2022, and around 2.5 times the supply in 2021. The Government has also made available sites on the Reserve List that can yield an additional 3,430 units, for developers to initiate for development if they assess that there is demand.5. The increased Confirmed List supply for 2H2023 will add to the existing pipeline supply to meet the housing needs of the population. Specifically, it will bring the total pipeline supply of private housing (including ECs) to about 63,500 units, comprising 50,200 units with planning approval and 13,300 units from GLS sites and awarded en-bloc sites that have yet to be granted planning approval. Of these, about 40,400 units will be completed between 2023 and 2025, which is more than double the 20,000 units completed from 2020 to 2022. This forms part of the total supply of about 100,000 public and private housing units to be completed between 2023 and 2025, which will help to cater to housing needs in the immediate few years ahead.Supply of Office Space6. The White site for a mixed-use development at Woodlands Avenue 2 and the short-term lease commercial site at Punggol Walk will be carried over from the 1H2023 Reserve List to the 2H2023 Reserve List. These two sites will provide opportunity for developers to initiate the development of more office and retail space if they assess that there is demand.Supply of Hotel Rooms7. The 2H2023 Reserve List includes a site at River Valley Road carried over from the 1H2023 Reserve List. This will provide opportunity for developers to initiate the development of more hotel rooms if there is demand.Appendix 1------------Proposed Residential, Commercial and Hotel Sites for 2H2023 GLS ProgrammeS/NLocationSite Area (ha)Proposed GPREstimated No. of Residential Units(1)Estimated No. of Hotel RoomsEstimated Commercial Space (m2)Estimated Launch DateSales AgentConfirmed ListResidential Sites1Clementi Avenue 1(2)1.343.550000Aug 2023URA2Pine Grove (Parcel B)(3)2.502.156500Aug 2023URA3Lorong 1 Toa Payoh1.574.277500Sep 2023URA4Orchard Boulevard(4)(5)0.683.52700500Oct 2023URA5Plantation Close (EC)2.012.856000Nov 2023HDB6Upper Thomson Road (Parcel A)(4)(6)2.442.259502,000Dec 2023URA7Upper Thomson Road (Parcel B)(4)3.202.594000Dec 2023URA8Zion Road (Parcel A)(4)(7)1.515.695502,400Dec 2023URATotal (Confirmed List)5,16004,900S/NLocationSite Area (ha)Proposed GPREstimated No. of Residential Units(1)Estimated No. of Hotel RoomsEstimated Commercial Space (m2)Estimated Available Date(13)Sales AgentReserve ListResidential Sites1Lentor Gardens(8)2.062.150000AvailableURA2Senja Close (EC)(9)1.013.029500AvailableHDB3Holland Drive(4)1.234.768000Nov 2023URA4De Souza Avenue(4)(9)1.911.635000Nov 2023URA5Tampines Street 95 (EC)(4)2.252.556000Nov 2023HDB6Zion Road (Parcel B)(4)0.925.660500Dec 2023URACommercial Sites7Punggol Walk(10)1.001.40013,350AvailableURAWhite Sites8Woodlands Avenue 2(11)2.754.2440078,000AvailableURAHotel Sites9River Valley Road(12)1.022.805302,000AvailableURATotal (Reserve List)3,43053093,350Total (Confirmed List and Reserve List)8,59053098,250(1) The estimated number of dwelling units (DU) for Executive Condominium and private residential sites take into account the average unit sizes of recent comparable developments and prevailing Development Control guidelines.(2) Site is imposed with a DU cap of 501 residential units.(3) Site is imposed with a DU cap of 565 residential units.(4) New sites introduced in 2H2023.(5) Site is imposed with a retail cap of 500 sqm.(6) Site is imposed with a retail cap of 2,000 sqm GFA and a minimum 1,000 sqm GFA for childcare centre. Serviced apartment use will be allowed for the site.(7) Site is imposed with a retail cap of 2,400 sqm GFA and a minimum 600 sqm GFA for childcare centre. Serviced apartment use will be allowed for the site.(8) Site is imposed with a minimum 600 sqm GFA for childcare centre.(9) Sites are imposed with a minimum 500 sqm GFA for childcare centre.(10) Site is imposed with a minimum office quantum of 8,400 sqm GFA and a minimum 650 sqm GFA for childcare centre.(11) Site is imposed with a retail cap of 33,000 sqm GFA and a minimum office quantum of 45,000 sqm GFA.(12) Site is imposed with a retail cap of 2,000 sqm GFA.(13) Refers to estimated date the detailed conditions of sale will be available, and applications can be submitted.Appendix 2------------Status of the GLS Programme for the First Half of 2023 (1H2023)(as of 21 June 2023)1. The 1H2023 GLS Programme comprises sixteen sites, of which seven are on the Confirmed List and nine are on the Reserve List.2. To date, four of the Confirmed List sites have been launched for tender and the remaining three Confirmed List sites [i.e. Media Circle, Marina Gardens Crescent and Jurong Lake District] will be launched in late-June 2023.3. All nine sites on the Reserve List, comprising six private residential sites, one commercial site, one White site and one hotel site, will be carried over to the 2H2023 GLS Programme.NewsroomSpeechesPress ReleasesParliament Matters",
    "timestamp": "2023-06-01T00:00:00",
    "url": "https://www.mnd.gov.sg/newsroom/press-releases/view/government-supply-of-private-housing-in-2023-is-highest-in-a-decade-with-release-of-2h2023-government-land-sales-programme",
    "language": "en",
    "metadata": {
      "title": "Government Supply of Private Housing in 2023 is Highest in a Decade with Release of 2H2023 Government Land Sales Programme",
      "agency": "MND",
      "category": "housing_policy",
      "policy_type": "cooling_measures",
      "source_type": "press_releases",
      "sentiment_impact": "immediate",
      "scraping_priority": "high",
      "content_length": 7113,
      "keywords": [
        "housing",
        "property",
        "hdb",
        "private housing",
        "cooling measures",
        "gls",
        "land sales",
        "ease"
      ],
      "target_demographics": [],
      "market_segments": [
        "public_housing",
        "private_residential"
      ]
    },
    "content_length": 7113,
    "word_count": 1028,
    "is_truncated": false,
    "original_length": 7113,
    "extraction_method": "web_scraping"
  },
  {
    "id": "mnd_pr_b3b23065a6eebe24",
    "source": "government_mnd",
    "text": "NewsroomPress ReleasesViewChanges to the Board Members of the Housing & Development BoardSep 30, 2024The Ministry of National Development (MND) has announced changes to the board appointments at the Housing & Development Board (HDB). The new term of the HDB Board will be from 1 Oct 2024 to 30 Sep 2026.The Board will continue to be chaired by incumbent Chairperson, Mr Benny Lim Siang Hoe. Five new members have been appointed to the Board. Nine members have been re-appointed, and four members have stepped down.Re-appointment of Chairperson and Board MembersMr Benny Lim Siang Hoehas been re-appointed as Chairperson, HDB.Nine Board members have also been re-appointed. They are:Mr Tan Meng Dui, Chief Executive Officer, HDBMs Rita Soh Siow Lan, Managing Director, RDC Architects Pte LtdMr Tan Wah Yeow, Non-Resident Ambassador to the Kingdom of NorwayMs Chia Yong Yong, Consultant, Foo Kwok LLCMr Ong Tze-Ch’in, Chief Executive, PUB, Singapore’s National Water Agency​Ms Pearlyn Phau Yee Meng, Group Chief Executive Officer, Singapore Life Holdings Pte LtdMr Wendell Wong Hin Pkin, Director, Dispute Resolution; Co-Head, Investigations; and Co-Head, Criminal Law Practice, Drew & Napier LLCDr Wong Sweet Fun, Senior Consultant, Geriatric Medicine; Deputy Chairman, Medical Board (Community Care & Population Health), Khoo Teck Puat Hospital & Yishun HealthMr Zakir Hussain,Associate Editor, The Straits Times, SPH Media TrustNew Board MembersThe five new HDB Board members are from diverse backgrounds, with experience in different sectors and professional fields. They are:Mr Chua Eu Jin, Managing Director, Institutional Relations; Managing Director, Singapore Market, Temasek International Pte LtdMs Ho Hern Shin, Deputy Managing Director, Financial Supervision, Monetary Authority SingaporeMr Jason Leow Juan Thong, Advisor, CapitaLand Group Pte Ltd; Former CEO, CapitaLand DevelopmentCOL John N. Samuel, Deputy Commander, Joint Intelligence Command Digital and Intelligence Service, Singapore Armed ForcesMr Melvin Yong Yik Chye, Assistant Secretary-General, National Trades Union Congress (NTUC)Board Members Stepping DownFour Board members have stepped down at the end of their term on 30 Sep 2024. MND and HDB wish to extend gratitude for their service, guidance and invaluable contributions during their term of appointment. They are:Mr Stephen Lim Beng Lin, Chief Executive Officer, SQL View Pte LtdMs Jacqueline Loh Wai Yin, Deputy Managing Director (Corporate Development), Monetary Authority of SingaporeMr Patrick Tay Teck Guan, Assistant Secretary-General, National Trades Union Congress (NTUC)BG Chan Ching Hao, Director Joint Operations, Singapore Armed Forces​​Issued By: MND & HDBDate: 30 September 2024NewsroomSpeechesPress ReleasesParliament Matters",
    "timestamp": "2025-09-21T16:43:52.962401",
    "url": "https://www.mnd.gov.sg/newsroom/press-releases/view/changes-to-the-board-members-of-the-housing---development-board",
    "language": "en",
    "metadata": {
      "title": "Changes to the Board Members of the Housing & Development Board",
      "agency": "MND",
      "category": "housing_policy",
      "policy_type": "estate_upgrading",
      "source_type": "press_releases",
      "sentiment_impact": "immediate",
      "scraping_priority": "high",
      "content_length": 2774,
      "keywords": [
        "housing",
        "hdb",
        "ease"
      ],
      "target_demographics": [
        "seniors"
      ],
      "market_segments": [
        "public_housing",
        "rental_market"
      ]
    },
    "content_length": 2774,
    "word_count": 390,
    "is_truncated": false,
    "original_length": 2774,
    "extraction_method": "web_scraping"
  },
  {
    "id": "mnd_pr_15f43d6f348f1db8",
    "source": "government_mnd",
    "text": "NewsroomPress ReleasesView$135 million to Upgrade Private Estates Under the Expanded Estate Upgrading ProgrammeFeb 8, 2025To better support seniors living in private estates to age well in their communities, Minister for National Development, Mr Desmond Lee announced that the Ministry of National Development (MND) will be launching the first batch of the new Estate Upgrading Programme (Silver Estate) and has set aside $11 million to upgrade 7 selected Silver Estates. MND has also set aside $124 million to upgrade 25 private estates island-wide under the next bound of the Estate Upgrading Programme (Regular Estate), which has been expanded in scope to include senior-friendly enhancements.Background of EUP2 Launched in 2000, the Estate Upgrading Programme (EUP) enhances the physical condition and living environment of older private estates through the upgrading of infrastructure and recreational facilities to better cater to residents’ needs. With the improved facilities, residents will have a more conducive environment for community-based activities, which helps to foster community bonding. To date, around $216 million in total has been allocated across 10 batches of the EUP to upgrade older private estates in Singapore. This has benefited over 54,000 households in 74 private estates.3 Upgrading works under the EUP vary based on the conditions and needs of each estate, and typically include the provision of new or upgraded facilities such as recreational spaces (e.g. parks or playgrounds) for community bonding, improved connectivity and accessibility (e.g. drain coverings, ramps, staircases and footpath lighting) to create a safer environment for residents, and enhanced estate identity (e.g. estate markers) to better reflect the unique character of the neighbourhood. SeeAnnex Afor examples of the EUP upgrading works.Enhancements to EUP4 As Singapore’s elderly population grows, having senior-friendly and accessible infrastructure within their estates is crucial for enabling our seniors to live more comfortably and age-in-place. As part of the Age Well SG programme, MND will: (i) introduce a new EUP for Silver Estates, where estates with higher concentration of seniors and have benefitted from EUP some time ago will be selected for senior-friendly enhancements to better support their ageing residents; and (ii) expand the scope of upgrading under the EUP for Regular Estates to include senior-friendly enhancements.Silver Estates5 7 Silver Estates have been selected for the first batch of the new EUP (Silver Estate). MND will set aside $11 million to upgrade these estates. The improvements to the living spaces of the selected estates will benefit over 3,700 households and focus on making it safer and easier for our seniors to stay active and engaged in their daily activities. SeeAnnex Bfor the list of selected Silver Estates.Regular Estates6 25 estates have been selected for the next bound of the EUP (Regular Estates). MND will set aside $124 million to upgrade these 25 private estates. The upgrading works for these estates will commence over the next five years, and over 16,600 households are expected to benefit from the improved facilities. SeeAnnex Cfor the list of selected Regular Estates.7 Minister for National Development Mr Desmond Lee said, “Under Age Well SG, we want to support ageing-in-place, where our seniors go about their daily activities safely and comfortably in their homes and neighbourhoods, including those living in private residential estates. For the next bound of the EUP, we will continue to improve our estates for all ages. We will be launching the first batch of the Silver EUP this year, where we have selected 7 Silver Estates. These estates will receive additional senior-friendly enhancements to better support their ageing residents and improve accessibility and safety within the estates. MND will also upgrade 25 private estates under the Regular EUP. In total, we will be setting aside $135 million to upgrade private estates island-wide, and we are expecting to benefit over 20,300 households island-wide. Upgrading works for the selected private estates will commence progressively over the next five years. We will work closely with the project teams and the community to ensure that the enhancements are practical and meaningful.”8 The EUP contributes to the rejuvenation of private estates around Singapore to meet residents’ needs and to promote community bonding. As part of the EUP process, feedback and input will be sought from residents, and their views will be incorporated in the upgrading decisions. Residents are encouraged to participate actively in these discussions to ensure that the upgrading works meet their needs. This would also provide the community a greater sense of ownership for the common spaces in their estates.Issued by : Ministry of National DevelopmentDate : 8 February 2025Annex AExamples of EUP Upgrading WorksS/NImprovement WorksPurposeExample1Installing footpath lightingTo enhance safety and security2Covering drainsTo create footpaths so that residents need not walk on the roadBeforeAfter3Constructing barrier-free rampsTo provide barrier-free access to Persons with Disabilities and elderly using wheelchairs or Personal Mobility AidsBeforeAfter4Upgrading parks, playgrounds, fitness cornersTo promote community bonding and active ageingBeforeAfter5Introducing community gardensTo promote community bonding and active ageing6Installing estate markerTo enhance estate identity7Installing wayfinding featuresTo support the elderly in navigation through the provision of directional signs on routes between social areasAnnex BEstates Selected for Batch 1 of the Estate Upgrading Programme (Silver Estate)7 Silver Estates with over 3,700 householdsS/NEstate Name1Fengshan2Hillview3Hong Leong Gardens & Pasir Panjang4MacPherson Gardens5Mayfair Park6Teachers' Housing7Thomson & Yew Lian ParkAnnex CEstates Selected for Batches 11 and 12 of the Estate Upgrading Programme (Regular Estate)25Regular Estates covering over 16,600 householdsS/NEstate Name1Along Upper East Coast Road2Balmoral3Bright Hill Crescent4Bukit Regency & Ridgevale Gardens5Burgundy & Highgate6Dunearn7Farrer Holland8Inglewood & Westlake Gardens9Jalan Merdu10Jalan Naung Estate & Realty Park11Jelita, Lim Tai See, Farrer Leedon & Holland12Joo Chiat NC 2 @ Marine Parade13Lakepoint & Lakeside Grove14Loyang Villas & Mera Terrace15Oasis @ Mulberry16Pasir Ris Beach Park17Serangoon Garden & Lorong Chuan18Shepherd’s Hills19Shrewsbury20Sunbird-Apollo21Telok Kurau22Thomson23Towner Ville24West Coast Park, Hong Leong Gardens (West Coast Road) & Pasir Panjang Gardens (Mas Kuning Terrace)25YunnanNewsroomSpeechesPress ReleasesParliament Matters",
    "timestamp": "2025-09-21T16:43:54.072257",
    "url": "https://www.mnd.gov.sg/newsroom/press-releases/view/135-million-to-upgrade-private-estates-under-the--expanded-estate-upgrading-programme",
    "language": "en",
    "metadata": {
      "title": "$135 million to Upgrade Private Estates Under the \rExpanded Estate Upgrading Programme",
      "agency": "MND",
      "category": "housing_policy",
      "policy_type": "bto_policy",
      "source_type": "press_releases",
      "sentiment_impact": "immediate",
      "scraping_priority": "high",
      "content_length": 6736,
      "keywords": [
        "housing",
        "estate",
        "upgrading",
        "hip",
        "ease"
      ],
      "target_demographics": [
        "upgraders",
        "seniors"
      ],
      "market_segments": [
        "private_residential"
      ]
    },
    "content_length": 6736,
    "word_count": 951,
    "is_truncated": false,
    "original_length": 6736,
    "extraction_method": "web_scraping"
  },
  {
    "id": "mnd_pr_585b4a73098c7772",
    "source": "government_mnd",
    "text": "NewsroomPress ReleasesViewCloser Families, Stronger Ties: Enhanced Proximity Housing Grant to Help More Families Live Closer TogetherFeb 19, 2018Minister for Finance, Mr Heng Swee Keat, announced in the Budget Statement in Parliament today that the Government will enhance the Proximity Housing Grant (PHG) to encourage married couples, singles, and their parents to live closer together, in the same flat or nearby, for stronger family support.The PHG complements other measures to help Singaporeans buy an HDB flat to live with or near their parents or married child, such as the Married Child Priority Scheme, Multi-Generation Priority Scheme, Senior Priority Scheme and Three-Generation (3Gen) flats.Enhancements to the Proximity Housing GrantCurrently, Singaporean citizen families enjoy a PHG of $20,000 when they buy a resale flat to livewith or neartheir parents or married children. Eligible singles will also enjoy a PHG of $10,000 if they buy a resale flat to livewiththeir parents.From today, the PHG will be enhanced to benefit more Singaporean families.Increase in PHG for Extended Families to Live TogetherTo further encourage extended families to live together in the same flat for better care and support, families who buy a resale flat to livewiththeir parents or children will now enjoy a higher-tier PHG of $30,000, up from $20,000 previously. Those buying a resale flat to live5 neartheir parents or children will continue to receive a PHG of $20,000.Enhancement of PHG for SinglesSimilarly, singles aged 35 years and above who buy a resale flat to live6 withtheir parents will receive the higher-tier PHG of $15,000, up from $10,000 previously.To encourage singles who are buying their own homes to live7 neartheir parents for mutual care and support, they will now be able to enjoy a new PHG of $10,000.Simplified Proximity ConditionThe proximity condition for determining what is considered as “near” will be simplified. Previously, it was defined as within 2 km or the same town. HDB will revise this to just “within 4 km”. This revision will give home buyers more options when they buy a resale flat to live near their parents or children, including in nearby towns.The revised proximity condition of 4 km will also apply to the Married Child Priority Scheme (MCPS) and Senior Priority Scheme (SPS) for new flats with effect from HDB’s May 2018 Build-To-Order (BTO) and Sale of Balance Flats (SBF) exercise.ImplementationThe enhanced PHG for families and singles is summarised inTable 1.The enhanced PHG will apply to eligible resale flat applications received on or after 3.30 pm, 19 February 2018.11,000 Households have Benefitted from PHG since August 2015The PHG was introduced in August 2015 to help extended families live closer together for mutual care and support. All Singaporeans are eligible for the PHG once, regardless of a) whether they have enjoyed housing subsidies before; b) their household income; or c) ownership of private property, when they buy a resale flat to live with or near their parents or married child. Private property owners will need to dispose of their private properties within six months of the resale flat purchase. The grant recipients must live with/near each other for at least 5 years.The PHG has benefitted a wide spectrum of Singaporeans, who want to live with or near their parents or children, including a) young couples who wish to live with or near their parents; b) married couples who bought their first flat further away from their parents and now wish to move back closer to their parents; and c) parents who wish to right-size and move closer to their children.As at 31 Dec 2017, close to 11,000 households have benefitted from the PHG, or a total grant amount of about $211 million.EnquiriesFor enquiries, the public can call the HDB Sales/Resale Customer Service Line at 1800-866-3066 between 8.00am and 5.00pm from Mondays to Fridays.Issued By: MND & HDBNewsroomSpeechesPress ReleasesParliament Matters",
    "timestamp": "2025-09-21T16:43:55.191540",
    "url": "https://www.mnd.gov.sg/newsroom/press-releases/view/closer-families-stronger-ties-enhanced-proximity-housing-grant-to-help-more-families-live-closer-together",
    "language": "en",
    "metadata": {
      "title": "Closer Families, Stronger Ties: Enhanced Proximity Housing Grant to Help More Families Live Closer Together",
      "agency": "MND",
      "category": "housing_policy",
      "policy_type": "bto_policy",
      "source_type": "press_releases",
      "sentiment_impact": "immediate",
      "scraping_priority": "high",
      "content_length": 3985,
      "keywords": [
        "housing",
        "property",
        "bto",
        "hdb",
        "resale",
        "housing grant",
        "hip",
        "ease"
      ],
      "target_demographics": [
        "first_time_buyers",
        "seniors"
      ],
      "market_segments": [
        "public_housing",
        "private_residential",
        "resale_market",
        "rental_market"
      ]
    },
    "content_length": 3985,
    "word_count": 629,
    "is_truncated": false,
    "original_length": 3985,
    "extraction_method": "web_scraping"
  }
]