{"id": "bca_media_releases_20250921_173144_1216", "source": "government_bca", "text": "BCA Launches New Licensing Regime to Enhance Quality and Safety Standards for Building Works and Lift and Escalator Systems×!feedbackIndustry InfoBuildSG is a national movement that encapsulates the spirit of collaboration in the transformation of the built environment sector. It underscores the collaboration among the government, unions, trade associations and chambers, industry and institutes of higher learning, all working collectively to realise an advanced and integrated built environment sector with progressive and collaborative firms well-poised for both local and global business opportunities, and providing good jobs for Singaporeans.Accessibility & Universal DesignBuildSG MovementBuilt Environment Technology Alliance (BETA)BCA AwardsBuildSG Transformation FundBuilt Environment Industry Transformation Map (ITM)DigitalisationEnabling Innovation AdoptionFacilities Management (FM)Leadership InitiativesManpowerProductivityQualitySustainabilityRegulatory InfoFind out more about the regulations pertaining to Singapore’s built environment.Amusement RidesBuilding ControlBuilding Maintenance and Strata ManagementEssential Construction MaterialsLegislation on Environmental Sustainability for BuildingsLifts & EscalatorsOutdoor Advertisement LicensingSecurity of PaymentTemporary Buildings ApplicationEnforcement ActionsSmart InspectionProcurementFind out more about the procurement frameworks and conditions of contract for public sector construction-related works.Pre-tender StageTender StagePost-tender StagePublicFind out more about the different aspects of the built environment and how you can play a part in our mission to shape a safe, high quality, sustainable and friendly built environment for everyone.Private Property OwnershipLearn about the Built EnvironmentSafety Resourcese-ServicesAbout UsAbout BCABCA AcademyBoard and ManagementBCA Undergraduate ScholarshipCareersCorporate Social ResponsibilityEventsNews and PublicationsOur AccoladesPWD-BCA ClubBuildSG - E-MagazineBuildSG.gov.sge-MagazineBCA Launches New Licensing Regime to Enhance Quality and Safety Standards for Building Works and Lift and Escalator SystemsUseful LinksCircularsPublicationsSpeechesReplies To Forum LettersAnnual ReportPublications & ReportsHomeAbout UsNews and PublicationsMedia ReleasesWednesday, 3 September 2025Mr Chee Hong Tat, Minister for National Development announced at the International Built Environment Week (IBEW) Industry and Awards Dinner that the Building and Construction Authority (BCA) will implement a new licensing regime from 2027 for firms that provide certification services for lift and escalator systems, as well as site supervision services for large-scale structural works from 2028. This ensures that the industry leverages firm-level resources and expertise to meet evolving demands of increasingly complex projects and new technological developments to deliver safer and higher quality infrastructure for Singaporeans.2            Under the new licensing regime, modern lift and escalator systems designed and installed in accordance with SS550:2009 and SS626:2017[1]or later, and building projects valued above $75 million, will require the appointment of BCA-licensed firms to carry out such works. This move addresses the increasing complexity and sophistication of works undertaken in the built environment sector:Lift and escalator systems have evolved from largely mechanical equipment to complex electromechanical equipment requiring specialised expertise for proper certification.Large-scale building projects involve more specialist works such as complex facades, long-span composite structures and more sophisticated methods of construction requiring a broad range of competencies to supervise.3            The shift to a firm-based regime aligns with international practices and recognises that professional firms are better equipped with expertise and resources to uphold safety standards. Licensed firms will be able to implement proper governance and procedures to enable collaboration, coordination and retention of critical technical knowledge and skills. Firms will also be able to invest in advanced technologies and provide structured training and specialised resources to support professionals to carry out their duties. This will ensure higher safety and quality standards, more consistent and efficient professional services, as well as better talent development and knowledge retention in the built environment sector.4            While this is a shift from the current individual-based certification system, individual professionals can continue to provide services independently for projects outside these scopes.5            To be licensed by BCA, firms must first be accredited by the Singapore Accreditation Council (SAC). To support this transition, SAC had earlier launched the accreditation scheme for Lift and Escalator Certification Firms in April 2025. This provides greater assurance that lift and escalator inspections are being carried out by accredited firms that possess the technical competence, qualifications and management systems necessary to perform thorough safety assessments in line with internationally recognised standards. BCA is working with SAC on a similar scheme for Site Supervision Firms for supervision of building works, targeting readiness in 2026.6            To facilitate the transition, the mandatory accreditation and licensing of firms is targeted to be implemented in 2027 for firms involved in the certification of lifts and escalators, and 2028 for firms undertaking the supervision of structural works. Developers and building owners are encouraged to engage accredited firms ahead of the mandatory implementation of BCA’s firm-based regime. More information on the firm-based regime can be found atAnnex A.Driving Transformation by Encouraging Industry Adoption of CORENET X7            As a crucial part of ongoing transformation efforts for the built environment sector, the current regulatory approval for building works has been redesigned under CORENET X. This move transforms the separate and individual agency submissions to a customer-centric one, and brings together the various agencies to collaborate and jointly review the submission. CORENET X brings about time and cost savings, offers one-stop approvals and enables building with confidence and clarity.8            To further advance transformation in the sector, regulatory agencies have continued to refine strategies to support a smoother transition to CORENET X, following ongoing engagements with industry partners and practitioners. As part of these efforts, the eligibility window for the Additional Buyer’s Stamp Duty remission for projects submitted on CORENET X will be further extended for larger projects (≥ 30,000 m² GFA) until 30 September 2026, and for smaller projects (< 30,000 m² GFA) until 30 September 2027. This extension will allow developers additional time to adapt to the new processes and technologies.9            Regulatory agencies have also made several enhancements to CORENET X to address the industry’s feedback on navigating the multiple agencies’ processes, forms and requirements, including:Streamlining manual project information collection on applications,Providing visibility on agency clearance statuses through the implementation of project dashboards,Allowing concurrent submissions to both the Design Gateway and Piling GatewayAllowing concurrent demolition and new erection applications, andFor agencies to begin CORENET X submission processing immediately upon receipt of proof of payment, rather than waiting for payment verification to complete [to be implemented in 4Q2025].Please refer toAnnex Bfor more details.Project of the Year and Company of the Year Award winners Lauded for their Achievements in Pushing the Boundaries of Industry Transformation10          The BE sector has been undergoing continuous transformation, pushing boundaries for meaningful change and a more resilient future. Six Singapore BE projects have received the prestigious BCA “Project of the Year” (PoY) award for outstanding achievements in adopting innovative and productive construction methods, driving digitalisation, transforming the workforce and value chain, and advancing sustainability.11          Among the PoY winners is Mandai Rainforest Resort by Banyan Tree, which features off-form precast concrete wall panels. Salvaged tree barks and branches were repurposed into moulds, embedding natural textures directly into the façade. This eliminated the need for additional finishes while achieving a nature-inspired design. As a result, the speed of completing the building’s exterior doubled, saving a significant 3,740 man-hours. The project team also adopted a fully digital approach across design, construction and operations, including 6D digital assets for handover. This enabled automated data transfer from the building model to the Facilities Management system, potentially reducing man-hours needed to process operational data by 30 times, from 1,200 hours to just 40.12          Another PoY winner is the New Central Manpower Base (CMPB), supported by elliptical column fins which are 32-metre tall and 3-metre wide, constructed using a modular ‘Tatekata’ steel joint system. This eliminated the need for extensive temporary supports and sped up construction by 20% (equivalent to saving 544 man-hours). Apart from digitally rehearsing the façade installation to ensure safety and high-quality execution of actual works, the project team was among the first institutional projects to adopt BCA’s Virtual Temporary Occupation Permit (TOP) inspection with the use of 360-degree capture technology, resulting in 300 man-hours saved.13          Kimly Construction and Kajima Overseas Asia (Singapore) have each been accorded the “Company of the Year” (CoY) award for the Small/Mid Firms and Large Firms category respectively, for demonstrating commitment in business and workforce transformation at the enterprise level.14          Recognised as one of The Straits Times Singapore’s Best Employers 2025, Kimly Construction excels in building up their staff capabilities through an in-house competency framework. In addition, Kimly works to attract prospective young talent via internships and hosting site visits. On the innovation front, Kimly implemented several initiatives to improve productivity, such as introducing the sustainable CREE hybrid timber system in its Eunoia Junior College project to boost productivity, and digitalising its internal financial and procurement workflows. Thestreamlined workflow minimises administrative touchpoints across procurement, contracts, project management, and HR systems, leading to increased efficiency.15          The other winner of the CoY award, Kajima Overseas Asia (Singapore), has built a strong talent pipeline through frequent student engagement and organising a structured Graduate Development Programme. Committed to operational efficiency and innovation, it launched The GEAR smart living lab for ecosystem players to collaborate, co-create and refine technologies, while deploying its innovative Gyro Pile method to significantly shorten construction time on a project. More details on the winners can be found inAnnex C.[1]SS550:2009 is the code of practice for installation, operation and maintenance of electric passenger and goods lifts. SS626:2017 is the code of practice for design, installation and maintenance of escalators and moving walks.Download the PDF version of the Media ReleaseDownload Annex ADownload Annex BDownload Annex CPopular e-ServicesCWRSThe Construction Workforce Registration System (CWRS) is an online portal for CoreTrade and Multi-skilling registration and the renewal of Direct R1 eligibility.Overseas Testing Management SystemOTMS allows you to register the workers for Identity Verification and to check your registration status online.Lifts and Escalators Application (LEAP) PortalLift and escalator owners, contractors and Specialist Professional Engineers (SPEs) can apply for and view applications for Permit to Operate (PTO) here.The Building and Construction Authority (BCA) champions the development and transformation of the built environment sector, in order to improve Singapore’s living environment. BCA oversees areas such as safety, quality, inclusiveness, sustainability and productivity, all of which, together with our stakeholders and partners, help to achieve our mission to transform the Built Environment sector and shape a liveable and smart built environment for Singapore.Contact UsFeedbackFAQSReachReport VulnerabilityPrivacy StatementTerms of UseSitemap", "timestamp": "2025-09-21T17:31:44+08:00", "url": "http://www1.bca.gov.sg/about-us/news-and-publications/media-releases/2025/09/03/bca-launches-new-licensing-regime-to-enhance-quality-and-safety-standards-for-building-works-and-lift-and-escalator-systems", "language": "en", "metadata": {"agency": "BCA", "category": "media_releases", "content_length": 9395, "keywords": ["productivity", "sustainability", "safety standards", "industry transformation"], "title": "BCA Launches New Licensing Regime to Enhance Quality and Safety Standards for Building Works and Lift and Escalator Systems", "policy_type": "industry_announcement", "policy_subtype": "media_release", "key_materials": ["steel", "concrete", "cement", "timber", "labor"], "cost_drivers": ["demand"], "industry_impact": ["developers"]}}
{"id": "bca_media_releases_20250921_173159_2704", "source": "government_bca", "text": "Construction Demand To Remain Strong For 2025×!feedbackIndustry InfoBuildSG is a national movement that encapsulates the spirit of collaboration in the transformation of the built environment sector. It underscores the collaboration among the government, unions, trade associations and chambers, industry and institutes of higher learning, all working collectively to realise an advanced and integrated built environment sector with progressive and collaborative firms well-poised for both local and global business opportunities, and providing good jobs for Singaporeans.Accessibility & Universal DesignBuildSG MovementBuilt Environment Technology Alliance (BETA)BCA AwardsBuildSG Transformation FundBuilt Environment Industry Transformation Map (ITM)DigitalisationEnabling Innovation AdoptionFacilities Management (FM)Leadership InitiativesManpowerProductivityQualitySustainabilityRegulatory InfoFind out more about the regulations pertaining to Singapore’s built environment.Amusement RidesBuilding ControlBuilding Maintenance and Strata ManagementEssential Construction MaterialsLegislation on Environmental Sustainability for BuildingsLifts & EscalatorsOutdoor Advertisement LicensingSecurity of PaymentTemporary Buildings ApplicationEnforcement ActionsSmart InspectionProcurementFind out more about the procurement frameworks and conditions of contract for public sector construction-related works.Pre-tender StageTender StagePost-tender StagePublicFind out more about the different aspects of the built environment and how you can play a part in our mission to shape a safe, high quality, sustainable and friendly built environment for everyone.Private Property OwnershipLearn about the Built EnvironmentSafety Resourcese-ServicesAbout UsAbout BCABCA AcademyBoard and ManagementBCA Undergraduate ScholarshipCareersCorporate Social ResponsibilityEventsNews and PublicationsOur AccoladesPWD-BCA ClubBuildSG - E-MagazineBuildSG.gov.sge-MagazineConstruction Demand To Remain Strong For 2025Useful LinksCircularsPublicationsSpeechesReplies To Forum LettersAnnual ReportPublications & ReportsHomeAbout UsNews and PublicationsMedia ReleasesThursday, 23 January 2025- Outlook for construction demand in the medium-term expected to remain strong due to several large-scale development projects- Adjustments to the CORENET X implementation timeline to ensure smoother transition onto the platform- New NEC4 W and Z Clauses launched to support collaborative contractingThe Building and Construction Authority (BCA) projects the total construction demand, i.e. the value of construction contracts to be awarded, to range between S$47 billion and S$53 billion in nominal terms in 2025. Normalised to real values, 2025's demand is projected to range between $35 billion and $39 billion, which is between 0.3% to 11.7% higher than pre-COVID levels in 2019.2            The strong demand is underpinned by the expected award of contracts for several large-scale developments, such as Changi Airport Terminal 5 (T5) and the expansion of the Marina Bay Sands Integrated Resort, alongside public housing development and upgrading works. Other contributors include high-specification industrial buildings, educational developments, healthcare facilities, Mechanical and Engineering contracts for the Thomson-East Coast Line Extension (TEL) and Cross Island Line (CRL), and infrastructure works for the Woodlands Checkpoint extension and the Tuas Port.Preliminary Actual Construction Demand for 20243            The preliminary total construction demand for 2024 reached S$44.2 billion in nominal terms, exceeding BCA's mid-year revised forecast of between S$35 billion to S$41 billion. This was mainly attributed to the rolling out of more public institutional projects, as well as public and private housing projects.Forecast for 2026 to 20294            Over the medium-term, BCA expects the total construction demand to reach an average of between S$39 billion and S$46 billion per year from 2026 to 2029.5            The medium-term demand will continue to be supported by developments such as T5, a steady pipeline of public housing developments, MRT projects such as the Cross Island Line (Phase 3) and the Downtown Line Extension to Sungei Kadut, Integrated Waste Management Facility (Phase 2), Tengah General and Community Hospital, Siglap South Integrated Development, Woodlands North Coast industrial estate, redevelopment of various Junior Colleges, commercial building redevelopments, and other urban rejuvenation developments.6            While the medium-term construction demand is projected to be robust, the schedules and phasing of projects are subject to change, particularly due to potential unforeseen risks arising from an uncertain global economic climate. Furthermore, as the T5 development is likely to be a one-off exceptional project over the medium term, overall industry demand could eventually moderate after this period.Construction Output7            Based on the contracts awarded in the past few years and the construction demand forecast for 2025, total nominal construction output is projected to increase to between S$39 billion and S$42 billion in 2025, up from the preliminary estimate of about S$38.4 billion in 2024. The anticipated uptrend is expected to be supported by the increase in actual construction demand over the last few years and the expected increase in 2025 construction demand. Normalised to real values, total construction output in 2025 is projected to range between $30 billion and $32 billion, which is slightly higher than that in 2019.YearConstruction demand* (nominal, S$ billion)Construction Output^(nominal, S$ billion)2024p44.238.42025f47 – 5339 - 422026f – 2029f39 – 46 per year_p: Preliminary; f: Forecast*Construction demand: Value of contracts awarded^Construction output: Value of certified progress paymentsAdjustments to CORENET X Implementation Timeline8            Against the backdrop of robust demand projections, Singapore's Built Environment sector will continue its transformation efforts to achieve better outcomes through better coordination and increased productivity. A key component in this transformation effort is CORENET X, a one-stop digital platform for integrated regulatory submissions for building works.9            Over the past year, the regulatory government agencies have been working closely with industry partners and practitioners on CORENET X. Feedback from industry has been useful in refining the processes and the platform. Many firms have invested resources and successfully submitted their projects via CORENET X during the voluntary submission phase. The hands-on experience gained from going through the new regulatory processes in actual projects were invaluable in strengthening collaboration amongst project teams and fostering better understanding of the new CORENET X requirements. Insights gleaned from these projects also helped project parties to review their internal processes to be able to leverage CORENET X for more streamlined workflows across the value-chain.10          We recognise that CORENET X entails significant changes to existing workflows, and that some firms need more time to adjust internal processes and familiarise themselves with the new requirements. In addition, smaller consultancy firms may not have had sufficient projects to try out the new processes during the voluntary submissions phase. Hence, the implementation timeline will be adjusted as follows. More details can be found in the industry circular athttps://go.gov.sg/cxcirculars.DateImplementation1 October 2025Mandatory CORENET X submission forall new projects with Gross Floor Area (GFA) ≥ 30,000m21 October 2026Mandatory CORENET X submission forall new projects, regardless of GFA1 October 2027Mandatory onboarding to CORENET Xfor all ongoing projects11          For smaller-sized new projects with GFA below 30,000m2, we encourage project teams to take the opportunity to make submissions through CORENET X ahead of the mandatory timelines to familiarise themselves with the new process and submission portal (refer to Annex A for more information on CORENET X).Launch of new NEC4 W and Z Clauses to Support Collaborative Contracting12          Aside from CORENET X, the Built Environment sector is also fostering closer collaboration via collaborative contracting. Collaborative contracting is a mechanism that facilitates deeper collaborations amongst developers, consultants and builders. Collaborative contracting provides a framework that allocates risks and gains more equitably. It aligns the incentives of parties, builds trust, and encourages everyone to work towards better project outcomes.13          In 2024, BCA, together with NEC[1], launched an additional set of contract clauses (“Y clauses”) to adapt the NEC4 contract form[2]with Singapore’s laws. To further support the adoption of NEC4 contracts in Singapore, BCA has further developed additional clauses (“W and Z clauses”) that incorporate local dispute resolution protocols, current Government procurement rules, and established local industry practices (refer to Annex B for more information on NEC4).ClauseDetailsW clausesDispute resolution options incorporating local dispute resolution protocols and practices, such as the Singapore Infrastructure Dispute-Management Protocol 2018 (SIDP) and appointment of Senior Representatives for dispute resolution.Z clausesAdditional conditions of contract for project-specific requirements that take into consideration public sector procurement requirements and local practices. This includes the use of eGuarantee template, Progressive Wage Mark requirements and suitable project response timelines.15          Firms may download these clauses alongside other resources from BCA’s website to kickstart your collaborative contracting journey. In addition, BCA Academy, industry associations (e.g. the Society of Construction Law), and Institutes of Higher Learning (e.g. Singapore University of Social Sciences), and other training providers have introduced programmes to build up the relevant skills and competencies in collaborative contracting among firms.Download the PDF version of the Media Release hereDownload the Annexes here[1]NEC is a division under Thomas Telford Ltd, the commercial arm of the Institution of Civil Engineers (ICE), the owner and developer of NEC suite of contracts.[2]The NEC4 contract is the latest edition of a suite of collaborative contracts for construction and facilities management projects.Popular e-ServicesCWRSThe Construction Workforce Registration System (CWRS) is an online portal for CoreTrade and Multi-skilling registration and the renewal of Direct R1 eligibility.Overseas Testing Management SystemOTMS allows you to register the workers for Identity Verification and to check your registration status online.Lifts and Escalators Application (LEAP) PortalLift and escalator owners, contractors and Specialist Professional Engineers (SPEs) can apply for and view applications for Permit to Operate (PTO) here.The Building and Construction Authority (BCA) champions the development and transformation of the built environment sector, in order to improve Singapore’s living environment. BCA oversees areas such as safety, quality, inclusiveness, sustainability and productivity, all of which, together with our stakeholders and partners, help to achieve our mission to transform the Built Environment sector and shape a liveable and smart built environment for Singapore.Contact UsFeedbackFAQSReachReport VulnerabilityPrivacy StatementTerms of UseSitemap", "timestamp": "2025-09-21T17:31:59+08:00", "url": "http://www1.bca.gov.sg/about-us/news-and-publications/media-releases/2025/01/23/construction-demand-to-remain-strong-for-2025", "language": "en", "metadata": {"agency": "BCA", "category": "media_releases", "content_length": 8492, "keywords": ["productivity", "construction demand"], "title": "Construction Demand To Remain Strong For 2025", "policy_type": "industry_announcement", "policy_subtype": "media_release", "key_materials": ["sand", "labor"], "cost_drivers": ["demand"], "industry_impact": ["developers"]}}
{"id": "bca_media_releases_20250921_173211_1268", "source": "government_bca", "text": "Media Statement on Sinkhole Incident at Tanjong Katong Road – Mountbatten Road Junction×!feedbackIndustry InfoBuildSG is a national movement that encapsulates the spirit of collaboration in the transformation of the built environment sector. It underscores the collaboration among the government, unions, trade associations and chambers, industry and institutes of higher learning, all working collectively to realise an advanced and integrated built environment sector with progressive and collaborative firms well-poised for both local and global business opportunities, and providing good jobs for Singaporeans.Accessibility & Universal DesignBuildSG MovementBuilt Environment Technology Alliance (BETA)BCA AwardsBuildSG Transformation FundBuilt Environment Industry Transformation Map (ITM)DigitalisationEnabling Innovation AdoptionFacilities Management (FM)Leadership InitiativesManpowerProductivityQualitySustainabilityRegulatory InfoFind out more about the regulations pertaining to Singapore’s built environment.Amusement RidesBuilding ControlBuilding Maintenance and Strata ManagementEssential Construction MaterialsLegislation on Environmental Sustainability for BuildingsLifts & EscalatorsOutdoor Advertisement LicensingSecurity of PaymentTemporary Buildings ApplicationEnforcement ActionsSmart InspectionProcurementFind out more about the procurement frameworks and conditions of contract for public sector construction-related works.Pre-tender StageTender StagePost-tender StagePublicFind out more about the different aspects of the built environment and how you can play a part in our mission to shape a safe, high quality, sustainable and friendly built environment for everyone.Private Property OwnershipLearn about the Built EnvironmentSafety Resourcese-ServicesAbout UsAbout BCABCA AcademyBoard and ManagementBCA Undergraduate ScholarshipCareersCorporate Social ResponsibilityEventsNews and PublicationsOur AccoladesPWD-BCA ClubBuildSG - E-MagazineBuildSG.gov.sge-MagazineMedia Statement on Sinkhole Incident at Tanjong Katong Road – Mountbatten Road JunctionUseful LinksCircularsPublicationsSpeechesReplies To Forum LettersAnnual ReportPublications & ReportsHomeAbout UsNews and PublicationsMedia ReleasesSaturday, 26 July 2025BCA was alerted to a sinkhole incident which occurred today at the junction of Tanjong Katong Road and Mountbatten Road, adjacent to an existing PUB worksite.BCA engineers have carried out preliminary checks on the nearby One Amber condominium and the landed houses across the road. The assessments confirmed that the buildings are not affected by the incident.As a precautionary measure and to ensure the safety of surrounding buildings and the worksite, stabilisation works have commenced. BCA, LTA and PUB are closely monitoring the ongoing repair works and overall safety of the area.Download the PDF version of the Media Statement herePopular e-ServicesCWRSThe Construction Workforce Registration System (CWRS) is an online portal for CoreTrade and Multi-skilling registration and the renewal of Direct R1 eligibility.Overseas Testing Management SystemOTMS allows you to register the workers for Identity Verification and to check your registration status online.Lifts and Escalators Application (LEAP) PortalLift and escalator owners, contractors and Specialist Professional Engineers (SPEs) can apply for and view applications for Permit to Operate (PTO) here.The Building and Construction Authority (BCA) champions the development and transformation of the built environment sector, in order to improve Singapore’s living environment. BCA oversees areas such as safety, quality, inclusiveness, sustainability and productivity, all of which, together with our stakeholders and partners, help to achieve our mission to transform the Built Environment sector and shape a liveable and smart built environment for Singapore.Contact UsFeedbackFAQSReachReport VulnerabilityPrivacy StatementTerms of UseSitemap", "timestamp": "2025-09-21T17:32:11+08:00", "url": "http://www1.bca.gov.sg/about-us/news-and-publications/media-releases/2025/07/26/media-statement-on-sinkhole-incident-at-tanjong-katong-road---mountbatten-road-junction", "language": "en", "metadata": {"agency": "BCA", "category": "media_releases", "content_length": 691, "keywords": [], "title": "Media Statement on Sinkhole Incident at Tanjong Katong Road – Mountbatten Road Junction", "policy_type": "industry_announcement", "policy_subtype": "media_release"}}
{"id": "bca_media_releases_20250921_173223_5397", "source": "government_bca", "text": "Taskforce for Architectural and Engineering Consultants puts forth 11 recommendations to uplift the Built Environment Consultancy sector×!feedbackIndustry InfoBuildSG is a national movement that encapsulates the spirit of collaboration in the transformation of the built environment sector. It underscores the collaboration among the government, unions, trade associations and chambers, industry and institutes of higher learning, all working collectively to realise an advanced and integrated built environment sector with progressive and collaborative firms well-poised for both local and global business opportunities, and providing good jobs for Singaporeans.Accessibility & Universal DesignBuildSG MovementBuilt Environment Technology Alliance (BETA)BCA AwardsBuildSG Transformation FundBuilt Environment Industry Transformation Map (ITM)DigitalisationEnabling Innovation AdoptionFacilities Management (FM)Leadership InitiativesManpowerProductivityQualitySustainabilityRegulatory InfoFind out more about the regulations pertaining to Singapore’s built environment.Amusement RidesBuilding ControlBuilding Maintenance and Strata ManagementEssential Construction MaterialsLegislation on Environmental Sustainability for BuildingsLifts & EscalatorsOutdoor Advertisement LicensingSecurity of PaymentTemporary Buildings ApplicationEnforcement ActionsSmart InspectionProcurementFind out more about the procurement frameworks and conditions of contract for public sector construction-related works.Pre-tender StageTender StagePost-tender StagePublicFind out more about the different aspects of the built environment and how you can play a part in our mission to shape a safe, high quality, sustainable and friendly built environment for everyone.Private Property OwnershipLearn about the Built EnvironmentSafety Resourcese-ServicesAbout UsAbout BCABCA AcademyBoard and ManagementBCA Undergraduate ScholarshipCareersCorporate Social ResponsibilityEventsNews and PublicationsOur AccoladesPWD-BCA ClubBuildSG - E-MagazineBuildSG.gov.sge-MagazineTaskforce for Architectural and Engineering Consultants puts forth 11 recommendations to uplift the Built Environment Consultancy sectorUseful LinksCircularsPublicationsSpeechesReplies To Forum LettersAnnual ReportPublications & ReportsHomeAbout UsNews and PublicationsMedia ReleasesFriday, 5 September 2025Following extensive consultation with over 400 stakeholders, the Taskforce for Architectural and Engineering Consultants, established in September 2024, has put forth 11 recommendations to strengthen the talent pipeline and business sustainability of the Built Environment (BE) consultancy sector.Amongst its key recommendations are an enhanced internship programme to improve BE graduates’ industry readiness and starting salaries, and improving procurement practices to quality-focused procurement over unhealthy price competition.Singapore, 5 September 2025- The Taskforce for Architectural and Engineering Consultants (“Taskforce”) haspublished a reportoutlining ways in which various stakeholders, from Built Environment (BE) consultants to service buyers, can collectively strengthen the talent pipeline and business sustainability of the BE consultancy sector.2            The BE consultancy sector plays a critical role in shaping and designing Singapore’s built environment to be safe, sustainable and inclusive and in ensuring that our urban design remains world-class standard.  It is with these outcomes in mind, the recommendations as shared by the Taskforce will help ensure that the BE consultancy sector remains attractive, future-ready and competitive to support our aspirations for national development.3            Ms Indranee Rajah, Second Minister for National Development and Co-Chair of the Taskforce, announced the Taskforce’s report at the inaugural Building Singapore Festival at VivoCity on 5 September 2025 (Annex A). The Festival, organised by the Building and Construction Authority, celebrates the contributions of the BE sector towards Singapore’s development and seeks to inspire the next generation to consider a career in the sector.4            The recommendations cover five focus areas, namely (1) making BE careers the careers of choice, (2) fostering sustainable and profitable businesses, (3) growing a dynamic and progressive BE consultancy sector, (4) building a culture of appreciation, respect and empathy, and (5) uplifting capabilities of our Trade Associations and Chambers (TACs).5            “The BE sector is essential in ensuring Singapore’s continuous progress. There are long-term infrastructure and building projects in the works that will shape the lives of everyday Singaporeans, which are only made possible through BE professionals’ contributions. These recommendations will create a thriving sector and ensure a strong pipeline of capable consultant firms and talented BE professionals to deliver on these infrastructure plans,” said Ms Indranee.6            Established in September 2024, the Taskforce developed the report in collaboration with over 400 stakeholders through over 40 engagements and focus group discussions. Participants ranged from students and young professionals to senior leaders from BE firms, Institutes of Higher Learning (IHLs), and TACs.7            “We thank everyone who contributed towards the recommendations in this report. We look forward to the commitment of all stakeholders to come together and implement these recommendations. It is only through our collective efforts that we can foster a vibrant and sustainable sector for our future generations,” said Mr Chaly Mah, Chairman of Surbana Jurong Group, Co-Chair of the Taskforce.Key recommendations1. An enhanced internship programme to groom industry-ready talents that can command higher starting salaries8            To ensure that the BE sector can deliver on Singapore’s development plans, it is critical to ensure that the sector continues to offer attractive and rewarding careers for talent.9            The Taskforce recommends IHLs and progressive firms to jointly enhance their internship programmes to nurture industry-ready talent that can make greater impact in the sector upon graduation. Known as the “INSPIRE” internship programme (Annex B), the programme will feature a longer duration, dedicated mentors and clear learning outcomes to ensure that participants pick up critical technical and soft skills on the job.10          With improved industry readiness, participants will be able to better contribute to their firms after graduation. In turn, participating firms will recognise the internship period as relevant work experience and offer competitive starting salaries to these returning interns above prevailing market rates[1]for the BE course cluster. The enhanced internship is not expected to delay students’ graduation timelines.11          IHLs offering BE courses, such as the Nanyang Technological University, National University of Singapore, Singapore Institute of Technology, and Singapore University of Technology and Design, will participate in this programme. The Taskforce has also received strong interest from more than 20 leading progressive firms, such as Arup, Beca, DP Architects, and Surbana Jurong, to participate in the programme.12          The strong support from the IHLs and leading firms underscores the sector’s collective commitment to attract and groom good talents to join its ranks. Students who are interested to find out more about the enhanced internship may do so through the BuildSG micrositewebpage.13          The internship will complement other Taskforce’s recommendations, such as early exposure for our youths to careers in the BE industry, improving the industry-relevance of IHL curricula, and enhancing HR and career development support for in-service professionals, to strengthen talent pipeline for the BE sector, to make BE careers the career of choice.2. Enhance procurement practices to enable sustainable and profitable businesses14          The Taskforce also recommends public and private sector service buyers to enhance procurement practices (Annex C) to continue emphasising quality-based procurement and further disincentivise unsustainable low bids. This would ensure that BE consultancy firms have the resources to invest in human capital, offer more competitive remuneration, drive innovation, and deliver quality services. This will support the long-term growth of the sector and ensure that Singapore’s infrastructure remain world-class.15          For example, the Taskforce noted that the Government is looking at updating its procurement evaluation criteria to further disadvantage bids that are too low and disincentivise fee-diving. This is done by increasing the coverage of the “Reduced Fee Score” pilot to more projects. Previously, it only covered public sector projects up to $50 million. The Government is looking to expand this to public sector projects up to $100 million. This would create a more sustainable bidding environment which favours quality bids to encourage firms to focus on delivering value. The change will take effect by end of this year. Private sector service buyers are encouraged to adopt similar quality-based procurement methods where applicable.16          The Taskforce also recommends for public and private sector service buyers to continue enhancing contractual clauses to enable a more equitable distribution of risks between service buyers and consultants. Contractual clauses currently being reviewed include:Making the Limitation of Liability (LoL) clause a default provision in the Standard Consultancy Agreement. The clause allows professional liabilities to be more insurable and more commensurate with the consultancy fees, and scale and complexity of the consultancy projects. This allows more effective risk-sharing and improves the business sustainability of the professions.Similarly, both public and private sector service buyers are also reviewing the Fit for Purpose (FfP) clauses in Design & Build (D&B) contracts to ensure that risks are more insurable and commensurate with the nature of the project. This will bring us in line with international best practices and improve overall business sustainability for our BE consultancy firms.3. Built Environment Culture of Appreciation, Respect and Empathy (BE CARE) Charter17          The BE sector has made encouraging progress in fostering positive work environments and improving staff well-being, to allow BE professionals to flourish in the workplace.18          To further boost workplace well-being, the Taskforce has developed a new Built Environment Culture of Appreciation, Respect and Empathy Charter (BE CARE Charter; Annex D), which outlines best practices that project teams and firms can adopt to promote a collaborative culture and prioritise staff well-being.19          The Charter has garnered strong support from the industry, and following the report’s launch, public sector service buyers, such as the Ministry of Education (MOE) and PUB, and private sector service buyers such as Allgreen Properties and GuocoLand will pilot the Charter in several upcoming projects. Altogether, more than 30 firms, comprising service buyers and consultants, have committed to the implementation of the Charter across project and/or firm levels.20          The industry can access the Charter onBCA’s websiteto adopt and adapt, where necessary, for their firm or projects. They can also pledge their commitment to the Charter through BCA’s website, and they may be featured across BCA's platforms. They can also feature this on their own communication channels to highlight their focus on building a positive workplace environment and employee wellbeing.Support TACs to uplift the respective professions21          The Taskforce recognises the critical roles that the BE TACs play in the overall growth and sustainability of the BE sector and its professions, and their potential to mount greater impact.22          Therefore, the Taskforce recommends supporting the TACs to strengthen their in-house capabilities in critical areas such as:Talent outreach and branding efforts – TACs could work with firms to mount joint outreach and branding efforts to uplift the standing of BE professions.Technology and transformation – TACs could support and help member firms embrace emerging innovation and technology, such as leveraging Artificial Intelligence, to streamline business operations and work processes.Human resource (HR) – TACs could support member firms in uplifting their HR practices, to provide better working conditions and opportunities for prospective talents and in-service professionals in the sector.23          Although TACs may face resource constraints, they may consider pooling resources and leverage economies of scale, such as through bulk tenders and the development of shared service offerings, to amplify their impact.About BCAThe Building and Construction Authority (BCA) champions a safe, sustainable, and liveable built environment for Singapore. As a leader in the sector, BCA is dedicated to driving industry transformation and setting rigorous standards in building safety, quality, and environmental sustainability. By advancing innovation, digitalisation, and the development of a skilled workforce, BCA fosters a dynamic industry that is ready to meet the evolving needs of the nation and build a resilient and progressive built environment for all. For more information, visitwww.bca.gov.sgAbout the Taskforce for Architectural and Engineering ConsultantsThe Taskforce was established in September 2024 to further strengthen the talent pipeline and business sustainability of the BE professions.It was co-chaired by Ms. Indranee Rajah, Minister in the Prime Minister’s Office, and Second Minister for Finance and National Development, and Mr. Chaly Mah, Chairman of Surbana Jurong Group. The Taskforce comprised representatives from key TACs, consultancy firms, major service buyers, Institutes of Higher Learning (IHLs), public agencies and young professionals.[1]Taking reference from the gross monthly median salary for fresh graduates in the BE course cluster, as indicated in the prevailing year's Graduate Employment Survey (GES). Link to GES: moe.gov.sg/-/media/files/post-secondary/ges-2024/joint-web-publication-ges-2024-5-aus.pdf.Download the PDF version of the Media release here.Link to Factsheet here.Popular e-ServicesCWRSThe Construction Workforce Registration System (CWRS) is an online portal for CoreTrade and Multi-skilling registration and the renewal of Direct R1 eligibility.Overseas Testing Management SystemOTMS allows you to register the workers for Identity Verification and to check your registration status online.Lifts and Escalators Application (LEAP) PortalLift and escalator owners, contractors and Specialist Professional Engineers (SPEs) can apply for and view applications for Permit to Operate (PTO) here.The Building and Construction Authority (BCA) champions the development and transformation of the built environment sector, in order to improve Singapore’s living environment. BCA oversees areas such as safety, quality, inclusiveness, sustainability and productivity, all of which, together with our stakeholders and partners, help to achieve our mission to transform the Built Environment sector and shape a liveable and smart built environment for Singapore.Contact UsFeedbackFAQSReachReport VulnerabilityPrivacy StatementTerms of UseSitemap", "timestamp": "2025-09-21T17:32:23+08:00", "url": "http://www1.bca.gov.sg/about-us/news-and-publications/media-releases/2025/09/05/taskforce-for-architectural-and-engineering-consultants-puts-forth-11-recommendations-to-uplift-the-built-environment-consultancy-sector", "language": "en", "metadata": {"agency": "BCA", "category": "media_releases", "content_length": 12167, "keywords": ["sustainability", "industry transformation"], "title": "Taskforce for Architectural and Engineering Consultants puts forth 11 recommendations to uplift the Built Environment Consultancy sector", "policy_type": "industry_announcement", "policy_subtype": "media_release", "key_materials": ["labor"], "industry_impact": ["buyers"]}}
{"id": "bca_media_releases_20250921_173308_1752", "source": "government_bca", "text": "Revised Code To Enhance Singapore’s Built Environment for an Inclusive Nation×!feedbackIndustry InfoBuildSG is a national movement that encapsulates the spirit of collaboration in the transformation of the built environment sector. It underscores the collaboration among the government, unions, trade associations and chambers, industry and institutes of higher learning, all working collectively to realise an advanced and integrated built environment sector with progressive and collaborative firms well-poised for both local and global business opportunities, and providing good jobs for Singaporeans.Accessibility & Universal DesignBuildSG MovementBuilt Environment Technology Alliance (BETA)BCA AwardsBuildSG Transformation FundBuilt Environment Industry Transformation Map (ITM)DigitalisationEnabling Innovation AdoptionFacilities Management (FM)Leadership InitiativesManpowerProductivityQualitySustainabilityRegulatory InfoFind out more about the regulations pertaining to Singapore’s built environment.Amusement RidesBuilding ControlBuilding Maintenance and Strata ManagementEssential Construction MaterialsLegislation on Environmental Sustainability for BuildingsLifts & EscalatorsOutdoor Advertisement LicensingSecurity of PaymentTemporary Buildings ApplicationEnforcement ActionsSmart InspectionProcurementFind out more about the procurement frameworks and conditions of contract for public sector construction-related works.Pre-tender StageTender StagePost-tender StagePublicFind out more about the different aspects of the built environment and how you can play a part in our mission to shape a safe, high quality, sustainable and friendly built environment for everyone.Private Property OwnershipLearn about the Built EnvironmentSafety Resourcese-ServicesAbout UsAbout BCABCA AcademyBoard and ManagementBCA Undergraduate ScholarshipCareersCorporate Social ResponsibilityEventsNews and PublicationsOur AccoladesPWD-BCA ClubBuildSG - E-MagazineBuildSG.gov.sge-MagazineRevised Code To Enhance Singapore’s Built Environment for an Inclusive NationUseful LinksCircularsPublicationsSpeechesReplies To Forum LettersAnnual ReportPublications & ReportsHomeAbout UsNews and PublicationsMedia ReleasesMonday, 7 April 2025‐ Accessible connections to key entrances and enhanced lift provisions among new requirements‐ Industry practitioners to benefit from streamlined Code featuring clearer, enhanced guidelines‐ Enhanced accessibility requirements to take effect from 1 November 2025‐ New buildings and existing buildings undergoing addition and alteration works must comply from 1 November 2025The Building and Construction Authority (BCA) announced updates to the Code on Accessibility in the Built Environment (“Code”), a significant step towards creating a more inclusive Singapore. The enhanced requirements will apply to all new buildings as well as existing buildings undergoing addition and alteration works from 1 November 2025.2           A Code Review Committee comprising representatives from social services agencies, industry stakeholders, academic institutions, government agencies and interest groups was formed in September 2023 to review the earlier version of the Code, which in turn led to the development of the Code on Accessibility in the Built Environment 2025 (“Code 2025”). In the review, the Code Review Committee looked to address current gaps, and to anticipate future needs of persons with disabilities, the ageing population, and families with young children.3           Minister in the Prime Minister’s Office and Second Minister for Finance and National Development, Ms Indranee Rajah, said, \"The update of the Code goes beyond just enhancing our infrastructure - it is about creating a society that enables every individual to participate fully, and move around safely and independently. With improved design standards, our buildings and public spaces will become more accessible not only for persons with disabilities, but also for our seniors and families with young children. A truly inclusive Singapore is not just about building better spaces – it is about building better lives for all Singaporeans.\"4           The updated requirements mark the sixth revision since the Code's introduction in 1990, reflecting the evolving needs of Singapore’s population. The Code 2025 introduces significant improvements for these user groups:A. WHEELCHAIR USERSi) Improving barrier-free interconnectivityAll key building entrances linking to neighbouring buildings, commuter facilities, park connectors, and covered walkways to be wheelchair-accessiblePriority for shelter to be built for accessible routesii) Enhanced provisions for accessible lifts in buildingsLarger lift cars to accommodate personal mobility aidsEnhanced requirements for lift control buttons and mirror surfacesB. ELDERLYIncreased provision of toilet cubicles with grab barsMandatory resting areas at drop-off areasSafer ramp designs with colour bands replacing tactile indicators to minimise trippingC. FAMILIES WITH YOUNG CHILDRENIncreased provision of lactation rooms in large public buildings and workplacesLactation room requirement for educational institutionsStandardised specifications for lactation rooms, with minimum size requirements and essential fittings such as electrical sockets for breast pumpsD. PERSONS WITH VISUAL IMPAIRMENTStandardised tactile ground surface indicators at stairs to aid navigationE. PERSONS WHO ARE HARD-OF-HEARINGEnhanced signage for hearing enhancement system (HES). A HES that operates with telecoil must incorporate the “T” with the symbol of access to inform persons who are hard-of-hearing to activate their telecoil function.5           Ms Judy Wee, Executive Director of the Muscular Dystrophy Association (Singapore), who has served on several Code Review Committees, expressed optimism about the changes. “Through each review of the Code, we have seen tangible improvements in the built environment that enhance the daily lives of persons with disabilities, whether at work or leisure.\"6            The Code was also streamlined and reorganised in a more reader-friendly manner for built environment industry stakeholders. The updated Code includes anthropometric1information of wheelchair users and other persons with disabilities. This provides clearer visualisation of the physical and spatial requirements for different users, enabling architects and designers to make more informed decisions when planning accessible spaces.7           Mr Jeffrey Wong, a member of the Real Estate Developers’ Association of Singapore (REDAS) shared, “REDAS appreciates the opportunity to be part of the Code Review Committee alongside the various stakeholders representing different interest groups. Through the numerous engagements, we have been able to better understand and contribute ideas to improve the provisions within the Code. In addressing constraints faced by building owners and developers, we are glad that the enhanced Code has a renewed focus on catering to users of all ages and abilities. REDAS is heartened by the progress made on this front and we will continue to play our part in shaping a more inclusive built environment in Singapore.”8           The new Code 2025 will take effect from 1 November 2025, which provides a grace period of more than six months for industry professionals to incorporate the updated requirements. The provisions will apply to plans submitted to BCA for regulatory approval from 1 November 2025. The Code 2025 is available on BCA’s website athttps://go.gov.sg/bca-coa20259            Owners of existing buildings who are keen to voluntarily upgrade their buildings with accessible facilities may consider tapping on BCA’s Accessibility Fund (AF). The AF provides co-funding for a wide range of user-friendly features such as the installation of lactation rooms / pods and wheelchair-accessible lifts. More information on the AF and other BCA initiatives to promote an accessible and inclusive built environment can be found in Annex A.Download the PDF version of the Media Release hereDownload the Annex here1Anthropometric data provides measurements of human body dimensions and capabilities that aid designers in creating accessible spaces and facilities.Popular e-ServicesCWRSThe Construction Workforce Registration System (CWRS) is an online portal for CoreTrade and Multi-skilling registration and the renewal of Direct R1 eligibility.Overseas Testing Management SystemOTMS allows you to register the workers for Identity Verification and to check your registration status online.Lifts and Escalators Application (LEAP) PortalLift and escalator owners, contractors and Specialist Professional Engineers (SPEs) can apply for and view applications for Permit to Operate (PTO) here.The Building and Construction Authority (BCA) champions the development and transformation of the built environment sector, in order to improve Singapore’s living environment. BCA oversees areas such as safety, quality, inclusiveness, sustainability and productivity, all of which, together with our stakeholders and partners, help to achieve our mission to transform the Built Environment sector and shape a liveable and smart built environment for Singapore.Contact UsFeedbackFAQSReachReport VulnerabilityPrivacy StatementTerms of UseSitemap", "timestamp": "2025-09-21T17:33:08+08:00", "url": "http://www1.bca.gov.sg/about-us/news-and-publications/media-releases/2025/04/07/revised-code-to-enhance-singapore-s-built-environment-for-an-inclusive-nation", "language": "en", "metadata": {"agency": "BCA", "category": "media_releases", "content_length": 6147, "keywords": [], "title": "Revised Code To Enhance Singapore’s Built Environment for an Inclusive Nation", "policy_type": "industry_announcement", "policy_subtype": "media_release", "key_materials": ["cement"], "industry_impact": ["developers"]}}
{"id": "bca_media_releases_20250921_173321_1930", "source": "government_bca", "text": "Twenty Years of Greening Buildings In Singapore Results In Annual Energy Savings That Can Power One Million 4-Room HDB Flats Per Year×!feedbackIndustry InfoBuildSG is a national movement that encapsulates the spirit of collaboration in the transformation of the built environment sector. It underscores the collaboration among the government, unions, trade associations and chambers, industry and institutes of higher learning, all working collectively to realise an advanced and integrated built environment sector with progressive and collaborative firms well-poised for both local and global business opportunities, and providing good jobs for Singaporeans.Accessibility & Universal DesignBuildSG MovementBuilt Environment Technology Alliance (BETA)BCA AwardsBuildSG Transformation FundBuilt Environment Industry Transformation Map (ITM)DigitalisationEnabling Innovation AdoptionFacilities Management (FM)Leadership InitiativesManpowerProductivityQualitySustainabilityRegulatory InfoFind out more about the regulations pertaining to Singapore’s built environment.Amusement RidesBuilding ControlBuilding Maintenance and Strata ManagementEssential Construction MaterialsLegislation on Environmental Sustainability for BuildingsLifts & EscalatorsOutdoor Advertisement LicensingSecurity of PaymentTemporary Buildings ApplicationEnforcement ActionsSmart InspectionProcurementFind out more about the procurement frameworks and conditions of contract for public sector construction-related works.Pre-tender StageTender StagePost-tender StagePublicFind out more about the different aspects of the built environment and how you can play a part in our mission to shape a safe, high quality, sustainable and friendly built environment for everyone.Private Property OwnershipLearn about the Built EnvironmentSafety Resourcese-ServicesAbout UsAbout BCABCA AcademyBoard and ManagementBCA Undergraduate ScholarshipCareersCorporate Social ResponsibilityEventsNews and PublicationsOur AccoladesPWD-BCA ClubBuildSG - E-MagazineBuildSG.gov.sge-MagazineTwenty Years of Greening Buildings In Singapore Results In Annual Energy Savings That Can Power One Million 4-Room HDB Flats Per YearUseful LinksCircularsPublicationsSpeechesReplies To Forum LettersAnnual ReportPublications & ReportsHomeAbout UsNews and PublicationsMedia ReleasesFriday, 11 July 2025-Building and Construction Authority (BCA) and Singapore Green Building Council (SGBC) celebrate two decades of Singapore’s Green Building journey with significant achievements.-Public consultation will take place for the Built Environment Decarbonisation Technology Roadmap to chart the path forward for meeting sustainability goals for the built environment.-A new technical reference for hybrid cooling is launched to accelerate the deployment of hybrid cooling systems in buildings.-World Green Building Council (WorldGBC) and OCBC publish Insights Report to align Asia Pacific Green Building Rating Tools to the ASEAN Taxonomy for Sustainable Finance.Singapore, 11 July 2025– Singapore marked a significant milestone in its green building journey at the Singapore Green Building Council (SGBC)’s Gala Dinner, with Minister for National Development, Mr Chee Hong Tat, lauding the achievements of the BCA Green Mark certification scheme, as it celebrates its 20thanniversary.Two Decades of Green Building Excellence2            The BCA Green Mark certification scheme was launched 20 years ago by BCA with just 17 certified buildings in 2005; Singapore now boasts 2,590 Green Mark-certified buildings as of March 2025. These green buildings collectively save over 4.2 billion kWh energy annually – equivalent to powering 1 million 4-room HDB flats and S$1.3 billion in cost savings per year. The carbon emissions offset by these buildings are equivalent to replanting a forest more than 13 times the size of Singapore (refer to Annex A for achievements on greening the built environment).3           Singapore's green building expertise has also gained international recognition. Local sustainability consultants such as G-Energy Global and GreenA Consultants have successfully globalised their expertise, with notable achievements including Wisma BCA Foresta, HQ of PT Bank Central Asia Tbk, Indonesia's first Green Mark Super Low Energy (SLE) certified building, and Sobha One in Dubai, a new premium luxury condominium estate that is the Middle East's first Green Mark Platinum SLE development.4            To commemorate the 20thanniversary of the BCA Green Mark certification scheme, BCA and SGBC are recognising the significant support and contributions of 20 firms and building projects to Singapore’s green building journey (Refer to Annex B for more details).Economic and Social Benefits of Green Buildings5        The business case for BCA Green Mark certification has been proven in Singapore. New commercial buildings with the highest Green Mark Super Low Energy certification can recover their sustainability investments in about 5 to 6 years[1], while achieving average energy savings of 59%. Recent market analysis by Cushman and Wakefield[2]also showed that Green Mark-certified buildings in the CBD commanded premium rents up to 12% higher than non-Green Mark-certified properties, with consistently higher occupancy rates.6        The benefits of Green Mark buildings extend well beyond financial returns, delivering significant improvements to health and wellbeing of occupants. Joint research[3]by BCA and the National University of Singapore also showed that these Green Mark-certified buildings maintain superior indoor environmental conditions, with lower concentrations of pollutants and significantly fewer reported health-related symptoms among occupants. These findings underscore the BCA Green Mark certification scheme's role in creating not just environmentally sustainable, but also healthier workspaces for Singapore's workforce (refer to Annex A for more details).Bridging Green Buildings with Sustainable Finance7            At the Dinner, Minister Chee also announced the publication of an Insights Report that aims to bridge the gap between green buildings and sustainable finance in the Asia Pacific region. This is the first in a new series of regional publications developed to support the transition towards a more sustainable, circular, and resilient built environment across Asia Pacific.8            Led by the World Green Building Council (WorldGBC), with strong support from OCBC and Asia Pacific green building councils including SGBC, the Report offers a concise yet strategic overview of the current state of readiness across the sector, presenting key messages and early observations drawn from multi-stakeholder engagement, regional data, and global trends. The Report highlights the urgent need for systemic change in how we design, build, use, and recover building materials,  and identifies the policy, industry, and financial levers that can help accelerate this transition. Together, the three-part publication suite will form a common reference point for policymakers and market actors, supporting more coherent action, investment alignment, and measurable progress across the Built Environment sector.9            “As we celebrate the BCA Green Mark certification scheme’s 20thanniversary, this new series of publications represent the next frontier in our green building journey,” Mr Allen Ang, President of SGBC, said. “Singapore's two decades of experience in greening the built environment has laid a strong foundation for this regional initiative. By analysing regional data and global trends, we've identified critical policy, industry and financial levers to accelerate the transition to circular, low-carbon construction. These findings will serve as a vital reference point to align investments and drive measurable progress across Asia Pacific, building on the success we've achieved with BCA Green Mark.” (refer to Annex C for more details on the guide).Charting the Path Forward for Decarbonising the Built Environment10         To chart the path for Singapore’s next set of decarbonisation goals beyond 2030, Minister Chee also announced the development of an updated Built Environment Decarbonisation Technology Roadmap, outlining key emerging technologies and areas for research and development to improve energy efficiency in Singapore's built environment. Building upon the foundations of the SLE Building Technology Roadmap launched in 2018, this latest development will identify crucial technologies and implementation timelines that will enable the sector to meet its sustainability goals. It will undergo public consultation to gather insights from industry stakeholders and members of the public before it is launched (refer to Annex D for more details).11       Complementing the roadmap, BCA has also launched a new technical reference for hybrid cooling, which aims to accelerate the deployment of hybrid cooling systems by providing comprehensive guidelines for the implementation of energy-efficient cooling systems in buildings. This reference will help building owners and developers adopt more sustainable cooling solutions, especially in the context of Singapore's tropical climate (refer to Annex E for more details).12         Mr Tan Chee Kiat, Deputy CEO for Industry Development at BCA, said, \"The BCA Green Mark certification scheme has evolved from a pioneering initiative to evaluate a building’s environment impact and performance to become Singapore's hallmark of championing sustainable building excellence. As we mark this milestone, we urge developers and building owners to aim higher – be it achieving Green Mark Super Low Energy certification for new projects or upgrading existing buildings to higher standards. BCA will continue supporting the industry in charting the way forward. The future is about green real estate, and there has never been a better time to invest in sustainability.\"Issued by the Building and Construction Authority and Singapore Green Building Council on 11 July 2025Download the PDF version of the factsheets here.Annex A: Factsheet on 20 years of greening Singapore’s built environmentAnnex B: Recipients of GM 20th anniversary commemorative certificateAnnex C: Factsheet on Aligning Asia Pacific Green Building Rating Tools to the ASEAN Taxonomy for Sustainable Finance Publication SeriesAnnex D: Factsheet on Built Environment Decarbonisation Technology RoadmapAnnex E: Factsheet on Technical Reference for Hybrid CoolingAbout BCAThe Building and Construction Authority (BCA) champions the development and transformation of the Built Environment sector, in order to improve Singapore’s living environment. BCA oversees areas such as safety, quality, inclusiveness, sustainability and productivity, all of which, together with our stakeholders and industry partners, help to achieve our mission to transform the Built Environment sector and shape a liveable and smart built environment for Singapore. For more information, visit www1.bca.gov.sgAbout SGBCThe Singapore Green Building Council (SGBC) enables sustainability across the building and construction value chain, championing capability development and innovative solutions that support industry transformation through our membership, certification, and outreach programmes. The repository of proven green building solutions helps to enable green procurement in the industry, profiling leading and innovative solutions that go towards building a greener, healthier built environment. Together with a growing pool of industry-recognised Green Mark Accredited Professionals, SGBC addresses every touchpoint of the green building ecosystem.[1]From Green Mark submissions database[2]https://www.cbre.com/insights/reports/decarbonising-asia-pacific-s-office-buildings[3]https://onlinelibrary.wiley.com/doi/abs/10.1111/ina.12515Popular e-ServicesCWRSThe Construction Workforce Registration System (CWRS) is an online portal for CoreTrade and Multi-skilling registration and the renewal of Direct R1 eligibility.Overseas Testing Management SystemOTMS allows you to register the workers for Identity Verification and to check your registration status online.Lifts and Escalators Application (LEAP) PortalLift and escalator owners, contractors and Specialist Professional Engineers (SPEs) can apply for and view applications for Permit to Operate (PTO) here.The Building and Construction Authority (BCA) champions the development and transformation of the built environment sector, in order to improve Singapore’s living environment. BCA oversees areas such as safety, quality, inclusiveness, sustainability and productivity, all of which, together with our stakeholders and partners, help to achieve our mission to transform the Built Environment sector and shape a liveable and smart built environment for Singapore.Contact UsFeedbackFAQSReachReport VulnerabilityPrivacy StatementTerms of UseSitemap", "timestamp": "2025-09-21T17:33:21+08:00", "url": "http://www1.bca.gov.sg/about-us/news-and-publications/media-releases/2025/07/11/sgbc-gala-dinner-2025-media-release", "language": "en", "metadata": {"agency": "BCA", "category": "media_releases", "content_length": 9627, "keywords": ["productivity", "green mark", "sustainability", "industry transformation"], "title": "Twenty Years of Greening Buildings In Singapore Results In Annual Energy Savings That Can Power One Million 4-Room HDB Flats Per Year", "policy_type": "industry_announcement", "policy_subtype": "media_release", "industry_impact": ["developers"]}}
{"id": "bca_media_releases_20250921_173342_7994", "source": "government_bca", "text": "Built Environment Sector Gets a $100M Boost To Drive Next Phase of Industry Transformation, Complementing Taskforce Efforts To Strengthen Business Sustainability and Talent Pipelines×!feedbackIndustry InfoBuildSG is a national movement that encapsulates the spirit of collaboration in the transformation of the built environment sector. It underscores the collaboration among the government, unions, trade associations and chambers, industry and institutes of higher learning, all working collectively to realise an advanced and integrated built environment sector with progressive and collaborative firms well-poised for both local and global business opportunities, and providing good jobs for Singaporeans.Accessibility & Universal DesignBuildSG MovementBuilt Environment Technology Alliance (BETA)BCA AwardsBuildSG Transformation FundBuilt Environment Industry Transformation Map (ITM)DigitalisationEnabling Innovation AdoptionFacilities Management (FM)Leadership InitiativesManpowerProductivityQualitySustainabilityRegulatory InfoFind out more about the regulations pertaining to Singapore’s built environment.Amusement RidesBuilding ControlBuilding Maintenance and Strata ManagementEssential Construction MaterialsLegislation on Environmental Sustainability for BuildingsLifts & EscalatorsOutdoor Advertisement LicensingSecurity of PaymentTemporary Buildings ApplicationEnforcement ActionsSmart InspectionProcurementFind out more about the procurement frameworks and conditions of contract for public sector construction-related works.Pre-tender StageTender StagePost-tender StagePublicFind out more about the different aspects of the built environment and how you can play a part in our mission to shape a safe, high quality, sustainable and friendly built environment for everyone.Private Property OwnershipLearn about the Built EnvironmentSafety Resourcese-ServicesAbout UsAbout BCABCA AcademyBoard and ManagementBCA Undergraduate ScholarshipCareersCorporate Social ResponsibilityEventsNews and PublicationsOur AccoladesPWD-BCA ClubBuildSG - E-MagazineBuildSG.gov.sge-MagazineBuilt Environment Sector Gets a $100M Boost To Drive Next Phase of Industry Transformation, Complementing Taskforce Efforts To Strengthen Business Sustainability and Talent PipelinesUseful LinksCircularsPublicationsSpeechesReplies To Forum LettersAnnual ReportPublications & ReportsHomeAbout UsNews and PublicationsMedia ReleasesWednesday, 5 March 2025-Good progress made in key industry transformation areas such as digitalisation, productivity and sustainability.-The Built Environment Technology and Capability (BETC) grant will continue to support firms in their transformation efforts, with grant applications starting from 1 April 2025.-The Taskforce for Architectural and Engineering Consultants (“Taskforce”) has launched new initiatives to improve the sector’s business sustainability, transform Human Resource (HR) practices to attract and retain talents, and accelerate sector transformation.Minister for National Development and Minister-in-charge of Social Services Integration, Mr Desmond Lee has unveiled a $100 million Built Environment Technology and Capability (BETC) grant to support the industry for the next phase of transformation in the Built Environment (BE) sector, with outcomes aligned with the Built Environment (BE) Industry Transformation Map (ITM).  This will provide support to more ITM areas and emphasise longer-term capability building to advance transformation. The BETC grant will support BE firms in developing new capabilities in enterprise, technology and manpower, enhancing their competitiveness in an evolving industry landscape.2            This comes against the backdrop of the BE sector making significant strides in key BE ITM transformation areas between 2023 and 2024 – Integrated Digital Delivery (IDD) adoption in new developments rose from 58% to 67%, while Design for Manufacturing and Assembly (DfMA) uptake increased from 61% to 68%. Good progress has also been made for the Singapore Green Building Masterplan “80-80-80” targets. As of December 2024, about 61% of buildings by Gross Floor Area (GFA) were greened; close to 26% of new developments were certified as Super Low Energy (SLE) buildings, and top-performing buildings showed 72% better energy efficiency compared to 2005 levels. For more details on BE ITM progress updates, please refer to Annex A.Supporting longer-term capability building through the BETC grant3            The BETC grant incentivises BE firms to embark on their next bound of transformation and capability building to achieve higher productivity, a higher-skilled workforce and stronger collaboration. Applicants will need to demonstrate how they plan to apply the new capabilities that they aim to develop, not just for a standalone project, but also for their subsequent projects. They will also need to outline how this would be aligned to their company’s longer-term goals. The capabilities and transformation outcomes should surpass relevant industry standards. This is to enable more impactful, and sustained transformation within the firms, and in turn, in the sector.4            The BETC grant will be available for application on the Business Grants Portal (BGP)[1]from 1 April 2025, for a period of five years. BE firms, including developers, main builders, sub-contractors, consultants, prefabricators, and suppliers can apply.  Small and Medium-sized Enterprises (SMEs) may receive up to 70% funding support, while non-SMEs may receive up to 50% funding support in the first two years. The funding support will be determined based on the expected transformation outcomes committed by the applicant. For more details, please refer to Annex B.Strengthening the talent pipeline and business sustainability of the BE professions5            Second Minister for Finance and Second Minister for National Development Ms Indranee Rajah provided an update on the Taskforce’s initiatives during MND’s Committee of Supply (COS). Set up in September 2024, the Taskforce brings together industry and Government bodies to co-create solutions to common challenges. The Taskforce has also engaged close to 200 stakeholders to solicit feedback and suggestions. The stakeholders consulted include students, young professionals, and representatives from consultancy firms, service buyers, Trade Associations and Institutes of Higher Learning (IHLs).Improving Business Sustainability6            The Taskforce recognises the industry’s concerns on how aggressive tender bidding behaviours and fee-diving could undermine firms’ ability to invest in human capital, technology and innovation.7            As a major buyer of BE consultancy services, the Government has been progressively enhancing our procurement approach to deter fee-diving and strengthen quality-based procurement. Today, the majority of public sector tenders are awarded to bids with top quality scores.8        To further promote fairer and more quality-based procurement and give the industry greater assurance to invest more in human capital and innovation, the Government will:Expand the ‘Reduced Fee Score’ pilot, which was first introduced in March 2024, to more projects. The “Reduced Fee Score” formula disqualifies outlier bids that are substantially lower than other bids in the same tender. This will ensure that procurement decisions prioritise quality and business sustainability even more, rather than awarding projects to unsustainable low bids that may compromise the eventual outcomes.Review contractual clauses to ensure fairer balance of risks between public sector service buyers and BE consultants. This includes reviewing the “Limitation of Liability” clause in the Public Sector Standard Consultancy Agreement, and the “Fit for Purpose” clauses in the Public Sector Standard Conditions of Contract for Design & Build (D&B) construction contracts. This will provide greater assurance to firms, and make the professions more sustainable.9            The Taskforce is engaging the private developers to encourage adoption of similar procurement approaches. For more details on ‘Reduced Fee Score’ and Limitation of Liability, please refer to Annex C.Investing in Talent Pipeline and Better HR Practices10          To support the career development and experience of in-service talents, the Singapore Institute of Architects (SIA), Association of Consulting Engineers Singapore (ACES) and the Institute of Human Resource Professionals (IHRP) will form a new partnership to roll out HR transformation support for member firms.  The partnership will progressively support firms identify areas for improvement using the Human Capital Diagnostic Tool (HCDT), build a community of practice to share best practices and address common issues, and refer firms to resources to transform HR practices within firms.11          To help strengthen the talent pipeline and make BE careers a career of choice, the Taskforce is working with industry stakeholders and IHLs to propagate more enriching internship experiences (e.g. the Integrated Work-Study Programme offered by Singapore Institute of Technology) and review the starting salaries for fresh graduates. The Taskforce is heartened that several progressive firms, such as Arup Singapore, Beca, DP Architects, and ID Architects have taken the lead in adopting these initiatives. The Taskforce will engage more firms to jointly improve the attractiveness of BE careers to Singaporeans keen to play a role in building a more sustainable, inclusive and endearing Singapore.Support for Industry and Workforce Transformation12          To help firms and professionals identify the transformation support that best meet their needs, BCA will launch a one-stop compilation of available support resources and programmes (including BETC) made available by Government agencies, the Trade Associations and Chambers (TACs), Institutes of Higher Learning and other stakeholders. TACs, can then guide their member firms and professional associations accordingly.13      The Taskforce is also looking at how the TACs can take on a leading role in catalysing transformation of member firms and uplifting the professions, such as in the areas of branding, outreach, HR practices and technology adoption.14          Ms Indranee Rajah also updated on several other initiatives including the Code of Accessibility 2025. More details can be found in Annex D.Download the PDF version of the Media Release hereDownload the Annexes here[1]Please visit the Business Grants Portal (BGP) athttps://www.apply.gov.sg/grants/business.Popular e-ServicesCWRSThe Construction Workforce Registration System (CWRS) is an online portal for CoreTrade and Multi-skilling registration and the renewal of Direct R1 eligibility.Overseas Testing Management SystemOTMS allows you to register the workers for Identity Verification and to check your registration status online.Lifts and Escalators Application (LEAP) PortalLift and escalator owners, contractors and Specialist Professional Engineers (SPEs) can apply for and view applications for Permit to Operate (PTO) here.The Building and Construction Authority (BCA) champions the development and transformation of the built environment sector, in order to improve Singapore’s living environment. BCA oversees areas such as safety, quality, inclusiveness, sustainability and productivity, all of which, together with our stakeholders and partners, help to achieve our mission to transform the Built Environment sector and shape a liveable and smart built environment for Singapore.Contact UsFeedbackFAQSReachReport VulnerabilityPrivacy StatementTerms of UseSitemap", "timestamp": "2025-09-21T17:33:42+08:00", "url": "http://www1.bca.gov.sg/about-us/news-and-publications/media-releases/2025/03/05/built-environment-sector-gets-a--100m-boost-to-drive-next-phase-of-industry-transformation--complementing-taskforce-efforts-to-strengthen-business-sustainability-and-talent-pipelines", "language": "en", "metadata": {"agency": "BCA", "category": "media_releases", "content_length": 8251, "keywords": ["productivity", "sustainability", "industry transformation"], "title": "Built Environment Sector Gets a $100M Boost To Drive Next Phase of Industry Transformation, Complementing Taskforce Efforts To Strengthen Business Sustainability and Talent Pipelines", "policy_type": "industry_announcement", "policy_subtype": "media_release", "key_materials": ["labor"], "industry_impact": ["developers", "contractors", "buyers"]}}
