{"id": "sfa_newsroom_-8712147143974307472", "source": "government_sfa", "text": "A-A+Media ReleasesExtension of Lease for Pasir Panjang Wholesale Centre & Jurong Fishery Port to 204029 Aug 2025PPWC to undergo regularization worksPasir Panjang Wholesale Centre (PPWC) and Jurong      Fishery Port (JFP) are wholesale hubs in Singapore’s agri-food system,      supplying supermarkets, wet markets, restaurants, and food operators      nationwide. PPWC is the nation’s largest wholesale centre for fruits,      vegetables, and dried goods while JFP is Singapore’s only fishery port.As the current leases of PPWC and JFP will be      expiring in 2026 and 2030 respectively, the Singapore Food Agency (SFA)      has been working with relevant agencies to extend the leases of both PPWC      and JFP to 2040. These extensions are to ensure a continued and resilient      food supply chain for Singapore.Jurong Fishery Port (JFP)The JFP will have its lease extended to 2040. The extension to 2040 will allow SFA’s tenants      within JFP to plan, invest, and upgrade with confidence.Pasir Panjang Wholesale CentreIn order to secure PPWC’s lease extension to      2040, PPWC must rectify all fire-safety non-compliances by end-2026.Progress To Date.SFA has completed the installation of sprinklers      in common areas and linear heat detectors in shops, laying the foundation      for broader rectification works. The only outstanding rectification works      involve some of the shops.Approximately 200 shops out of 1,200 in the PPWC      will be required to undertake fire safety compliance works which include      regularising past Addition & Alteration (A&A) modifications made      by the lessees without SFA approval as well as installing in-unit      sprinkler systems. These rectifications are critical to ensure the safety      of tenants, workers and the public visiting PPWC. Since 2022, SFA has been      working closely with tenants and the Singapore Civil Defence Force (SCDF)      to progressively address fire safety requirements.Next Phase of Works.Building on earlier efforts, SFA will complete      the Addition & Alteration (A&A) regularisation exercise      progressively between now and end-2026. This will include:Demolishing non-fire safety compliant assets       from units to facilitate the installationof sprinklers;Installing in-unit sprinklers for each shop; andSecuring fire-safety approvals for the entire       PPWC once the entire sprinkler system is properly tested.Support for Tenants.SFA will bear the cost of installing sprinklers at the      ceiling of each shop (i.e. 1stlevel sprinklers) and demolish      existing chillers/assets which are non-fire safety compliant. In addition, affected tenants will receive three      months’ rent and Service & Conservancy Charges waivers. Swing spaces      will be allocated to ensure continuity of trade.Co-funding support would be provided to tenants who need to reinstall their chillers.To ensure quality and minimise disruption, SFA-appointed contractors      are working closely with the PPWC Association and affected tenants —      reviewing unit layouts, polling their operational needs, and sequencing      works in consultation with them. Tenants who do not wish to continue their      leases may opt to exit without reinstatement obligations.Management of common area -Over time, some tenants have also expanded their      trading activities into common spaces, affecting escape routes and      obstructing fire safety provisions. These encroachments create fire      hazards that must be rectified. SFA will work with SCDF to ensure that      these fire hazards are rectified, to provide a safer environment for      the tenants and visitors.Ensuring Food Supply ResilienceSFA is committed to ensuring Singapore's food      supply resilience by strengthening critical food supply nodes,      diversifying import sources, and building long-term resilience in      Singapore's agri-food trade. The lease extensions for both PPWC and JFP      will enable SFA and relevant agencies to strengthen food supply chains      supporting Singapore's agri-food trade.Senior Minister of State for Sustainability and      the Environment, Mr Zaqy Mohamad said, “Ensuring a continued supply of safe food for Singapore      and Singaporeans is a key priority. It is therefore crucial for these      facilities to be upgraded, rejuvenated and future-ready, to support      resiliency in Singapore’s food supply chain. At the same time, ensuring      the safety of tenants, customers and other stakeholders operating at our      facilities is also of paramount importance. Hence, we must do the      necessary rectifications in PPWC in accordance with mandatory fire safety      requirements. Though there may be some inconveniences during the      regularisation works at PPWC, SFA will continue to work closely with      stakeholders involved and provide the necessary assistance to ensure      business continuity and minimise disruptions.”Annex A – About PPWC and JFPPPWC, opened in 1983 by the Ministry of Nati", "timestamp": "2025-08-29T05:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/extension-of-lease-for-pasir-panjang-wholesale-centre---jurong-fishery-port-to-2040", "language": "en", "metadata": {"title": "Extension of Lease for Pasir Panjang Wholesale Centre & Jurong Fishery Port to 2040", "agency": "SFA", "category": "wholesale_infrastructure", "content_length": 5000, "keywords": ["wholesale centre", "fishery port", "Pasir Panjang", "Jurong", "lease extension", "supply chain"], "press_release_id": null, "policy_type": "lease_extension", "policy_subtype": "wholesale_facilities", "facilities": ["Jurong Fishery Port", "Pasir Panjang Wholesale Centre", "wet market"], "lease_duration": "2040", "infrastructure_type": "food_distribution", "regional_impact": ["common area", "Jurong", "Pasir Panjang"], "supply_chain_security": true, "long_term_commitment": true}}
{"id": "sfa_newsroom_57931593155467451", "source": "government_sfa", "text": "A-A+Media ReleasesRecall of various Cocobella Coconut Yoghurt products due to the presence of undeclared milk allergen23 Aug 2025Recall of various Cocobella Coconut Yoghurt products due to the presence of undeclared milk allergenFood Standards Australia New Zealand has issued a notification on the recall of various Cocobella Coconut Yoghurt products due to the presence of an undeclared milk allergen.2          As the products were imported to Singapore, the Singapore Food Agency (SFA) has directed the importer, Made Brands Pte Ltd, to recall the implicated products. The recall is ongoing.3         Allergens in food could result in allergic reactions in individuals who are sensitive to it. Under Singapore’s Food Regulations, food products containing ingredients that are known to cause hypersensitivity must be declared on food packaging labels to protect consumers with food allergies.4         Milk does not pose a food safety issue to consumers at large, except to those that are intolerant of or allergic to milk. Consumers who have purchased the affected product, and who are intolerant of or allergic to milk, should not consume them. Those who are intolerant of or allergic to milk and have consumed the implicated product should seek medical advice if they have concerns about their health. Consumers may contact their point of purchase for enquiries.5        Details of the product is as follows:Product name:Cocobella Coconut Yoghurt (150g and 500g)Use by Date:22 Aug 2025 to 5 Oct 2025Country of origin:AustraliaIssued by the Singapore Food Agency23 August 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-08-23T07:02:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/recall-of-various-cocobella-coconut-yoghurt-products-due-to-the-presence-of-undeclared-milk-allergen", "language": "en", "metadata": {"title": "Recall of various Cocobella Coconut Yoghurt products due to the presence of undeclared milk allergen", "agency": "SFA", "category": "general_announcement", "content_length": 3871, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_-7149409161085897518", "source": "government_sfa", "text": "A-A+Media ReleasesRecall of Coolibah Herbs Gourmet Salad Mix due to exceeding levels of Bacillus cereus21 Aug 2025SFA has detectedBacillus cereus (B. cereus)in Coolibah Herbs Gourmet Salad Mix at levels exceeding the permissible limits stipulated in Singapore’s Food Regulations.2       As a precautionary measure, SFA has directed the importer, Freshmart Singapore Pte Ltd, to recall the implicated products. The recall is ongoing.3      B. cereus is a bacterium normally found in the environment and the intestinal tracts of insects and mammals. B. cereus is a common cause of food poisoning and affected individuals may experience an onset of symptoms such as nausea, vomiting, stomach cramps, and diarrhoea.4      Consumers who have purchased the implicated product are advised not to consume it. Those who have consumed the implicated product and have concerns about their health should seek medical advice. Consumers may contact their point of purchase for enquiries.5     More information onB. cereusin food can be foundhere.6     Details of the product is as follows:Product name:Coolibah Herbs Gourment Salad MixBest before:23 August 2025Country of origin:AustraliaIssued by the Singapore Food Agency21 August 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-08-21T02:41:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/recall-of-coolibah-herbs-gourmet-salad-mix-due-to-exceeding-levels-of-bacillus-cereus", "language": "en", "metadata": {"title": "Recall of Coolibah Herbs Gourmet Salad Mix due to exceeding levels of Bacillus cereus", "agency": "SFA", "category": "general_announcement", "content_length": 3513, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_-5093369959502735427", "source": "government_sfa", "text": "A-A+Media ReleasesTender Closing for Three Land Parcels for Farming Use at Lim Chu Kang and Sungei Tengah18 Aug 2025The Singapore Food Agency (SFA) has closed the public tender for three land parcels for farming use at Lim Chu Kang and Sungei Tengah today.2          The land parcels were launched for public tender on 23 June 2025. Please refer to Annexes 1 & 2 for further details of the land parcels.3          A total of 15 proposals were received by SFA for the three land parcels. Details of the bids received can be found in Annex 3.4          This is not an announcement of tender award. A decision on the award of the tender will be made after the tender proposals have been evaluated. This will be announced at a later date.Annex 1Annex 2Annex 3TENDER SCHEDULE - TENDER REF NO: SFA000/(R)001(25)LAND PARCELS FOR FARMING USE AT LIM CHU KANG AND SUNGEI TENGAHDATE OF INVITATION\t:    23 JUNE 2025DATE OF CLOSING      :    18 AUGUST 2025TENDER BOX NO         :    1Issued by the Singapore Food Agency18 Aug 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-08-18T09:30:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/tender-closing-for-three-land-parcels-for-farming-use-at-lim-chu-kang-and-sungei-tengah", "language": "en", "metadata": {"title": "Tender Closing for Three Land Parcels for Farming Use at Lim Chu Kang and Sungei Tengah", "agency": "SFA", "category": "agricultural_land", "content_length": 3307, "keywords": ["land parcel", "Lim Chu Kang", "Sungei Tengah"], "press_release_id": null, "policy_type": "land_allocation", "policy_subtype": "farming_development", "locations": ["The Singapore", "Singapore Public", "Farming Use", "Lim Chu", "Sungei Tengah", "Three Land", "Media Releases", "Singapore Food", "Food Farmer", "Tender Closing", "Visual Design", "Food Trader", "Food Agency", "Lim Chu Kang", "Food Manufacturer", "Food Retailer"], "land_use": "agricultural", "food_security": true, "rural_development": true, "regional_planning": true}}
{"id": "sfa_newsroom_2494439688730683492", "source": "government_sfa", "text": "A-A+Media ReleasesAdditional recall of two cheese products due to possible presence of Listeria monocytogenes14 Aug 2025UPDATED MEDIA RELEASEUpdate on 14 August 2025:Further to our media release on 13 August 2025, the Singapore Food Agency (SFA) has extended the recall to include two more soft cheese products due to possible presence of Listeria monocytogenes.2This follows additional alerts from the European Commission Rapid Alert System for Foodand Feed (RASFF) and the French Rappel Consommateur on the following two products respectively :Royal Faucon Camembert De Caractere (250g)⁠Vieux Porche Camembert De Caractere (250g)3          SFA has directed the importers, Classic Fine Foods (S) Pte Ltd and Culina Pte Ltd, to recall the implicated products. The recall is ongoing.4         Consumers who have purchased the implicated products are advised not to consume it. Those who have consumed the implicated products and have concerns about their health should seek medical advice. Consumers may contact their point of purchase for enquiries.5          Details of the implicated products are as follows:Product name:Vieux Porche Camembert De Caractere (250g)Best Before date:All batches with Best Before Date up to and including 30/08/2025Country of origin:FranceImporter:Classic Fine Foods (S) Pte LtdProduct name:Royal Faucon Camembert De Caractere (250g)Best Before date:17/08/2025Country of origin:FranceImporter:Culina Pte LtdRecall of Vieux Porche Buchette (200g) due to potential Listeria contaminationThe FrenchRappel Consommateurhas issued a recall of a soft cheese, Vieux Porche Buchette (200g) in France, due to possible presence ofListeria monocytogenes.2          As the affected product was imported into Singapore, SFA has directed the importers, Classic Fine Foods Pte Ltd and Indoguna (Singapore) Pte Ltd, to recall the implicated products. The recall is ongoing.3Listeria monocytogenesis foodborne bacterium that can cause food poisoning. Food that are at higher risk of being contaminated with Listeria include unpasteurised (raw) dairy products, soft cheese including those ripened by mould, refrigerated meat spread, smoked fish and ready-to-eat deli meats and sausages. Symptoms of Listeria infection may include fever, muscle ache, nausea and diarrhoea. Listeria can be fatal to pregnant women, infants and the immunocompromised. More information on Listeria in food can be found at:https://www.sfa.gov.sg/food-information/risk-at-a-glance/listeria-in-food.4             Consumers who have purchased the implicated product are advised not to consume it. Those who have consumed the implicated product and have concerns about their health should seek medical advice. Consumers may contact their point of purchase for enquiries.5            Details of the implicated product are as follows:Product name:Vieux Porche Buchette (200g)Best Before date:All batches with Best Before Date up to and including 20/08/2025Country of origin:FranceImporter:Classic Fine Foods Pte Ltd and Indoguna (Singapore) Pte LtdIssued by the Singapore Food Agency13 August 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery di", "timestamp": "2025-08-14T10:46:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/additional-recall-of-two-soft-cheese-products-due-to-possible-presence-of-listeria-monocytogenes", "language": "en", "metadata": {"title": "Additional recall of two cheese products due to possible presence of Listeria monocytogenes", "agency": "SFA", "category": "general_announcement", "content_length": 5000, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_2956440297894575243", "source": "government_sfa", "text": "A-A+Media ReleasesAbout 360kg of illegally imported fresh produce seized14 Aug 2025The Singapore Food Agency (SFA) has seized around 360kg of fresh produce illegally imported from Malaysia.2          On 12 and 13 August 2025, SFA and the Immigration & Checkpoints Authority (ICA) conducted a joint operation on delivery trucks which typically transport produce intended for direct distribution to retailers and customers. During the operation, ICA officers at Woodlands Checkpoint noticed discrepancies in the consignment transported by a truck and referred it to SFA for further checks.3          SFA found undeclared and under-declared produce such as tapioca, lime, galangal ginger and Kemangi leaves imported by one importer in the truck. All illegally imported produce were seized.4          SFA is following up with further investigations and will not hesitate to take enforcement action.Produce is weighed and the total weight is tallied (Photo: SFA)All illegal imports seized (Photo: SFA)5            In Singapore, food imports must meet SFA’s requirements. Illegally imported produce and food products of unknown sources can pose a food safety risk. Food can only be imported by licensed importers, and every consignment must be declared and accompanied with a valid import permit.6            Offenders who illegally import fresh fruits and vegetables shall be liable on conviction to a maximum fine of $10,000 and/or imprisonment for a term not exceeding three years.7            Safeguarding Singapore’s borders remains a top priority for ICA. ICA will continue to conduct security checks to detect and deter illegal importation attempts to keep Singapore safe. SFA will continue to safeguard food safety through our integrated food safety system, which includes strict import regulations and enforcement, and work closely with border control agencies to deter illegal importation across our borders.Issued by the Singapore Food Agency and the Immigration &\nCheckpoints Authority14 August 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-08-14T07:45:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/about-360kg-of-illegally-imported-fresh-produce-seized", "language": "en", "metadata": {"title": "About 360kg of illegally imported fresh produce seized", "agency": "SFA", "category": "general_announcement", "content_length": 4295, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_-5870222693602675801", "source": "government_sfa", "text": "A-A+Media ReleasesRecall of Vieux Porche Buchette (200g) due to potential Listeria contamination13 Aug 2025The FrenchRappel Consommateurhas issued a recall of a soft cheese, Vieux Porche Buchette (200g) in France, due to possible presence ofListeria monocytogenes.2          As the affected product was imported into Singapore, SFA has directed the importers, Classic Fine Foods Pte Ltd and Indoguna (Singapore) Pte Ltd, to recall the implicated products. The recall is ongoing.3Listeria monocytogenesis foodborne bacterium that can cause food poisoning. Food that are at higher risk of being contaminated with Listeria include unpasteurised (raw) dairy products, soft cheese including those ripened by mould, refrigerated meat spread, smoked fish and ready-to-eat deli meats and sausages. Symptoms of Listeria infection may include fever, muscle ache, nausea and diarrhoea. Listeria can be fatal to pregnant women, infants and the immunocompromised. More information on Listeria in food can be found at:https://www.sfa.gov.sg/food-information/risk-at-a-glance/listeria-in-food.4         Consumers who have purchased the implicated product are advised not to consume it. Those who have consumed the implicated product and have concerns about their health should seek medical advice. Consumers may contact their point of purchase for enquiries.5              Details of the implicated product are as follows:ImplicatedProductProduct name:Vieux Porche Buchette (200g)Best Beforedate:All batches with Best Before Date up to and including 20/08/2025Country oforigin:FranceImporter:Classic Fine Foods Pte Ltd and Indoguna (Singapore) Pte LtdIssued by the Singapore Food Agency13 August 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-08-13T03:26:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/recall-of-vieux-porche-buchette--200g--due-to-potential-listeria-contamination", "language": "en", "metadata": {"title": "Recall of Vieux Porche Buchette (200g) due to potential Listeria contamination", "agency": "SFA", "category": "general_announcement", "content_length": 3975, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_6334274016806956862", "source": "government_sfa", "text": "A-A+Media ReleasesAbout three tonnes of illegally imported fresh produce seized following joint SFA-ICA operation25 Jul 2025The Singapore Food Agency (SFA) has seized around three tonnes of fresh produce illegally imported from Malaysia.2          On 24 and 25 July 2025, SFA and the Immigration & Checkpoints Authority (ICA) conducted a joint operation on delivery trucks which typically transport produce intended for direct distribution to retailers and customers. During the operation, ICA officers at Woodlands Checkpoint noticed discrepancies in the consignment transported by a truck and referred it to SFA for further checks.3          SFA found under-declared vegetables in the truck such as eggplants, cucumbers and long beans imported by one importer. All illegally imported produce were seized.4           SFA is following up with further investigations and will not hesitate to take enforcement action.Truck drivers unloading imports for inspection (left) and all illegal imports are seized (right) (Photos: SFA)5            In Singapore, food imports must meet SFA’s requirements. Illegally imported produce of unknown sources can pose a food safety risk. Food can only be imported by licensed importers, and every consignment must be declared and accompanied with a valid import permit.6            Offenders who illegally import fresh vegetables shall be liable on conviction to a maximum fine of $10,000 and/or imprisonment for a term not exceeding three years.7            Safeguarding Singapore’s borders remains a top priority for ICA. ICA will continue to conduct security checks to detect and deter illegal importation attempts to keep Singapore safe. SFA will continue to safeguard food safety through our integrated food safety system, which includes strict import regulations and enforcement, and work closely with border control agencies to deter illegal importation across our borders.Issued by the Singapore Food Agencyand the Immigration & Checkpoints Authority25 July 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-07-25T10:30:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/about-three-tonnes-of-illegally-imported-fresh-produce-seized-following-joint-sfa-ica-operation", "language": "en", "metadata": {"title": "About three tonnes of illegally imported fresh produce seized following joint SFA-ICA operation", "agency": "SFA", "category": "general_announcement", "content_length": 4292, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_5833548995457967407", "source": "government_sfa", "text": "A-A+Media ReleasesRecall of Primo Reserve Hot Sopressa Salami due to detection of Salmonella24 Jul 2025The Singapore Food Agency (SFA) has detectedSalmonellain Primo Reserve Hot Sopressa Salami imported from Australia by Alternative Selection Pte Ltd. As a precautionary measure, SFA has directed the importer to recall the implicated product. The recall is ongoing.2Salmonellais a pathogenic bacterium that can cause food poisoning. Symptoms may include diarrhoea, abdominal pain, fever, nausea and vomiting. More information onSalmonellain food can be found at: https://www.sfa.gov.sg/food-information/food-safety-education/food-contaminants.3            Consumers who have purchased the implicated product are advised not to consume it. Those who have consumed the implicated product and have concerns about their health should seek medical advice. Consumers may contact their point of purchase for enquiries.4            Details of the product is as follows:Product name:Primo Reserve Hot Sopressa SalamiUse By:09/09/2025Country of origin:AustraliaIssued by the Singapore Food Agency24 July 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-07-24T02:30:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/recall-of-primo-reserve-hot-sopressa-salami-due-to-detection-of-salmonella", "language": "en", "metadata": {"title": "Recall of Primo Reserve Hot Sopressa Salami due to detection of Salmonella", "agency": "SFA", "category": "general_announcement", "content_length": 3389, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_-5553642955673564390", "source": "government_sfa", "text": "A-A+Media ReleasesYun Hai Yao Pte Ltd fined $7,000 for food safety lapses17 Jul 2025Yun\nHai Yao Pte Ltd was fined $7,000 by the Court today for food safety lapses committed under the Sale of Food Act and\nEnvironmental Public Health (Food Hygiene) Regulations.2            In July 2024, the Ministry of Health\n(MOH) and Singapore Food Agency (SFA) received reports of gastroenteritis\ninvolving 171 individuals who had consumed food catered from Yun Hai Yao Pte\nLtd. 60 individuals were hospitalised.3           SFA and MOH conducted a joint\ninspection at the food establishment’s premises located at Northpoint City and\nfound several food safety lapses. These included cockroach infestation, and dirty racks and peelers. Additionally, a food\nsample from Yun Hai Yao Pte Ltd collected during the investigation failed SFA’s\nfood safety tests.Cockroach infestation (left) and unclean peeler (right) (Photos: SFA)4              In interest of public health, SFA directed the licensee to suspend their operations from 31 July 2024 to 16 August 2024 to rectify the lapses and take necessary measures to improve the food safety practices and cleanliness of premises.5            All food operators should ensure their premises are clean and well-maintained, as well as adhere to proper food hygiene and food safety requirements. SFA will not hesitate to take enforcement action against food operators found to be in violation of the Environmental Public Health Act. Offenders are liable on conviction to a fine not exceeding $2,000 and, in the case of a continuing offence, to a further fine not exceeding $100 for everyday or part thereof during which the offence continues after conviction.6            Additionally, under the Sale of Food Act, food operators must ensure that food sold is of the quality demanded by customers. Offenders are liable on conviction to a fine not exceeding $5,000 and, in the case of a second or subsequent conviction, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding three months or both.7              Food safety is a joint responsibility. Members of the public who come across poor food safety practices in food establishments are advised not to patronise them and provide feedback via our online feedback form (www.sfa.gov.sg/feedback) with details for our follow-up investigations.Issued by the Singapore Food Agency17 July 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-07-17T10:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/yun-hai-yao-pte-ltd-fined--7-000-for-food-safety-lapses", "language": "en", "metadata": {"title": "Yun Hai Yao Pte Ltd fined $7,000 for food safety lapses", "agency": "SFA", "category": "general_announcement", "content_length": 4675, "keywords": ["food establishment"], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_8542346198864348643", "source": "government_sfa", "text": "A-A+Forum RepliesSFA remains committed to food resilience26 Jun 2025We refer to the letter by Zhang Guo Cheng, “Where can I find food (借问食物何处有)” (17 June).Ensuring a continued supply of safe food for Singapore and Singaporeans is a key priority for the Singapore Food Agency (SFA). We maintain a comprehensive strategy to safeguard our nation's food security, through (i) source diversification; (ii) stockpiling; and (iii) local production, to counter potential disruptions brought about by factors such as climate change, the spread of animal-borne diseases, geopolitical tensions, and transformations in international trade dynamics.Import source diversification will continue to be our core strategy to reduce our reliance on any single source and to strengthen food security. We have increased import sources over the years and currently import from 187 countries/regions.We have also made good progress in stockpiling, which is another strategy to ensure food security in Singapore. We collaborate closely with our industry partners to maintain stockpiles of essential food items for emergencies and had updated our legislative framework as part of the Food Safety and Security Act to strengthen our food security system.Local production serves as a form of insurance and buffer against overseas supply disruptions, though there are inherent challenges from higher cost and a challenging global investment environment. SFA will continue to actively support the farming industry's growth through various initiatives such as availing space and infrastructure for farming, facilitating access to funding such as the Agri-Food Cluster Transformation Fund, and growing demand offtake for local produce with initiatives like the Singapore Fresh Produce logo, Farm-to-Table Recognition Programme, and supply-demand aggregation efforts (e.g., SG Farmers’ Market, The Straits Fish) through the Singapore Agro-Food Enterprises Federation (SAFEF). The 2024 figures show encouraging progress in some areas, particularly in egg production, where local farms have improved their efficiency and production and now supply 34% of our consumption needs. While vegetable and seafood production remain modest at 3% and 6% of our consumption respectively, both sectors have shown improved productivity in terms of production per hectare.Consumers and businesses can also play a part by supporting local produce to help secure Singapore’s food future. Local produce may not always be comparable or cheaper in pricing than imports, but it is fresher, lasts longer, incurs less transport miles and many of them are pesticide-free.Cheong Lai Peng張丽萍Senior Director高级署长Industry Development and Community Partnerships行业开发与社区合作部Singapore Food Agency 新加坡食品局Forum reply - 26 June 2025Forum letter by Huang Sen Yong- 17 June 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual D", "timestamp": "2025-06-26T03:43:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/sfa-remains-committed-to-food-resilience", "language": "en", "metadata": {"title": "SFA remains committed to food resilience", "agency": "SFA", "category": "agricultural_land", "content_length": 5000, "keywords": ["food security"], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "farming_development", "locations": ["Singapore Food", "Food Retailer", "Huang Sen", "Food Farmer", "Cheong Lai", "Food Cluster", "Transformation Fund", "Food Enterprises", "Forum Replies", "Food Manufacturer", "Food Safety", "Industry Development", "Singapore Fresh", "Singapore Public", "Zhang Guo", "Table Recognition", "Security Act", "Singapore Agro", "Community Partnerships", "Senior Director", "Visual Design", "Food Trader", "The Straits"], "land_use": "agricultural", "food_security": true, "rural_development": true, "regional_planning": true}}
{"id": "sfa_newsroom_-5680447855893587317", "source": "government_sfa", "text": "A-A+Forum RepliesPlastic containers for takeaway food safe when used as intended24 Jun 2025We refer to the letter by Zhang Guo Cheng, “Bringing your own containers for takeaway is healthier (自带容器打包食物更健康)” (12 June).Food contact articles including takeaway plastic packaging in Singapore are regulated to ensure consumer safety. Food contact articles that are imported, used, or sold in Singapore should not release harmful substances into food. The Singapore Food Agency (SFA) tests food contact articles, including plastic food containers, regularly to ensure that harmful substances do not migrate into food.Food handlers, including hawkers are taught the proper use of plastic food containers in the WSQ Food Safety Course Level 1. This is a course which SFA requires all food handlers to attend and pass.Takeaway plastic food containers are specifically designed for one-time use and should therefore not be reused for storing or reheating food. It is important that food establishments as well as consumers use plastic packaging for its intended use as advised by manufacturers.More information on the safe use of plastic food packaging can be found on SFA’s website:Safe Use of Plastic Food Packaging;SFA | FAQsJoanne Chan Sheot Harn (Associate Professor)陈淑娴(副教授)Centre Director中心署长National Centre for Food Science国家食品科学中心Singapore Food Agency新加坡食品局Forum reply - 24 June 2025Forum letter by Zhang Guo Cheng - 12 June 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-06-24T01:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/plastic-containers-for-takeaway-food-safe-when-used-as-intended", "language": "en", "metadata": {"title": "Plastic containers for takeaway food safe when used as intended", "agency": "SFA", "category": "general_announcement", "content_length": 3717, "keywords": ["food establishment"], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "hawker_development"}}
{"id": "sfa_newsroom_-8651677714788824728", "source": "government_sfa", "text": "A-A+Media ReleasesSFA Launches Tender for Three Land Parcels for Farming Use at Lim Chu Kang and Sungei Tengah23 Jun 2025The Singapore Food Agency (SFA) has launched three land parcels for farming use at Lim Chu Kang and Sungei Tengah for sale by public tender today. The tender is part of SFA’s Singapore Agri-Space Sales (SAS) Programme which encompasses all past and future land and sea space tenders.2          Every proposal will be assessed on its merits, in terms of production capability, track record, relevant farming experience as well as innovation and business sustainability, which includes the exercising of best farming practices. Proposals that can achieve sustainably high production levels will have a higher chance of being awarded these land parcels.3          The site at Lim Chu Kang can potentially be used for food fish farming or vegetable farming, while the two sites at Sungei Tengah can be used for vegetable farming. These form part of the agri-spaces released for local production to achieve Singapore’s food security objectives. Details of the land parcels and the location plans are inAnnex 1 and 2 respectively. The tender for the land parcels will close at 12 noon on 18 Aug 2025 (Monday).4          The tender documents are available for download on SFA website atwww.sfa.gov.sg/landsales.5          The SFA will continue to release a steady supply of agri-spaces in coming SAS programmes, with supply calibrated to account for prevailing economic and agrifood market conditions.Annex 1Annex 2Issued by the Singapore Food Agency23 Jun 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-06-23T08:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/sfa-launches-tender-for-three-land-parcels-for-farming-use-at-lim-chu-kang-and-sungei-tengah", "language": "en", "metadata": {"title": "SFA Launches Tender for Three Land Parcels for Farming Use at Lim Chu Kang and Sungei Tengah", "agency": "SFA", "category": "agricultural_land", "content_length": 3865, "keywords": ["land parcel", "Lim Chu Kang", "Sungei Tengah", "food security"], "press_release_id": null, "policy_type": "land_allocation", "policy_subtype": "farming_development", "locations": ["Space Sales", "The Singapore", "Singapore Public", "Food Retailer", "Farming Use", "Lim Chu", "Launches Tender", "Sungei Tengah", "Three Land", "Media Releases", "Singapore Food", "Food Farmer", "Visual Design", "Food Trader", "Food Agency", "Lim Chu Kang", "Food Manufacturer", "Singapore Agri"], "land_use": "agricultural", "food_security": true, "rural_development": true, "regional_planning": true}}
{"id": "sfa_newsroom_551464039067792329", "source": "government_sfa", "text": "A-A+Media Releases786 Spices Pte Ltd fined $2,000 for operating a non-retail food business without a licence16 Jun 2025786 Spices Pte Ltd was fined $2,000 by the Court today for processing and supplying meat, fish, and vegetable products at an unlicensed premises.2            On 21 August 2024, Singapore Food Agency (SFA) officers inspected the company’s premises at 20 Neythal Road and found the processing of meat, fish, and vegetable products within the premises for supply to a food stall. The company is not licensed to conduct any food processing activities or supply food. More than 800kg of food products were seized, including processed vegetables and frozen seafood.Chest freezers with unlicensed storage of food products (Photo: SFA)3          Illegal food processing and supply of food from unlicensed facilities pose a food safety risk. In Singapore, all food processing establishments must be licensed and are required to meet SFA’s requirements and food safety standards. These licensed establishments are also routinely inspected by SFA. Offenders who illegally process and supply food products shall be liable on conviction to a fine not exceeding $5,000 and, in the case of a second or subsequent conviction, to a fine not exceeding $10,000, or to imprisonment for a term not exceeding three months, or both.Issued by the Singapore Food Agency16 June 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-06-16T09:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/786-spices-pte-ltd-fined--2-000-for-operating-a-non-retail-food-business-without-a-licence", "language": "en", "metadata": {"title": "786 Spices Pte Ltd fined $2,000 for operating a non-retail food business without a licence", "agency": "SFA", "category": "general_announcement", "content_length": 3665, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_-2667083676686094546", "source": "government_sfa", "text": "A-A+Media ReleasesRecall of Haichijia brand Hua Jia Jiang Hu (Clam Vermicelli) due to undeclared gluten and wheat allergens12 Jun 2025The New Zealand Ministry for Primary Industries has issued a notification on the recall of Haichijia brand Hua Jia Jiang Hu (Clam Vermicelli) due to undeclared gluten and wheat allergens.2          As the implicated product was imported into Singapore, the Singapore Food Agency has directed the importer, Hong Xin Da Pte. Ltd., to recall the product. The recall is ongoing.3          Allergens in food could result in allergic reaction in individuals who are sensitive to it. Under Singapore’s Food Regulations, food products containing ingredients that are known to cause hypersensitivity must be declared on food packaging labels to protect consumers with food allergies.4          Gluten and wheat does not pose a food safety issue to consumers at large, except for those that are intolerant of, or allergic to, gluten and wheat. Consumers who have purchased the affected product, and who are intolerant of, or allergic to, gluten and wheat, should not consume them. Those who are intolerant of, or allergic to, gluten and wheat and have consumed the implicated product should seek medical advice if they have concerns about their health. Consumers may contact their point of purchase for enquiries.5            Details of the implicated product are as follows:Issued by the Singapore Food Agency11 June 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-06-12T02:42:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/recall-of-haichijia-brand-hua-jia-jiang-hu--clam-vermicelli--due-to-undeclared-gluten-and-wheat-allergens", "language": "en", "metadata": {"title": "Recall of Haichijia brand Hua Jia Jiang Hu (Clam Vermicelli) due to undeclared gluten and wheat allergens", "agency": "SFA", "category": "general_announcement", "content_length": 3736, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_661719062514571579", "source": "government_sfa", "text": "A-A+Forum RepliesSFA adopts a science-based approach in regulating food colourings09 Jun 2025We refer to the letter by Ang Chiew Leng, “Look into reviewing food dyes used in Singapore” (ST, May 20).Synthetic colouring compounds allowed for use in food in Singapore must first be assessed by the Singapore Food Agency (SFA) to be safe for consumption.SFA adopts a science-based risk management approach that is consistent with international standards to ensure food safety.When assessing the safety of synthetic food colourings, SFA takes reference from the assessments by the Joint FAO/WHO Expert Committee on Food Additives (JECFA).Where JECFA assessments are not available, SFA will take into consideration relevant published scientific information such as toxicity studies as well as evaluations conducted by major developed countries.SFA reviews our food safety standards from time to time, closely monitors for new scientific evidence and engages other regulators on the impact of synthetic food colourings on human health. More information on the safety of food additives and food colourings can be found on SFA’s website:https://www.sfa.gov.sg/food-safety-tips/food-risk-concerns/risk-at-a-glance/food-additives-are-they-safeandhttps://www.sfa.gov.sg/food-safety-tips/food-risk-concerns/risk-at-a-glance/safety-of-food-colourings.Joanne Chan Sheot Harn (Associate Professor)Centre DirectorNational Centre for Food ScienceSingapore Food AgencyForum reply - 9 June 2025Forum letter by Ang Chiew Leng - 20 May 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-06-09T04:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/sfa-adopts-a-science-based-risk-management-approach-to-ensure-safety", "language": "en", "metadata": {"title": "SFA adopts a science-based risk management approach to ensure safety", "agency": "SFA", "category": "general_announcement", "content_length": 3808, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_560097137042917622", "source": "government_sfa", "text": "A-A+Media ReleasesTiberias International Food Pte Ltd fined $1,000 for food safety lapses05 Jun 2025Tiberias International Food Pte Ltd was fined $1,000 by the Court yesterday for food safety lapses committed under the Environmental Public Health (Food Hygiene) Regulations.2            In June 2024, the Ministry of Health (MOH) and Singapore Food Agency (SFA) received reports of gastroenteritis involving six individuals who had consumed food prepared by Ayam Penyet President, which is a retail food establishment under Tiberias International Food Pte Ltd. None were hospitalised.3           MOH and SFA conducted a joint inspection at the food establishment’s premises located at Hillion Mall and found multiple food safety lapses. These included a dirty chiller, which increases the risk of cross contamination in food items, as well as dirty racks and wall tiles, which were indicative of poor food safety standards in the premises.The food safety lapses detected included a dirty chiller (left) and dirty wall tiles (right) (Photos: SFA)4              All food operators should ensure their premises are clean and well-maintained, as well as adhere to proper food hygiene and food safety requirements. SFA will not hesitate to take enforcement action against food operators found to be in violation of the Environmental Public Health Act. Offenders are liable on conviction to a fine not exceeding $2,000 and, in the case of a continuing offence, to a further fine not exceeding $100 for everyday or part thereof during which the offence continues after conviction.5              Food safety is a joint responsibility. Members of the public who come across poor food safety practices in food establishments are advised not to patronise them and provide feedback via our online feedback form (www.sfa.gov.sg/feedback) with details for our follow-up investigations.Issued by the Singapore Food Agency5 June 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-06-05T10:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/tiberias-international-food-pte-ltd-fined--1-000-for-food-safety-lapses", "language": "en", "metadata": {"title": "Tiberias International Food Pte Ltd fined $1,000 for food safety lapses", "agency": "SFA", "category": "general_announcement", "content_length": 4207, "keywords": ["food establishment"], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_-4553173182934934401", "source": "government_sfa", "text": "A-A+Media ReleasesSingapore Food Statistics 202405 Jun 2025The Singapore Food Agency (SFA) has published the Singapore Food Statistics(SgFS) 2024, an annual publication of Singapore’s food supply and food safety data over the past 3 years.Key Highlights from 2022 to 2024Diversifying Import Sources2Singapore is a small and open economy which imports more than 90% of our food supply. This leaves us vulnerable to supply chain disruptions in an increasingly volatile and challenging operating environment. To minimise the impact of such disruptions, diversification remains SFA’s core strategy to ensure food security by reducing our reliance on any single source. In 2024, Singapore has increased its food supply sources to 187 countries/regions, up from just 140 around two decades back.3Even as we diversify our food sources, food safety remains key. Accreditation at the source is required for the import of food items that carry higher food safety risks and animal diseases that could impact local public health and trade (e.g., livestock, meat and eggs). In 2024, SFA approved Portugal as a new source for pork, Brunei and Poland as new sources for beef, and Türkiye as a new source for poultry. SFA will continue to facilitate industry connections with commercial food suppliers through sourcing trips and work with the industry to strengthen their supply networks through the implementation of Business Continuity Plans.Building Capability and Capacity for Local Production4Local production is part of our multi-pronged approach towards food security and complements our other strategies. It serves as a form of insurance and buffer by helping to mitigate the impact of overseas food supply disruptions. In 2024, hen shell eggs, vegetable, and seafood farms contributed around 34%, 3%, and 6%, of our total food consumption respectively.5          Local production of hen shell eggs continued to grow, increasing by 13% in 2024 due to farm upgrades and improved operational efficiencies. Likewise, productivity of our egg farms has improved from 14.8 million pieces per hectare per year in 2023 to 16.7 million pieces per hectare per year in 2024. Despite a decline in production of vegetables of about 3%, the productivity has increased from 227.2 tonnes per hectare per year in 2023 to 231.4 tonnes per hectare per year in 2024. The increase in productivity for hen shell eggs and vegetable farms is evident that farms are growing more with less through the adoption of technology and innovative solutions. Partly due to the restructuring of a few fish farms in Singapore, production of seafood declined by 14% in 2024. Nevertheless, productivity of the sector increased slightly from 38.6 tonnes per hectare per year in 2023 to 40.7 tonnes per hectare per year in 2024.6          SFA remains committed to supporting our farms to build capability and capacity for local production. For example, in 2024, SFA introduced plans for the National Broodstock Centre (NBC) and the Hatchery Development and Recognition Programme (HDRP) as part of the refreshed Singapore Aquaculture Plan (SAP). For vegetables, 2025 and 2026 will see the set-up and ramp up of a few large-scale indoor vertical farms. SFA continues to review the Agri-Food Cluster Transformation (ACT) Fund to better address our farmers’ diverse and emerging needs. SFA expanded the Farm-to-Table Recognition Programme (FTTRP) which has onboarded more than 100 food businesses to date, so that consumers have more avenues to support local farms by dining at these businesses. Consumers can also play an important role in strengthening food security by supporting local produce.Ensuring Safe Food for All7           There is no food security without food safety. SFA maintains a comprehensive farm-to-fork food safety system, using a science-based risk management approach aligned with international standards. This robust framework includes data-driven inspections and horizon scanning for early alerts on food safety incidents.8               Pending the conclusion of one case still under investigation, the number of foodborne illness cases per 100,000 population in 2024 was 22.8. As more than half of the foodborne illness cases involved catered food, SFA stepped up efforts to carry out further targeted checks on food establishments supplying catered food. In addition, SFA engaged food industry associations to share key insights from these foodborne outbreaks and reminded food establishment operators on good food safety practices.9               SgFS is available for download from SFA’s website atwww.sfa.gov.sg/publications/sgfs.Issued by the Singapore Food Agency5 June 2025About the Singapore Food Agency (SFA)The mission of the Singapore Food Agency (SFA) is to ensure and secure a supply of safefood. To safeguard Singapore's food security, SFA adopts a multi-pronged approach which includes diversifying food import sources and increasing local food production. To ensure that food in Singapore is safe for consump", "timestamp": "2025-06-05T07:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/singapore-food-statistics-2024", "language": "en", "metadata": {"title": "Singapore Food Statistics 2024", "agency": "SFA", "category": "general_announcement", "content_length": 5000, "keywords": ["food security", "supply chain", "food establishment"], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_328596779076671456", "source": "government_sfa", "text": "A-A+Media ReleasesAbout 1.2 tonnes of illegally imported fresh and processed produce seized following joint SFA-ICA operation30 May 2025The Singapore Food Agency (SFA) has seized around 1.2 tonnes of fresh and processed produce illegally imported from Malaysia.2       On 28 and 29 May 2025, SFA and the Immigration & Checkpoints Authority (ICA) conducted a joint operation on delivery trucks which typically transport produce intended for direct distribution to retailers and customers. During the operation, ICA officers at Tuas Checkpoint noticed discrepancies in the consignment transported by two trucks and referred them to SFA for further checks.3       SFA found undeclared and under-declared produce such as spring onion, potato, bayam and cut cabbage imported by two importers in the trucks. All illegally imported produce were seized.4       SFA is following up with further investigations and will not hesitate to take enforcement action.Truck drivers unloading imports for inspection. (Photos: SFA)Produce is weighed and the total weight is tallied (Photo: SFA)All illegal imports were seized (Photos: SFA)5       In Singapore, food imports must meet SFA’s requirements. Illegally imported produce and food products are of unknown sources and pose a food safety risk. Food can only be imported by licensed importers, and every consignment must be declared and accompanied with a valid import permit.6       Offenders who illegally import fresh fruits and vegetables shall be liable on conviction to a maximum fine of $10,000 and/or imprisonment for a term not exceeding three years.7       Safeguarding Singapore’s borders remains a top priority for ICA. ICA will continue to conduct security checks to detect and deter illegal importation attempts to keep Singapore safe. SFA will continue to safeguard food safety through our integrated food safety system, which includes strict import regulations and enforcement, and work closely with border control agencies to deter illegal importation across our borders.Issued by the Singapore Food Agency and the Immigration & Checkpoints Authority30 May 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NoPlease tell us why.The information I needed was not available on the website.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The information was not updated.Others (please specify)NextWhat is your overall satisfaction level with our website?Very dissatisfiedVery satisfiedAvailability of Content / InformationVery dissatisfiedVery satisfiedEase of NavigationVery dissatisfiedVery satisfiedVisual DesignHow would you rate our website when compared to other government websites?Very poorVery goodAvailability of Content / InformationVery poorVery goodEase of NavigationVery poorVery goodVisual DesignDo you have any other feedback or suggestions to improve our website?0/ 200SubmitCloseTop", "timestamp": "2025-05-30T02:23:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/about-1-2-tonnes-of-illegally-imported-fresh-and-processed-produce-seized-following-joint-sfa-ica-operation", "language": "en", "metadata": {"title": "About 1.2 tonnes of illegally imported fresh and processed produce seized following joint SFA-ICA operation", "agency": "SFA", "category": "general_announcement", "content_length": 4404, "keywords": [], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
{"id": "sfa_newsroom_4467949715349767344", "source": "government_sfa", "text": "A-A+Media RepliesSFA-AVS Statement on the Impact of HPAI Detection in a Commercial Poultry Farm in Brazil on Singapore’s Food Supply19 May 2025Singapore’s Poultry SupplySingapore does not import poultry or poultry products from the establishment affected by Highly Pathogenic Avian Influenza (HPAI) in Brazil. We also have in place bird flu regionalisation arrangements with Brazil. Under such arrangements, imports from affected establishments and those within a buffer zone may be suspended while those imports from unaffected areas outside the buffer zone can continue.The Singapore Food Agency (SFA) also works with the industry to accredit new sources of poultry that meet our food safety requirements. While our overall supply of poultry is currently stable, we can expect supply fluctuations from time to time due to disease outbreaks and supply disruptions. For instance, several countries are affected by bird flu outbreaks which affected their poultry production.Source diversification remains a key food security strategy for Singapore. Diversification reduces the impact of disruption from any single source as our importers can turn to alternative sources quickly to stabilise our food supply. Other than poultry from Brazil, which is one of our top sources of poultry, Singapore’s poultry supply is also well-diversified with 30 accredited sources. This includes countries such as Indonesia, Thailand, Denmark, and Malaysia. If there are supply disruptions from any source, we will work with the industry to increase chilled and frozen chicken supply from other sources if necessary.The food industry is encouraged to diversify and import from various sources and take steps to contribute to our resilience by implementing Business Continuity Plans. Consumers are also encouraged to be flexible with their food options in the event of disruption.Keeping out bird fluThe Animal & Veterinary Service (AVS), a cluster of the National Parks Board, is also working closely with SFA to stay vigilant and put in place precautionary measures to prevent the incursion of bird flu.These measures include horizon scanning for information related to bird flu worldwide and in the region, engagement with overseas authorities, source accreditation and import control for imported poultry and poultry products, inspections and biosurveillance of imported birds at local farms, poultry slaughterhouses, wild birds, and ornamental bird shops. For example, AVS conducts regular checks and sampling of migratory birds to test for bird flu.All imported poultry and poultry products, including eggs, must also come from sources accredited by SFA. We suspend import from regions affected by bird flu or only allow products that have been heat treated to inactivate the bird flu virus.Public advisory on wild birds and bird fluWhile Singapore remains free from bird flu, it is endemic in the region, highlighting the need for Singapore to be vigilant in our biosurveillance and biosecurity programme. People working in close contact with birds are advised to observe good personal hygiene and take necessary measures such as appropriate personal protective equipment when handling them to minimise public health risks.As a precaution, members of the public should not touch or feed wild birds, including free-roaming chickens. Veterinarians and bird owners are also reminded to be on the alert for possible bird flu infections in birds. Members of the public can report suspected cases to AVS via our website atwww.avs.gov.sg/feedbackor by calling our Animal Response Centre at 1800-476-1600.Issued by SFA and AVS19 May 2025We welcome your feedbackHelp us improve your experience on SFA's revamped corporate website by doing a 5-minute survey.Let's goWhich of the following best describes you?I work in thefood industryCheck any that apply:Food FarmerFood Trader (Importer / Exporter)Food RetailerFood ManufacturerOthers (please specify)I work in aregional / international body that regulates the food industryI am in themedia industryI am aresearcherI am aneducatorI am aSingapore Public ServantI am a member of thepublicI am atourist or travellerOthers (please specify)NextWhich of the following best describes the reason for your visit to our website?Learn about SFAUse tools and resources (e.g. search database, calculators, guides)Use eServices (e.g. apply / renew / make payment)Get the latest news related to the food industryGet the latest information on events related to the food industryLook for food-related publications (e.g. Singapore Food Statistics)Look for food-related legislationContact SFA to give feedback / submit enquiryOthers (please specify)NextWere you able to locate the information or services you needed today?YesYes, but with some difficultyPlease tell us why.The website was difficult to navigate. I was unsure or did not know where to look for the information.The search function was not effective. The results were not relevant.The information was not easy to understand.The ", "timestamp": "2025-05-18T04:00:00+08:00", "url": "https://www.sfa.gov.sg/news-publications/newsroom/nparks-sfa-statement-on-the-impact-of-hpai-detection-in-a-commercial-poultry-farm-in-brazil-on-singapore-s-food-supply", "language": "en", "metadata": {"title": "NParks-SFA Statement on the Impact of HPAI detection in a commercial poultry farm in Brazil on Singapore’s Food Supply", "agency": "SFA", "category": "general_announcement", "content_length": 5000, "keywords": ["food security"], "press_release_id": null, "policy_type": "announcement", "policy_subtype": "general"}}
