{"id": "mas_macroprudential_policy_83551433", "source": "government_mas", "text": "Decrease font size Increase font size Print this page Macroprudential Policies in Singapore MAS is responsible for macroprudential policy, which concerns the stability of the financial system as a whole. Macroprudential policy in Singapore has historically had a significant focus on the private residential property market, given its importance for household balance sheets and banks’ loan portfolios. The tables below show the current settings of macroprudential policies in Singapore. This includes tax policies set by the Ministry of Finance. Countercyclical Capital Buffer (CCyB) As MAS has not observed any broad-based domestic credit overheating in Singapore at this juncture, MAS has maintained the CCyB rate at 0%. Property market-related macroprudential policies Housing Loan-to-Value (LTV) limit LTV limits on housing loans granted by financial institutions are tiered according to the number of loans a borrower has. No. of loans LTV LimitAn LTV limit that is 20 percentage points lower is applicable if the loan tenure exceeds 30 years (or 25 years where the property purchased is a HDB flat) or loan period extends beyond the borrower's retirement age (65 years). 1st housing loan 75% 2nd housing loan 45% 3rd housing loan 35% LTV limits for mortgage equity withdrawal loans (MWLs): Type of borrower LTV Limit For a borrower with no outstanding housing loan for the purchase of another residential property 75% For a borrower with one or more outstanding housing loans for the purchase of another residential property 45% Total Debt Servicing Ratio (TDSR) and Mortgage Servicing Ratio (MSR) The TDSR cap is set at 55%, which limits the entire monthly debt obligation of borrowers at 55% of their monthly income. The MSR cap is set at 30% for housing loans granted by FIs for HDB flats and executive condominium units purchased directly from property developers. Maximum Tenure LimitThe maximum loan tenure allowed is 35 years for all housing loans granted for private property, and 30 years for public housing. Loans exceeding a tenure of 30 years for private property, and 25 years for public housing, will face tighter LTV limits. For these loans, the LTV limit is (i) 15%-25% for a borrower with one or more outstanding residential property loans and (ii) 55% for a borrower with no outstanding residential property loan. Seller's Stamp Duty (SSD) The SSD rates payable on residential property are summarised in the table below: Date of Purchase or Date of Change of Zoning / Use Holding Period SSD Rate (on the actual price or market value, whichever is higher Between 14 Jan 2011 and 10 Mar 2017 (all inclusive) Up to 1 year 16% More than 1 year and up to 2 years 12% More than 2 years and up to 3 years 8% More than 3 years and up to 4 years 4% More than 4 years No SSD payable On and after 11 Mar 2017 Up to 1 year 12% More than 1 year and up to 2 years 8% More than 2 years and up to 3 years 4% More than 3 years No SSD payable The SSD rates payable on industrial property are summarised in the table below: Date of Purchase Holding Period SSD Rate (on the actual price or market value, whichever is higher) On or after 12 Jan 2023 Up to 1 year 15% More than 1 year and up to 2 years 10% More than 2 years and up to 3 years 5% More than 3 years No SSD payable Additional Buyer’s Stamp Duty (ABSD) The ABSD rates payable on residential property (the higher of the purchase price or market value) are summarised in the table below: ABSD Rates 1st Property 2nd Property 3rd and subsequent property Singapore Citizens 0% 20% 30% Permanent Residents 5% 30% 35% Foreigners 60% regardless of number of properties owned Entities 65% regardless of number of properties owned Housing DevelopersHousing Developers refer to entities in the business of housing development (i.e. construction and sale of housing units) with respect to the subject property acquired. These include trustees for Housing Developers, which will continue to be subject to the same ABSD rate as Housing Developers. 35% regardless of number of properties ownedAs entities, Housing Developers will also be subject to the ABSD rate as follows: a) For the period on or after 16 Dec 2021, Housing Developers will be subject to the ABSD rate of 35%; and b) Housing Developers may apply for remission of 35% ABSD, subject to conditions. plus additional 5% (non - remittable) This 5% ABSD for Housing Developers is in addition to the 35% (on or after 16 Dec 2021) ABSD. This 5% will not be remitted, and is to be paid upfront upon purchase of residential property. This table shows the various macroprudential policies which were introduced in Singapore over the years since 1996. April Raised ABSD Rates ABSD rates were raised by between three and thirty percentage points across the board to pre-emptively manage investment demand, except for Housing Developers and first property purchase by Singapore Citizens and Permanent Residents. Read MAS media release, published on 26 April 2023, on Measures for a Sustainable Property Market September Raised Medium-Term Interest Rate Floor of TDSR and MSR Medium-term interest rate floor used by private financial institutions to compute a borrower’s TDSR and MSR increased by 0.5%-point to reflect higher interest rates expected over the medium term. Read MAS media release, published on 29 September 2022, on Measures to Promote Sustainable Conditions in the Property Market by Ensuring Prudent Borrowing and Moderating Demand December Tightened Total Debt Servicing Ratio (TDSR) threshold TDSR threshold tightened from 60% to 55%. Borrowers’ new mortgages cannot cause their monthly loan repayments to exceed 55% of monthly income. TDSR for refinancing existing property loans granted before 16 Dec 2021 remains at 60%. Raised ABSD Rates ABSD rates were raised by between five and fifteen percentage points across the board, except for first property purchase by Singapore Citizens and Permanent Residents. Read MAS media release, published on 15 December 2021, on Measures To Cool The Property Market July Lowered Housing LTV Limits Lowered LTV limits by 5 percentage points for all housing loans granted by FIs. Raised ABSD Rates Raised ABSD by 5 percentage points for individuals (excluding SC and SPR purchasing their first residential property), and by 10 percentage points for entities Introduced an additional ABSD of 5 percent that is non-remittable under the Remission Rules (payable on the purchase price or market value, as applicable) for developers purchasing residential properties for housing development. The ABSD rates for SC and SPR purchasing their first residential property is retained at 0 and 5 percent respectively. Read MAS media release, published on 6 July 2018, on Raising Additional Buyer's Stamp Duty Rates and Tightening Loan-to-Value Limits to Promote a Stable and Sustainable Property Market March Revisions to TDSR framework Disapplied TDSR framework to mortgage equity withdrawal loans with housing LTV ratios of 50 percent and below. Revisions to SSD Imposed SSD on holding periods of up to three years, down from four years previously; and lower the SSD rate by four percentage points for each tier. The new SSD rates range from 4 percent (for properties sold in the third year) to 12 percent (for those sold within the first year). Read MAS media release, published on 10 March 2017, on Joint Press Release on Measures Relating to Residential Property 2016 January Implementation of countercyclical capital buffer (CCyB) framework Implemented the CCyB in MAS’ macroprudential policy framework with effect from 1 January 2016. The CCyB was set at zero percent. Read MAS Annual Report 2015/2016 Page 33 September Revisions to the TDSR framework Disapplied the TDSR framework to borrowers refinancing their owner-occupied housing loan, regardless of when the residential property was bought. The refinancing of all investment property loans would be subject to the TDSR threshold, except if they can commit to a debt reduction plan to repay at least 3% of their outstanding property loan over a period of no more than three years, and they meet the lender’s credit assessment. Read MAS media release, published on 2 September 2016, on TDSR Rules on Refinancing Fine-tuned 2013 January Lowered LTV limits and raised minimum cash down payment for housing LTV limits for new housing loans to borrowers who are individuals with one outstanding housing loan and applying for another housing loan were lowered to (i) 50 percent if the loan tenure does not exceed 30 years and the loan period does not extend beyond the borrower's age of 65 years and; (ii) 30 percent if the loan tenure exceeds 30 years or the loan period does not extends beyond the borrower's age of 65 years. LTV limits for new housing loans to borrowers who are individuals with two or more outstanding housing loans and applying for another housing loan were lowered to (i) 40 percent if the loan tenure does not exceed 30 years and the loan period does not extend beyond the borrower’s age of 65 years; and (ii) 20 percent if the loan tenure exceeds 30 years or the loan period extends beyond the borrower’s age of 65 years. The LTV limit for housing loans to non-individuals was lowered to 20 percent, regardless of whether the borrower has any outstanding housing loan. Raised the minimum cash down payment for individuals applying for a second or subsequent housing loan from 10 to 25 percent. Introduction of Mortgage Servicing Ratio (MSR) for public housing loans granted by FIs The MSR was capped at 30 percent of a borrower’s gross monthly income. Raised ABSD rates ABSD rates were raised between five and seven percentage points across the board. Imposed ABSD on SPRs purchasing their first residential property and on Singapore citizens purchasing their second residential property. Read MAS media release, published on 12 January 2013, on Additional Measures To Ensure A Stable And Sustainable Property Market June Introduction of Total Debt Servicing Ratio (TDSR) framework The TDSR framework comprised the standardisation of the methodology for assessing the debt servicing ability of borrowers applying for residential property loans. FIs are required to compute the percentage of total monthly debt obligations to gross monthly income, on a consistent basis and based on a headline threshold of 60 percent. Read MAS media release, published on 29 June 2013, on MAS Introduces Debt Servicing Framework for Property Loans Download FAQs on MAS' Total Debt Servicing Framework for Property Loans and Refinements to Housing Loan Rules (516 KB) August Revised Mortgage Loan Terms for public housing The maximum tenure of new housing loans and re-financing facilities granted by FIs for the purchase of HDB flats was reduced from 35 years to 30 years. New loans with tenures exceeding 25 years and up to 30 years will be subject to tighter LTV limits. Lowered LTV limits for public housing LTV limits for new housing loans granted for the purchase of public housing to borrowers who are individuals with no outstanding housing loan were lowered to 60 percent if the loan tenure exceeds 25 years or the loan period extends beyond the borrower’s age of 65 years. LTV limits for new housing loans granted for the purchase of public housing to borrowers who are individuals with one outstanding housing loan and applying for another housing loan were lowered to (i) 50 percent if the loan tenure does not exceed 25 years and the loan period does not extend beyond the borrower’s age of 65 years; and (ii) 30 percent if the loan tenure exceeds 25 years or the loan period extends beyond the borrower’s age of 65 years. LTV limits for new housing loans granted for the purchase of public housing to borrowers who are individuals with two or more outstanding housing loans and applying for another housing loan were lowered to (i) 40 percent if the loan tenure does not exceed 25 years and the loan period does not extend beyond the borrower’s age of 65 years; and (ii) 20 percent if the loan tenure exceeds 25 years or the loan period extends beyond the borrower’s age of 65 years Read MND and HDB media release, published on 27 August 2013, on More Help, Stronger Support, Better Homes (214 KB) December Introduced MSR for Executive Condominiums (ECs) The MSR for housing loans granted by financial institutions for EC units bought directly from property developers is capped at 30 percent of a borrower’s gross monthly income. Read MND Press Release published on 9 December 2013, on Refining The Executive Condominium Housing Scheme (66.6 KB) 2012 October Introduced Maximum Loan Tenure for housing loans from financial institutions The new loan tenure rules imposed a limit of 35 years on the tenure of housing loans granted by financial institutions for the purchase of any residential property. Lowered Housing LTV limits LTV limits for new housing loans to borrowers who are individuals, if (i) the tenure exceeds 30 years; or (ii) the loan period extends beyond the retirement age of 65 years, were lowered to (iii) 40 percent for a borrower with one or more outstanding residential property loans; and (iv) 60 percent for a borrower with no outstanding residential property loan. The LTV limit for housing loans to non-individual was lowered from 50 to 40 percent. Read MAS media release, published on 6 October 2012, on MAS Restricts Loan Tenure for Residential Properties 2011 January Lowered Housing LTV limits For property buyers who are individuals with one or more outstanding housing loans: LTV limit for housing loans granted by FIs was lowered from 70 to 60 percent. For property buyers who are not individuals: LTV limit was lowered from 70 to 50 percent for housing loans granted by FIs. Increased holding period for imposition of SSD Holding period for imposition of SSD was increased from three to four years. Increased SSD rate SSD rates were raised to 16, 12, 8 and 4 percent for residential properties bought on or after January 14. 2011, and are sold in the in 1st, 2nd, 3rd and 4th year of purchase respectively. Read MAS media release, published on 13 January 2011, on Measures to Maintain a Stable and Sustainable Property Market December Imposition of Additional Buyer's Stamp Duty (ABSD) ABSD was imposed on the following categories of private residential property purchases: 10 percent for foreigners and non-individuals (corporate entities) buying any residential property; 3 percent for Singapore Permanent Residents (SPRs) owning one and buying a second and subsequent residential property; and 3 percent for Singapore Citizens (SC) owning two and buying a third and subsequent residential property. Read MAS media release, published on 7 December 2011, on Additional Buyer's Stamp Duty for a Stable and Sustainable Property Market 2010 February Lowered Housing LTV limit The LTV limit applicable to housing loans granted by financial institutions was lowered from 90 to 80 percent. SSD was re-introduced SSD was imposed on all residential properties and residential lands that are bought on or after February 20, 2010 and sold within one year from the date of purchase. The SSD was levied at 1 percent for the first $180,000 of the consideration, 2 percent for the next $180,000, and 3 percent for the balance. Read MAS media release, published on 19 February 2010, on Measures To Ensure a Stable and Sustainable Property Market August Lowered LTV limit and raised minimum cash down payment For property buyers with one or more outstanding housing loans: LTV limit was lowered from 80 to 70 percent for housing loans granted by financial institutions and the minimum cash down payment for housing was raised from 5 to 10 percent. Increased holding period for imposition of SSD For residential properties bought on or after August 30, 2010, the holding period for the imposition of SSD on residential properties sold was increased from one to three years. The SSD levied on residential properties was revised as follows: Sold within the first year of purchase, i.e. the property is held for 1 year or less from its purchase date – the full SSD rate (1 percent for the first $180,000 of the consideration, 2 percent for the next $180,000, and 3 percent for the balance) will be imposed. Sold within the second year of purchase, i.e. the property is held for more than 1 year and up to 2 years – 2/3 of the full SSD rate. Sold within the third year of purchase, i.e. the property is held for more than 2 years and up to 3 years – 1/3 of the full SSD rate. Read MAS media release, published on 30 August 2010, on Joint Press Release on Measures to Maintain a Stable and Sustainable Property Market 2009 September Disallowed Interest-only housing loans (IOL) and Interest Absorption Scheme (IAS) loans These are loans in which the developer absorbed interest payments on behalf of the borrower for a period of time. Read MAS media release, published on 14 September 2009, on Measures to Ensure a Stable and Sustainable Property Market 2005 July Increased LTV limit and decreased minimum cash down payment for housing The LTV limit applicable to housing loans granted by FIs was raised from 80 to 90 percent, and the minimum cash down payment was decreased from 10 to 5 percent. Read MAS media release, published on 19 July 2005, on MAS Issues Revised Housing Loan Rules 2001 July Cap on banks’ property exposures Property-related exposure of a bank capped at 35% of total eligible assets. October Removal of deemed income tax on gains from sale of property within 3 years of purchase The Government removed deemed income tax on gains from the sale of property within 3 years. Foreigners allowed to have SGD loans The restrictions that foreigners who were not PRs and non-Singapore companies were not allowed to obtain housing loans in Singapore dollars were lifted. Read Singapore Government press release, published on 12 October 2001, on Speech by Deputy Prime Minister Lee Hsien Loong in Parliament 1997 November Suspension of SSD The SSD was suspended to improve the liquidity of transactions in the market. Read Singapore Government press release, published on 18 November 1997, on Adjustments to the Private Residential Property Policies 1996 May Introduction of Housing Loan-to-Value (LTV) limit for Financial Institutions (FIs) Housing loan quantum not to exceed 80 percent of purchase price or valuation, whichever is lower. Foreigners disallowed to have SGD loans Disallowed the granting of Singapore dollar loans to non-Singapore Permanent Resident (SPR) foreigners and non-Singapore companies for the purchase of residential properties. Introduction of deemed income tax on gains from sale of property Deemed income tax on gains from the sale of property within 3 years of purchase was introduced to discourage speculation in the residential property market. Introduction of Seller’s Stamp Duty (SSD) The SSD was imposed on residential properties sold within three years of purchase as follows: Sold within the first year of purchase, that is, the property is held for 1 year or less from its purchase date – the full SSD rate (1 percent for the first S$180,000 of the consideration, 2 percent for the next S$180,000, and 3 percent for the balance) will be imposed. Sold within the second year of purchase, that is, the property is held for more than 1 year and up to 2 years – 2/3 of the full SSD rate. Sold within the third year of purchase, that is, the property is held for more than 2 years and up to 3 years – 1/3 of the full SSD rate. Bring forward stamp duty payment date Payment of stamp duty was brought forward to the time of agreement to purchase a property. Previously, a buyer who purchased an uncompleted property need not pay stamp duty until the title was transferred to him. This allowed property speculators who bought and sold properties quickly to pay no stamp duty. The table below lists the changes made to the housing loan-to-value (LTV) limits and residential property stamp duty tax rates since January 2009. The dates represent key policy changes to either one of selected policy measures. Housing LTV and Tax-related Measures Housing Loan-to-Value (LTV) limits (%)An LTV limit that is 20 percentage points lower is applicable if the loan tenure exceeds 30 years (or 25 years where the property purchased is a HDB flat) or loan period extends beyond the borrower’s retirement age (65 years). (tiered by loan count and borrower type) Date With no outstanding housing loans With one outstanding housing loan With two or more outstanding housing loans For non-individuals January 2009 90 90 90 90 February 2010 80 80 80 80 August 2010 80 70 70 70 January 2011 80 60 60 50 December 2011 80 60 60 50 October 2012 80 60 60 40 January 2013 80 50 40 20 March 2017 80 50 40 20 July 2018 75 45 35 15 * For February and August 2010, we used the highest tax rate for each category for the chart. Seller's Stamp Duty (SSD) rates (%) (tiered by holding period) Date Sold within the first year of purchase Sold within the second year of purchase Sold within the third year of purchase Sold within the fourth year of purchase January 2009 0 0 0 0 February 2010 1% for the first S$180,000 of the consideration, 2% for the next S$180,000, and 3% for the balance 0 0 0 August 2010 1% for the first S$180,000 of the consideration, 2% for the next S$180,000, and 3% for the balance 2/3 of the full SSD rate 1/3 of the full SSD rate 0 January 2011 16 12 8 4 December 2011 16 12 8 4 October 2012 16 12 8 4 January 2013 16 12 8 4 March 2017 12 8 4 0 Additional Buyer's Stamp Duty (ABSD) rates (%) (tiered by property count and buyer type) Date Singapore Citizens (1st property) Singapore Citizens (2nd property) Singapore Citizens (3rd and subsequent property) Permanent Residents (1st property) Permanent Residents (2nd property) Permanent Residents (3rd and subsequent property) Foreigners Non-individuals (Entities) January 2009 0 0 0 0 0 0 0 0 February 2010 0 0 0 0 0 0 0 0 August 2010 0 0 0 0 0 0 0 0 January 2011 0 0 0 0 0 0 0 0 December 2011 0 0 3 0 3 3 10 10 October 2012 0 0 3 0 3 3 10 10 January 2013 0 7 10 5 10 10 15 15 March 2017 0 7 10 5 10 10 15 15 July 2018 0 12 15 5 15 15 20 25Plus an additional 5% for Housing Developers (non-remittable). December 2021 0 17 25 5 25 30 30 35 [6] April 2023 0 20 30 5 30 35 60 65Housing Developers will continue to be subject to the ABSD rate of 35% (remittable, subject to conditions) and 5% (non-remittable).", "timestamp": "2025-09-21T17:19:55+08:00", "url": "https://www.mas.gov.sg/publications/macroprudential-policies-in-singapore", "language": "en", "metadata": {"agency": "MAS", "category": "macroprudential_policy", "content_length": 81069, "keywords": ["housing", "debt servicing", "macroprudential", "property", "TDSR", "stamp duty", "residential", "LTV", "ABSD", "loan", "investment", "MSR", "borrower", "mortgage"], "title": "", "policy_type": "macroprudential_policy", "policy_subtype": "policy_framework", "affected_measures": ["ABSD", "TDSR", "LTV", "MSR"], "borrower_segments": ["private_property", "hdb_upgraders", "investors"], "financial_institutions_affected": ["banks", "finance_companies"], "risk_management": true}}
